
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	СтандартнаяОбработка=Ложь;

	
	Если  РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда

		//А=Объект.Ссылка;
		
		Объект.Наименование=Параметры.тКрДоговор;
		Объект.Владелец=Параметры.тКрДоговор;
		Объект.Должник=Параметры.тДолжник;
		Объект.КредитныйДоговор=Параметры.тКрДоговор;
		Объект.Банк=Параметры.тЦедент;
		Объект.НомерЦессии=Параметры.тНомерДоговораЦессии;
		Объект.ДатаЦессии=Параметры.тДатаЦессии;
		Объект.ТипКредита=Параметры.тВидПродукта;
		Объект.СуммаЗадолженностиПереданная=Параметры.тСуммаЗадолженностиПереданная;
		Объект.ОтветственныйСотрудник=Параметры.тОтветственныйСотрудник;
		
		
		
		Объект.ДатаКредитногоДоговора=ДатаКрДог(Параметры.тКрДоговор);
		
		Объект.ДатаСоздания=ТекущаяДата(); 
		
		//номерСтрокиСпрГруппаДог=Параметры.номерСтроки;
		//спрГруппадоговоровЮристСсылка=Параметры.спрГруппадоговоровЮристСсылка;

		
		
		
	Иначе
		  Объект.Наименование=Объект.КредитныйДоговор;
		  
	
		
    КонецЕсли;
		
	
КонецПроцедуры

&НаСервере
Функция ЕстьлиСудКДоговору(дог)
	
	        структураСуд=Новый Структура;
	   
	          	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	РегистрСведенийСоответствиеСудДоговорИзФайла.Договор КАК Договор,
					|	РегистрСведенийСоответствиеСудДоговорИзФайла.Суд КАК Суд,
					|	РегистрСведенийСоответствиеСудДоговорИзФайла.ДатаЗагрузки КАК ДатаЗагрузки
					|ИЗ
					|	РегистрСведений.РегистрСведенийСоответствиеСудДоговорИзФайла КАК РегистрСведенийСоответствиеСудДоговорИзФайла
					|ГДЕ
					|	РегистрСведенийСоответствиеСудДоговорИзФайла.Договор = &Договор
					|
					|УПОРЯДОЧИТЬ ПО
					|	ДатаЗагрузки УБЫВ";
				
				Запрос.УстановитьПараметр("Договор", дог);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество()>0  Тогда
				     Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					     структураСуд.Вставить("Суд",ВыборкаДетальныеЗаписи.Суд);
					
					
				    КонецЦикла;

				
				Иначе
					
					   структураСуд.Вставить("Суд",Неопределено);
					
				
				КонецЕсли;
				
				
				
								
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	              
				
	Возврат структураСуд;			
				
				
	

КонецФункции // ()



&НаСервере
Функция ДатаКрДог(дог)

	
	        	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.ДатаФинансирования КАК ДатаФинансирования
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", дог);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		датаДог= ВыборкаДетальныеЗаписи.ДатаФинансирования;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

  Возврат датаДог;
	
КонецФункции // ()




&НаСервере
Функция ЕстьЛиВкладкаСудСудебнаяСтадияСписокДел(ссылкаДело)

	  ссылкаСудСудебнаяСтадияСписокДел=Неопределено;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВкладкаСудСудебнаяСтадияСписокДел.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВкладкаСудСудебнаяСтадияСписокДел КАК ВкладкаСудСудебнаяСтадияСписокДел
		|ГДЕ
		|	ВкладкаСудСудебнаяСтадияСписокДел.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", ссылкаДело);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
	
		     Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		       ссылкаСудСудебнаяСтадияСписокДел=ВыборкаДетальныеЗаписи.Ссылка;
		
	         КонецЦикла;
	
	
	КонецЕсли;
	 
	
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат ссылкаСудСудебнаяСтадияСписокДел;
	

КонецФункции // ()

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
		
	
	//            Если   ТекущийОбъект.ЭтоНовый() Тогда
	//
	//			        структураСуд= ЕстьлиСудКДоговору(ТекущийОбъект.Владелец);
	//									 
	//									 Если структураСуд.Суд<>Неопределено Тогда
	//									     
	//									      
	//									     
	//									      новаяЗаписьСудВкладка=Справочники.ВкладкаСудСудебнаяСтадияСписокДел.СоздатьЭлемент();
	//									      
	//									      новаяЗаписьСудВкладка.Владелец=ТекущийОбъект.Ссылка;
	//									      
	//									      новаяЗаписьСудВкладка.НазваниеСуда=структураСуд.Суд;
	//									      новаяЗаписьСудВкладка.АдресСудаВкладка=структураСуд.Суд.Адрес;
	//									      
	//									      
	//									      новаяЗаписьСудВкладка.ТипСуда= Строка(структураСуд.Суд.ТипСуда);
	//									      
	//									      
	//									      новаяЗаписьСудВкладка.Записать();
	//									      
	//									     
	//									     
	//									 
	//									 КонецЕсли;

	//

	//			 
	//			   
	//		   КонецЕсли;	  
	//		   

	//
	
	
КонецПроцедуры





&НаСервере
Процедура ЗаписатьВкладкаСудСудебнаяСтадияСписокДел()

	         	    структураСуд= ЕстьлиСудКДоговору(Объект.Владелец);
	    								 
	    								 Если структураСуд.Суд<>Неопределено Тогда
	    								     
	    								      
	    								     
	    								      новаяЗаписьСудВкладка=Справочники.ВкладкаСудСудебнаяСтадияСписокДел.СоздатьЭлемент();
	    								      
	    								      новаяЗаписьСудВкладка.Владелец=Объект.Ссылка;
	    								      
	    								      новаяЗаписьСудВкладка.НазваниеСуда=структураСуд.Суд;
	    								      новаяЗаписьСудВкладка.АдресСудаВкладка=структураСуд.Суд.Адрес;
	    								      
	    								      
	    								      новаяЗаписьСудВкладка.ТипСуда= Строка(структураСуд.Суд.ТипСуда);
	    								      
	    								      
	    								      новаяЗаписьСудВкладка.Записать();
	    								      
	    								     
	    								     
	    								 
	    								 КонецЕсли;

	  
	    	

	
	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	   	
      Если ЭтоНовый Тогда
	  
	  	     ЗаписатьВкладкаСудСудебнаяСтадияСписокДел();

			  
			 // обновлю регистр РегистрСведенийПоследнийДокументКредитногоДоговора
			 ФункцииДляОтчетов.ДанныеПоследнегоДокументаПоДоговоруОдному(Объект.КредитныйДоговор);
										 
	  
	  КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	  Если  Параметры.Ключ.Пустая() Тогда
		  
			 			  ЭтоНовый=Истина;
			  
	 		
       КонецЕсли;

	
	
КонецПроцедуры



