Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.АктВыполненныхРабот";
	КомандаПечати.Идентификатор = "Акт";
	КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	
КонецПроцедуры 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акт", "Акт",
		СформироватьАкты(МассивОбъектов),"Документ.Приказ.Акт");
	КонецЕсли;
	
КонецПроцедуры 

Функция СформироватьАкты(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Для каждого Ссылка из МассивОбъектов Цикл
		ТабДокументОбъекта = СформироватьАкт(Ссылка);
		Если ТабДокумент.ВысотаТаблицы > 0 И ТабДокументОбъекта.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц()
		КонецЕсли;
		ТабДокумент.Вывести(ТабДокументОбъекта)
	КонецЦикла;
	
	Возврат ТабДокумент
	
КонецФункции 

Функция СформироватьАкт(СсылкаНаДокумент)
	
	Если Ложь Тогда СсылкаНаДокумент = Документы.АктВыполненныхРабот.НайтиПоНомеру(""); КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ДоговорОказанияУслуг = СсылкаНаДокумент.Агент.ДоговорОказанияУслуг;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДатаНачала", Формат(СсылкаНаДокумент.ДатаНачала, "ДЛФ=D"));
	Параметры.Вставить("ДатаОкончания", Формат(СсылкаНаДокумент.ДатаОкончания, "ДЛФ=D"));
	Параметры.Вставить("ДоговорОказанияУслуг", ДоговорОказанияУслуг);
	ОбластьШапка.Параметры.Заполнить(Параметры);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаВознаграждения");
	
	Для Каждого СтрокаПлатежей Из СсылкаНаДокумент.Платежи Цикл
		ОбластьСтрока.Параметры.Заполнить(СтрокаПлатежей);
		
		ПараметрыСтроки = Новый Структура;
		ПараметрыСтроки.Вставить("ФИО", СтрокаПлатежей.Договор.Владелец);
		ПараметрыСтроки.Вставить("НомерСчета", СтрокаПлатежей.Договор.НомерДоговора);
		ПараметрыСтроки.Вставить("Реестр", СтрокаПлатежей.Реестр.НомерДляПечати);
		ОбластьСтрока.Параметры.Заполнить(ПараметрыСтроки);
		
		ТабличныйДокумент.Вывести(ОбластьСтрока)
	КонецЦикла;
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итоги");
	ИтогоСуммаПлатежей = СсылкаНаДокумент.Платежи.Итог("СуммаПлатежа");
	ИтогоСуммаВознаграждения = СсылкаНаДокумент.Платежи.Итог("СуммаВознаграждения");
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИтогоСуммаПлатежей", СтроковыеФункцииКлиентСервер.глФорматЧ(ИтогоСуммаПлатежей));
	Параметры.Вставить("ИтогоСуммаВознаграждения", СтроковыеФункцииКлиентСервер.глФорматЧ(ИтогоСуммаВознаграждения));
	Параметры.Вставить("ИтогоСуммаПлатежейПрописью", ЧислоПрописью(ИтогоСуммаПлатежей, "Л=ru_RU; ДП=Ложь", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	Параметры.Вставить("ИтогоСуммаВознагражденияПрописью", ЧислоПрописью(ИтогоСуммаВознаграждения, "Л=ru_RU; ДП=Ложь", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	
	ОбластьИтого.Параметры.Заполнить(Параметры);
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	Параметры = Новый Структура;
	Заказчик = Константы.Руководитель.Получить();//"Перехожев А.А.";
	Параметры.Вставить("ЗАКАЗЧИК", Заказчик.ФИО);
	Параметры.Вставить("ИСПОЛНИТЕЛЬ", СсылкаНаДокумент.Агент.ФИО);
	
	ОбластьПодписи.Параметры.Заполнить(Параметры);
	ТабличныйДокумент.Вывести(ОбластьПодписи);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьШапкаАкта = Макет.ПолучитьОбласть("ШапкаАкта");
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДатаНачала", Формат(СсылкаНаДокумент.ДатаНачала, "ДЛФ=D"));
	Параметры.Вставить("ДатаОкончания", Формат(СсылкаНаДокумент.ДатаОкончания, "ДЛФ=D"));
	Параметры.Вставить("НомерАкта", СсылкаНаДокумент.НомерАкта);
	Параметры.Вставить("ДатаАкта", Формат(СсылкаНаДокумент.Дата, "ДЛФ=D"));
	
	Параметры.Вставить("ДоговорОказанияУслуг", ДоговорОказанияУслуг);
	Параметры.Вставить("ИтогоСуммаПлатежей", СтроковыеФункцииКлиентСервер.глФорматЧ(ИтогоСуммаПлатежей));
	Параметры.Вставить("ИтогоСуммаВознаграждения", СтроковыеФункцииКлиентСервер.глФорматЧ(ИтогоСуммаВознаграждения));
	Параметры.Вставить("ИтогоСуммаПлатежейПрописью", ЧислоПрописью(ИтогоСуммаПлатежей, "Л=ru_RU; ДП=Ложь", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	Параметры.Вставить("ИтогоСуммаВознагражденияПрописью", ЧислоПрописью(ИтогоСуммаВознаграждения, "Л=ru_RU; ДП=Ложь", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	
	Параметры.Вставить("ФИО_Заказчика", Заказчик.ФИО_Полностью);
	Параметры.Вставить("РеквизитыБанка_Заказчика", Заказчик.РевизитыБанка);
	
	Параметры.Вставить("ФИО_Исполнителя", СсылкаНаДокумент.Агент.ФИО_Полностью);
	Параметры.Вставить("РеквизитыБанка_Исполнителя", СсылкаНаДокумент.Агент.РевизитыБанка);
	
	ОбластьШапкаАкта.Параметры.Заполнить(Параметры);
	ТабличныйДокумент.Вывести(ОбластьШапкаАкта);
	
	ТабличныйДокумент.Вывести(ОбластьПодписи);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Возврат ТабличныйДокумент;
	
КонецФункции