
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
		 
	    ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИсправитьРегионНаСервере(ДвоичныеДанные, Расширение)

	   ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Расширение);
	   ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
	 	    
	   ФайлЕксел.Прочитать(ФайлEXCELНаСервере,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	   УдалитьФайлы(ФайлEXCELНаСервере);

	   
	   
		
	   //ФайлЕксел.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();

	   
	      Для каждого стр Из ТаблицаЗначений Цикл

			  
			  //стр.ПравильноеНазвание
			  //стр.Вариант1
			  //стр.Вариант2
			  
			  Если стр.Вариант1<>"" Тогда
				  
				    ПоменятьНазваниеРеиона(стр.Вариант1,стр.ПравильноеНазвание);

			  	
			  
				КонецЕсли;
				
				
				 Если стр.Вариант2<>"" Тогда
				  
				    ПоменятьНазваниеРеиона(стр.Вариант2,стр.ПравильноеНазвание);
					
					
				КонецЕсли;
				
				
				 Если стр.Вариант3<>"" Тогда
				  
				    ПоменятьНазваниеРеиона(стр.Вариант3,стр.ПравильноеНазвание);
					
					
				КонецЕсли;
				

				 Если стр.Вариант4<>"" Тогда
				  
				    ПоменятьНазваниеРеиона(стр.Вариант4,стр.ПравильноеНазвание);
					
					
				КонецЕсли;
				
			 
			  
		  КонецЦикла;
	
	
	
 КонецПроцедуры
	  
 
 &НаСервере
 Процедура ПоменятьНазваниеРеиона(староеНазвание,новоеНазвание)
	 
	         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Регионы.Ссылка КАК Ссылка,
		|	Регионы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Регионы КАК Регионы
		|ГДЕ
		|	Регионы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", староеНазвание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		  об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		  об.Наименование=новоеНазвание;
		  об.Записать();
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	   
	 
 	
 
 КонецПроцедуры
 

&НаКлиенте
Процедура ИсправитьРегион(Команда)
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);

	
	ИсправитьРегионНаСервере(ДвоичныеДанные,Файл.Расширение);
	
	Сообщить("Ок");
КонецПроцедуры


