
&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	
	  ПреобразоватьФайлыКлиент.ФонЗаданиеПеределатьДОсНаPDF();
	
	
	
КонецПроцедуры

&НаСервере
Процедура КомандаТестСозданиеДелФонНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаТестСозданиеДелФон(Команда)
	
	 //КомандаТестСозданиеДелФонНаСервере();
	
	ФункцииДляОтчетов.ФоновоеЗаданиеСозданиеДелаИзВходящих();
	Сообщить("ОК");
	
КонецПроцедуры


&НаСервере
Функция ПолучитьПутьТомаНаСервере()

	
	  строкаПуть="";
	  ссылкаСправочник=Неопределено;
	  
	     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТомаХраненияФайлов.ПолныйПутьWindows КАК ПолныйПутьWindows,
		|	ТомаХраненияФайлов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТомаХраненияФайлов КАК ТомаХраненияФайлов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		строкаПуть=ВыборкаДетальныеЗаписи.ПолныйПутьWindows;
		ссылкаСправочник=ВыборкаДетальныеЗаписи.Ссылка;
		
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	об=ссылкаСправочник.ПолучитьОбъект();
	
	 об.ПолныйПутьWindows=ПутьНовыйТома;
	 
	 об.Записать();
	
	
	  
	Возврат  строкаПуть;
	
	

КонецФункции // ()



&НаКлиенте
Процедура ПолучитьПутьТома(Команда)
	// Вставить содержимое обработчика.
	
	 стр= ПолучитьПутьТомаНаСервере();
	 
	 Сообщить(стр);
	 
	
КонецПроцедуры

&НаКлиенте
Процедура ТестГАС(Команда)
	// Вставить содержимое обработчика.
	
	   ПреобразоватьФайлыКлиент.ОбработатьФайлыPostGAS();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПочтовыйКлиент(Команда)
	// Вставить содержимое обработчика.
	   ПреобразоватьФайлыКлиент.ЗапускПочтовыйАгентГАС();
	
КонецПроцедуры




  
  
