
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Вставить содержимое обработчика
	
	
	стрДанные = Элементы.Список.ТекущиеДанные;
	
   НомерЦессии= стрДанные.НомерДоговора;

	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("НомерДоговора",НомерЦессии);
	
	
	ОповеститьОВыборе(СписокПараметров);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	  СтандартнаяОбработка=Ложь;
	
	
	  НомерЦессии= Элемент.ТекущиеДанные.НомерДоговора;
	
		
	
КонецПроцедуры


