Процедура ОбработкаПроведения(Отказ, Режим)
	Отказ = ДоступностьИзмененийПоДатеЗапрета(Дата);
	Для Каждого ТекСтрокаДолжники Из Должники Цикл
		// регистр Выезд 
		Движение = Движения.Выезд.Добавить();
		Движение.Период 		= Дата;
		Движение.Сотрудник 		= Сотрудник;
		Движение.Должник 		= ТекСтрокаДолжники.Должник;
		Движение.РежимРаботы 	= ТекСтрокаДолжники.РежимРаботы;
		Движение.Дата 			= ТекСтрокаДолжники.Дата;
		Движение.Новый 			= Ложь;
		
		Если ТекСтрокаДолжники.РежимРаботы = Перечисления.РежимыРаботы.Выезд Тогда
			// регистр ПланВыездов Приход
			Движение = Движения.ПланВыездов.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			Движение.Сотрудник 		= Сотрудник;
			Движение.Должник 		= ТекСтрокаДолжники.Должник;
			Движение.Дата			= ТекСтрокаДолжники.Дата;
			Движение.Планирование 	= 1;
		
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Должники.Свернуть("Дата, Должник, РежимРаботы", "");	
КонецПроцедуры

