
&НаСервере
Функция ПечатьНаСервере()
	
	      табл=Новый Массив;
	
	         	Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	РеестрДолжники.Должник КАК Должник
					|ИЗ
					|	Документ.Реестр.Должники КАК РеестрДолжники
					|ГДЕ
					|	РеестрДолжники.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", Объект.Реестр);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					//Таблица = Новый ТабличныйДокумент;
					
				//	ОбработкаОтчета = Отчеты.КарточкаДолжника.Создать();
				//    ОбработкаОтчета.Должник = ВыборкаДетальныеЗаписи.Должник;
				//    ОбработкаОтчета.КарточкаДолжника(Таблица, ВыборкаДетальныеЗаписи.Должник);
				//	
				////	Таблица.Защита = Истина;
				//Таблица.ТолькоПросмотр = Истина;
				//    Таблица.Показать("Карточка " + Строка(ВыборкаДетальныеЗаписи.Должник));
					
				  табл.Добавить(ВыборкаДетальныеЗаписи.Должник);
				  
				
				КонецЦикла;
				
		Возврат табл;		
				
КонецФункции


&НаКлиенте
Процедура Печать(Команда)
	
	//Таблица = Новый ТабличныйДокумент;
	
      масс=ПечатьНаСервере();
	  
	  
	  ТабДокумент= ПолучитьМакетСформироватьНаСервере(масс);
	  
	  
	  ТабДокумент.Показать();
	  
	  //
	//Таблица.Защита = Истина;
	//Таблица.ТолькоПросмотр = Истина;
	//
	//Таблица.Показать("Карточка ");
	//	
		
		
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетСформироватьНаСервере(масс)
	
	   Перем ДатаАктуальности;
	
	   ДатаАктуальности = ТекущаяДата();
	
	    ТабДокумент=Новый ТабличныйДокумент;
    	ТабДокумент.АвтоМасштаб=Истина;
	    ТабДокумент.ТолькоПросмотр=Истина;
		
	    Макет = Отчеты.КарточкаДолжника.ПолучитьМакет("КарточкаДолжника");
		
		
		//Секция = Макет.ПолучитьОбласть("Шапка");
		//
		//
		//ТабДокумент.Вывести(Секция);
		Для Каждого элем из масс Цикл
			
			Запрос = Новый Запрос;
		  	Запрос.Текст = 	"ВЫБРАТЬ
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ТекущийОсновнойДолг) КАК ТекущийОсновнойДолг,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ВсегоЗадолженность) КАК ВсегоЗадолженность,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ПросроченныеПроценты) КАК ПросроченныеПроценты,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг) КАК ПросроченныйОсновнойДолг,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.Неустойка) КАК Неустойка,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ДнейПросрочки) КАК ДнейПросрочки,
			               	|	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности КАК ДатаРасчетаЗадолженности,
			               	|	ДанныеДоговоровСрезПоследних.Договор.Ссылка КАК Договор,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.ТекущиеПроценты) КАК ТекущиеПроценты,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.Госпошлина) КАК Госпошлина,
			               	|	СУММА(ДанныеДоговоровСрезПоследних.Прочее) КАК Прочее
			               	|ИЗ
			               	|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&Момент, Договор.Владелец = &Должник) КАК ДанныеДоговоровСрезПоследних
			               	|
			               	|СГРУППИРОВАТЬ ПО
			               	|	ДанныеДоговоровСрезПоследних.Договор,
			               	|	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности,
			               	|	ДанныеДоговоровСрезПоследних.Договор.Ссылка";
			
			Запрос.УстановитьПараметр("Момент",  ДатаАктуальности);
			Запрос.УстановитьПараметр("Должник", элем);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			
		    Секция = Макет.ПолучитьОбласть("Шапка");
			Секция.Параметры.ФИО=элем.Наименование;
			
			
			
			МестоРаботы = "";
			ДополнительныеДанные = Справочники.ДополнительныеДанные.Выбрать(, элем);
			Пока ДополнительныеДанные.Следующий() = 1 Цикл
				Если ДополнительныеДанные.Реквизит.Пустая() = 0 Тогда
					Если СокрЛП(ДополнительныеДанные.Реквизит.Наименование)  = "Место работы (наименование организации)" Тогда
						МестоРаботы = СокрЛП(ДополнительныеДанные.Наименование);
						Прервать;
					КонецЕсли
				КонецЕсли
			КонецЦикла;

			ДопДанные=Макет.ПолучитьОбласть("ДопДанные");
			ДопДанные.Параметры.ГодРождения=элем.ДатаРождения;
			ДопДанные.Параметры.МестоРаботы=МестоРаботы;
			ДопДанные.Параметры["ПаспортныеДанные"] = СокрЛП(элем.НомерПаспорта);

			
			// Телефоны
			
	        ТелефоныОбл= Макет.ПолучитьОбласть("Телефоны");
			 
		    Телефоны = Справочники.Телефоны.Выбрать(, элем);
						
              			
			
		    ТабДокумент.Присоединить(Секция);
			ТабДокумент.Присоединить(ДопДанные);
			ТабДокумент.Присоединить(ТелефоныОбл);
			Пока Телефоны.Следующий() Цикл
				 ОбластьТелефон=Макет.ПолучитьОбласть("Телефон");
				 ОбластьТелефон.Параметры["НомерТелефона"] = Телефоны.Наименование;
				 ТабДокумент.Присоединить(ОбластьТелефон);
			КонецЦикла;  

			
            АдресаОбл=Макет.ПолучитьОбласть("Адреса");  
			ТабДокумент.Присоединить(АдресаОбл);
			
			
			
			
			// Адреса
	 	    Адреса = Справочники.Адреса.Выбрать(, элем);
			Пока Адреса.Следующий() Цикл
				ОбластьАдрес=Макет.ПолучитьОбласть("Адрес");
				ОбластьАдрес.Параметры["Адрес"] = Адреса.Наименование;
				ОбластьАдрес.Параметры["ТипАдреса"] = Адреса.Тип;
				ТабДокумент.Присоединить(ОбластьАдрес);
			КонецЦикла;  
			
		  //  Договор
		  Для каждого СтрокаДоговоры Из Результат Цикл
			  
			    ОбластьДоговор=Макет.ПолучитьОбласть("Договор");
				
				ОбластьДоговор.Параметры.Заполнить(СтрокаДоговоры);
				ОбластьДоговор.Параметры["ДатаАктуальности"] = ДатаАктуальности;
				спрДоговор=СтрокаДоговоры.Договор.ПолучитьОбъект();
				ОбластьДоговор.Параметры["НомерДоговора"]= спрДоговор.НомерДоговора;
				ОбластьДоговор.Параметры["ДатаФинансирования"]= спрДоговор.ДатаФинансирования;
				ОбластьДоговор.Параметры["Банк"]= спрДоговор.Банк;
				ТабДокумент.Присоединить(ОбластьДоговор);
		  КонецЦикла; 
			

		  КонтактыОбл=Макет.ПолучитьОбласть("Контакты");
		  ТабДокумент.Присоединить(КонтактыОбл);
			
			
		   // Контакты
			Отбор = Новый Структура("Должник", элем);
			
			
			
			Контакты = Документы.Контакт.Выбрать(,,Отбор);
			Пока Контакты.Следующий() Цикл
				
				ОбластьКонтакт=Макет.ПолучитьОбласть("Контакт");
				
				ОбластьКонтакт.Параметры["ОписаниеКонтакта"] 	= Строка(Контакты.Дата) + ", " + Строка(Контакты.ТипКонтакта) + ", причина неплатежа: " + Строка(Контакты.ПричинаНеплатежа);
				ОбластьКонтакт.Параметры["Комментарий"] 		= Контакты.Комментарий;
				ТабДокумент.Присоединить(ОбластьКонтакт);
			КонецЦикла;  
			

			Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 3);
			Макет.Область("Шапка").ГраницаСверху = Линия; 
			
			//Секция.ГраницаСверху = Линия;
			
		  
			
			
		КонецЦикла;
		
		
		
		Возврат  ТабДокумент;

		
		
		
  
	
	
КонецФункции	



&НаСервере
Процедура ЗаполнитьКарточкуНаСервере(Таблица, Знач ТекДолжник)
	
	//ОбработкаОтчета = Отчеты.КарточкаДолжника.Создать();
	//ОбработкаОтчета.Должник = ТекДолжник;
	//ОбработкаОтчета.КарточкаДолжника(Таблица, ТекДолжник);
	
КонецПроцедуры
