&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Об = РеквизитФормыВЗначение("Объект");
	ЭтоНовый = Об.ЭтоНовый();
	
	ТекущийМенеджер = Константы.Менеджер.Получить();
	Если ЭтоНовый Тогда
		Объект.Дата = КонецНедели(Объект.Дата);
		Объект.Менеджер = ТекущийМенеджер;
		Объект.Сотрудник = ПараметрыСеанса.Пользователь;
	КонецЕсли; 
	
	ЭтоТекущийМенеджер = (ПараметрыСеанса.Пользователь = ТекущийМенеджер);
	Элементы.Подписан.Доступность = ЭтоТекущийМенеджер;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьПоДолжникам()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Дата, Должник, РежимРаботы", "");
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименованиеНедели()
	Элементы.НадписьНеделя.Заголовок = СтрШаблон("Неделя № %1", НеделяГода(Объект.Дата));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьНаименованиеНедели();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = КонецНедели(Объект.Дата);
	ОбновитьНаименованиеНедели();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Элемент.ТекущиеДанные.Дата = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандФормы(Команда)
	Если Команда.Имя = "ОбщийПланЗаполнить" Тогда
		ОбщийПланЗаполнить();
	ИначеЕсли Команда.Имя = "ВыездыЗаполнить" Тогда
		ВыездыЗаполнить();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОбщийПланЗаполнить()
	Об = РеквизитФормыВЗначение("Объект");
	тзДолжники = Об.Должники.Выгрузить();
	
	тзДолжники.Свернуть("Дата, Должник, РежимРаботы", "");
	
	ТЗ = тзДолжники.Скопировать();
	ТЗ.Колонки.Добавить("План");
	ТЗ.ЗаполнитьЗначения(1, "План");
	
	ТЗ.Свернуть("Дата, РежимРаботы", "План");
	
	Об.ГрафикРаботы.Загрузить(ТЗ);

	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры // ОбщийПланЗаполнить()

&НаСервере
Процедура ВыездыЗаполнить()
	
	Об = РеквизитФормыВЗначение("Объект");
	
	ТЗ = Об.Должники;
	ТЗ.Свернуть("Дата, Должник, РежимРаботы", "");
	
	тзДолжники = Объект.Выезды.Выгрузить();
	тзДолжники.Очистить();
	
	СписокДолжников = ТЗ.ВыгрузитьКолонку("Должник");
	
	тзСуммыДолга = ОбщийМодульИнформация.ПолучитьТаблицуДанныхПоДоговорам(СписокДолжников, Объект.Дата);
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		Если НЕ СтрокаТЗ.РежимРаботы = Перечисления.РежимыРаботы.Выезд Тогда
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрока = тзДолжники.Добавить();
		
		НоваяСтрока.Дата = СтрокаТЗ.Дата;
		НоваяСтрока.Район = СтрокаТЗ.Должник.Район;
		НоваяСтрока.Направление = СтрокаТЗ.Должник.Направление;
		НоваяСтрока.Количество = 1;
		
		СтрокаОстатки = тзСуммыДолга.Найти(СтрокаТЗ.Должник, "Должник");
		Если СтрокаОстатки = Неопределено Тогда
			НоваяСтрока.СуммаДолга = 0;
		Иначе	
			НоваяСтрока.СуммаДолга = СтрокаОстатки.ВсегоЗадолженность;
		КонецЕсли; 
	КонецЦикла; 
	
	тзДолжники.Свернуть("Дата, Район, Направление", "Количество, СуммаДолга");
	
	Об.Выезды.Загрузить(тзДолжники);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры // ВыездыЗаполнить()
