
&НаКлиенте
Процедура НаИсполнительноеПроизводствоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если НаИсполнительноеПроизводство Тогда
	
		  Переподача=Ложь;
	
	КонецЕсли;
	  
	
КонецПроцедуры

&НаКлиенте
Процедура ПереподачаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	
	Если Переподача Тогда
	
		НаИсполнительноеПроизводство =Ложь;
	
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьЗадачуНаСервере()
	// Вставить содержимое обработчика.
	Сообщить("123");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	ВыполнитьЗадачуНаСервере();
КонецПроцедуры





