
&НаСервереБезКонтекста
Процедура ЗакрытьСтарыеПривязкиНаСервере(Знач Сотрудник, ДатаВыборки)
	// зачем это все
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Должник,
	               |	ВложенныйЗапрос.Сотрудник,
	               |	ВложенныйЗапрос.СотрМенеджер,
	               |	ВложенныйЗапрос.Ссылка
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПривязкаСотрудникСрезПоследних.Должник КАК Должник,
	               |		ПривязкаСотрудникСрезПоследних.Сотрудник КАК Сотрудник,
	               |		ПривязкаСотрудникСрезПоследних.СотрМенеджер КАК СотрМенеджер,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеестрДолжники.Ссылка) КАК Ссылка
	               |	ИЗ
	               |		РегистрСведений.ПривязкаСотрудник.СрезПоследних(, Сотрудник = &Сотрудник) КАК ПривязкаСотрудникСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Реестр.Должники КАК РеестрДолжники
	               |			ПО ПривязкаСотрудникСрезПоследних.Должник = РеестрДолжники.Должник
	               |	ГДЕ
	               |		РеестрДолжники.Ссылка.ДатаПередачи <= &Дата
	               |		И РеестрДолжники.Ссылка.Проведен = ИСТИНА
	               |		И РеестрДолжники.Ссылка.ДатаВозврата >= &Дата
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПривязкаСотрудникСрезПоследних.Должник,
	               |		ПривязкаСотрудникСрезПоследних.СотрМенеджер,
	               |		ПривязкаСотрудникСрезПоследних.Сотрудник) КАК ВложенныйЗапрос";
	Запрос.УстановитьПараметр("Дата", ДатаВыборки);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	//Выборка = Запрос.Выполнить().Выбрать();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСтарыеПривязки(Команда)
	ЗакрытьСтарыеПривязкиНаСервере(Сотрудник, ДатаВыборки);
КонецПроцедуры
