
&НаСервере
Процедура СформироватьНаСервере()
	// Вставить содержимое обработчика.
	
	БанкЭкс=Новый Массив(3);
	
	БанкЭкс[0]= Справочники.Банки.НайтиПоНаименованию("ЭКСПО");
	БанкЭкс[1]=Справочники.Банки.НайтиПоНаименованию("ЭКСПО АМБ");
	
	БанкЭкс[2]=Справочники.Банки.НайтиПоНаименованию("ЭКСПОББ");

	СсылкаДопРекв=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("VIN");
						  
    СсылкаДопРеквЗалог=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("ЗАЛОГ");
						  
		   допреквин="";
    	   допрекзалог="";

	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрДолжники.Ссылка КАК Ссылка,
		|	РеестрДолжники.НомерСтроки КАК НомерСтроки,
		|	РеестрДолжники.Должник КАК Должник,
		|	РеестрДолжники.Договор КАК Договор,
		|	РеестрДолжники.ТекущийОсновнойДолг КАК ТекущийОсновнойДолг,
		|	РеестрДолжники.ТекущиеПроценты КАК ТекущиеПроценты,
		|	РеестрДолжники.ВсегоЗадолженность КАК ВсегоЗадолженность,
		|	РеестрДолжники.ПросроченныеПроценты КАК ПросроченныеПроценты,
		|	РеестрДолжники.ПросроченныйОсновнойДолг КАК ПросроченныйОсновнойДолг,
		|	РеестрДолжники.Неустойка КАК Неустойка,
		|	РеестрДолжники.Госпошлина КАК Госпошлина,
		|	РеестрДолжники.Прочее КАК Прочее,
		|	РеестрДолжники.ДатаРасчетаЗадолженности КАК ДатаРасчетаЗадолженности,
		|	РеестрДолжники.ДнейПросрочки КАК ДнейПросрочки,
		|	РеестрДолжники.ОбработанФССП КАК ОбработанФССП,
		|	РеестрДолжники.ЗаписанВРегистр КАК ЗаписанВРегистр,
		|	РеестрДолжники.Ссылка.ДатаПередачи КАК ДатаПередачи
		|ИЗ
		|	Документ.Реестр.Должники КАК РеестрДолжники";
	
	Запрос.УстановитьПараметр("Банк", БанкЭкс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		допрекзалог="";

		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
						//Запрос = Новый Запрос;
						//Запрос.Текст = 
						//	"ВЫБРАТЬ
						//	|	ДополнительныеДанные.Наименование КАК Наименование,
						//	|	ДополнительныеДанные.Реквизит КАК Реквизит
						//	|ИЗ
						//	|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
						//	|ГДЕ
						//	|	ДополнительныеДанные.Владелец = &Владелец
						//	|	И ДополнительныеДанные.Реквизит = &Реквизит";
						//
						//Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
						//Запрос.УстановитьПараметр("Реквизит", СсылкаДопРекв);
						//
						//РезультатЗапроса = Запрос.Выполнить();
						//
						//ВыборкаДопРек = РезультатЗапроса.Выбрать();
						//
						//Пока ВыборкаДопРек.Следующий() Цикл
						//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
						//	
						//	  допреквин=допреквин+" "+ВыборкаДопРек.Наименование;
						//	
						//КонецЦикла;
						//
						////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						//
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ДополнительныеДанные.Наименование КАК Наименование,
							|	ДополнительныеДанные.Реквизит КАК Реквизит
							|ИЗ
							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
							|ГДЕ
							|	ДополнительныеДанные.Владелец = &Владелец
							|	И ДополнительныеДанные.Реквизит = &Реквизит";
						
						Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРеквЗалог);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДопРек = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДопРек.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							  допрекзалог=допрекзалог+" "+ВыборкаДопРек.Наименование;
							
						КонецЦикла;

						
						
					догСтрока="";	
				 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Договоры.НомерДоговора КАК НомерДоговора
						|ИЗ
						|	Справочник.Договоры КАК Договоры
						|ГДЕ
						|	Договоры.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", Выборка.Договор.Ссылка);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						догСтрока=ВыборкаДетальныеЗаписи.НомерДоговора;
					КонецЦикла;
					
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

										
	
		
		    Если допрекзалог<>""  Тогда
			         Запись=  Объект.ТЧ.Добавить();
				   
			        Запись.ФИО=Выборка.Должник;
					
					Запись.Залог=допрекзалог;
					
					Запись.Договор=догСтрока;
					
					Запись.ДатаПередачи=Формат(Выборка.ДатаПередачи,"ДФ=dd.MM.yyyy");
					
	
				
			
			КонецЕсли;
		
		
		
		    
			
			
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА



	
	
//	  //   
//						//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
//						// Данный фрагмент построен конструктором.
//						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
//						//
//						Запрос = Новый Запрос;
//						Запрос.Текст = 
//							"ВЫБРАТЬ
//							|	ДополнительныеДанные.Наименование КАК Наименование,
//							|	ДополнительныеДанные.Реквизит КАК Реквизит
//							|ИЗ
//							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
//							|ГДЕ
//							|	ДополнительныеДанные.Владелец = &Владелец
//							|	И ДополнительныеДанные.Реквизит = &Реквизит";
//						
//						Запрос.УстановитьПараметр("Владелец", Выборка.Должники.Должник);
//						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРекв);
//						
//						РезультатЗапроса = Запрос.Выполнить();
//						
//						ВыборкаДопРек = РезультатЗапроса.Выбрать();
//						
//						Пока ВыборкаДопРек.Следующий() Цикл
//							// Вставить обработку выборки ВыборкаДетальныеЗаписи
//							
//							  допреквин=допреквин+" "+ВыборкаДопРек.Наименование;
//							
//						КонецЦикла;
//						
//						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
//						
//						
//						Запрос = Новый Запрос;
//						Запрос.Текст = 
//							"ВЫБРАТЬ
//							|	ДополнительныеДанные.Наименование КАК Наименование,
//							|	ДополнительныеДанные.Реквизит КАК Реквизит
//							|ИЗ
//							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
//							|ГДЕ
//							|	ДополнительныеДанные.Владелец = &Владелец
//							|	И ДополнительныеДанные.Реквизит = &Реквизит";
//						
//						Запрос.УстановитьПараметр("Владелец", Выборка.Должники.Должник);
//						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРеквЗалог);
//						
//						РезультатЗапроса = Запрос.Выполнить();
//						
//						ВыборкаДопРек = РезультатЗапроса.Выбрать();
//						
//						Пока ВыборкаДопРек.Следующий() Цикл
//							// Вставить обработку выборки ВыборкаДетальныеЗаписи
//							
//							  допрекзалог=допрекзалог+" "+ВыборкаДопРек.Наименование;
//							
//						КонецЦикла;

//						
//						
//						
//                   Запись=  Объект.ТЧ.Добавить();
//				   
//				   Запись.ФИО=Выборка.Должник;
//				   
//				   Запись.Залог=допрекзалог;		


////					Запись.VINНОМЕР=допреквин;
////					
////					Запись.Залог=допрекзалог;

		
		

	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
	
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	// Вставить содержимое обработчика.
	
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ТолькоПросмотр=Истина;

	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
    Макет =  ОтчетОбъект.ПолучитьМакет("Макет");
	
		Для каждого Стр  Из Объект.ТЧ  Цикл
		
	     	 ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
             ОбластьСтрока.Параметры.ФИО=Стр.ФИО;
			 
			 ОбластьСтрока.Параметры.Договор=Стр.Договор;
			 ОбластьСтрока.Параметры.Залог=Стр.Залог;
			 ОбластьСтрока.Параметры.ДатаПередачи=Стр.ДатаПередачи;
			 
			 
	      	 ТабДокумент.Вывести(ОбластьСтрока);
	
	КонецЦикла;
	
	

	
	
	Возврат  ТабДокумент;
	
КонецФункции
&НаКлиенте
Процедура Печать(Команда)
	
	ТабДокумент= ПечатьНаСервере();
	
    ТабДокумент.Показать("Отчет по ");

	
	
	
КонецПроцедуры
