


&НаКлиенте
Процедура ФонЗаданиеПеределатьДОсНаPDF() Экспорт

	  массивСсылок=Новый Массив;
	
	  массивСсылок=ПреобразоватьФайлыСервер.ПолучитьДокументыСФлагомОтправлен(); 
	  
	  Для каждого стрСсылка  Из массивСсылок Цикл
		  
		  
		   массивСтруктур=ПреобразоватьФайлыСервер.ПолучитьПрисоединенныеФайлы(стрСсылка);

		   Для каждого стрФайл  Из массивСтруктур Цикл
		   
			   Попытка
			   
			   	   	строкаПуть= ПреобразоватьФайлыСервер.ПолучитьПутьКФайлу(стрФайл);
				 
				     имяД= ПреобразоватьФайлыСервер.ПолучитьИмяФайла(стрФайл);
					 
					 расширФайла=ПреобразоватьФайлыСервер.ПолучитьРасширениеФайла(стрФайл);
					 
				
			         файлСтруктура=ПолучитьДвоичныйФайлДОС(строкаПуть,имяД,расширФайла);

			         					  
					  Если файлСтруктура<>Неопределено  Тогда
					  
							 //Сообщить(имяД+" файлСтруктура ");
						  
						      ПреобразоватьФайлыСервер.записатьВХранилищеНовыйФайл(файлСтруктура,имяД,стрСсылка);
							  
							  ПреобразоватьФайлыСервер.УдалитьИзСправочникаФайл(стрФайл);

							  
						  
					  КонецЕсли;
					  
					   					  
					  
			   Исключение
				   
				
				   ТекстОшибки = ОписаниеОшибки();
				   Сообщить(ТекстОшибки);

				   
				   
			   КонецПопытки;
			   
				
		    
		   
	     КонецЦикла;

		  ПреобразоватьФайлыСервер.ЗаписатьвРегистрСведений(стрСсылка); 
		   
		   
	  	    
	  
	  КонецЦикла;
	  
	
	
	     Сообщить("Ок2");
	  
	
	
КонецПроцедуры




&НаКлиенте
Функция ПолучитьДвоичныйФайлДОС(строкаПуть,имяФайлаВстр,расширФайла)

	         
			 
			  ВыбФайл = Новый Файл(строкаПуть);	 
			  Если ВыбФайл.Существует() Тогда 
			    Если ВыбФайл.ПолучитьТолькоЧтение() Тогда
			        ВыбФайл.УстановитьТолькоЧтение(Ложь);
			    КонецЕсли;
				
				
				Если расширФайла="docx" Тогда
				
				  MSWord = новый COMОбъект("Word.Application");
				 //Передаем текущие параметры форм в MSWord
				 MSWord.Documents.Open(строкаПуть);	
				 MSWordDoc = MSWord.ActiveDocument();
				 
				  имяД=имяФайлаВстр;

			      ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".pdf";
			     	
			    	ВыбранныйФайл = Новый Файл(ИмяФайла);
			    	Если ВыбранныйФайл.Существует() Тогда
			    		
			    		УдалитьФайлы(ВыбранныйФайл);
			    		
			    	
			    	КонецЕсли; 

					
				 //MSWordDoc.ExportAsFixedFormat(ИмяФайла,17,,0);
				 MSWordDoc.SaveAs(ИмяФайла,17);
				 
				 
			     MSWordDoc.Close(0);
			     MSWord.Application.Quit();
				 
				 
				 
				 
				   файлСтруктура=Новый Структура;
			 
			        двФайл = Новый ДвоичныеДанные(ИмяФайла);
					
					файлСтруктура.Вставить("ДвоичныеДанные",двФайл);
					файлСтруктура.Вставить("ИмяФайла",ИмяФайла);
					
					
					ВыбранныйФайл = Новый Файл(ИмяФайла);
					Если ВыбранныйФайл.Существует() Тогда
						
						УдалитьФайлы(ВыбранныйФайл);
						
					
					КонецЕсли; 

				
				КонецЕсли;
				
				
				
				
				
				  
				  
				  
			  КонецЕсли;

			 
			  
				 
    Возврат  файлСтруктура;
	

КонецФункции // ()




  
&НаСервере
Процедура ОбработатьФайлыPostGAS() Экспорт 
	
	   строкаПуть="C:\Distr\PostGAS\";
	
	   МассивФайлов = НайтиФайлы(строкаПуть,"*.txt");
	   
	   Для каждого файлГАС Из МассивФайлов Цикл
		   
		   А=0;
		   
		   
		   файлПуть = файлГАС.ПолноеИмя;

		   
		   ответОтГАС = Новый ТекстовыйДокумент;
		   
		   ответОтГАС.Прочитать(файлПуть);

		   строкаНомерОтГАС=ответОтГАС.ПолучитьСтроку(1);
		   строкаответОтГАС=ответОтГАС.ПолучитьСтроку(2);
		   строкаСтатусОтГАС=ответОтГАС.ПолучитьСтроку(3);
		   
		   строкаВремяОтГАС=ответОтГАС.ПолучитьСтроку(4);
		   
		   
		   
			 			
			ПреобразоватьФайлыСервер.ДобавитьОтветГАС(строкаНомерОтГАС,строкаответОтГАС,строкаСтатусОтГАС,строкаВремяОтГАС);
	
		 
		  	   
	   КонецЦикла;
	   
	
	

КонецПроцедуры








&НаСервере
Процедура ЗапускПочтовыйАгентГАС() Экспорт

	
	//  shell=Новый COMОбъект("WScript.Shell");
	//  
	//   shell.Run("C:\Distr\POSTClient\MailClientForRead.exe"); 
	//
	//
		 строкаПутьПрограмма="C:\Distr\POSTClient\MailClientForRead.exe";

		  ЗапуститьПриложение(строкаПутьПрограмма,,Истина);
		  
	

КонецПроцедуры






