
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	 массивДоговоров.ЗагрузитьЗначения(Параметры.массивДоговоров);				
	 ПользовательТк=Параметры.Исполнитель;
	 
	 ФИОИсполнителя=Параметры.Исполнитель.ФИО;

	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	
	   Элементы.Сформировать.Доступность=Ложь;
	
	   Для каждого догМассива Из массивДоговоров.ВыгрузитьЗначения() Цикл
	   
				 СоздатьДокументПр(НаименованиеДокумента,догМассива);

	   
	   КонецЦикла;
	   
	   
	   
	   
	   
	   Оповестить("ОбновитьСписок1");
	   
	   
	   ЭтаФорма.Закрыть();
	   
	   
	   //Оповещение = Новый ОписаниеОповещения("ПослеГенерации",ЭтаФорма);

	   //текст="Документы сформированы.Кнопку Сформировать Разблокировать?";
	   //
	   //ПоказатьВопрос(Оповещение, текст,РежимДиалогаВопрос.ДаНет,0,,,); 
	   //
	   
	 	
		
			
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеГенерации(Результат, Параметры) Экспорт 



		Если Результат = КодВозвратаДиалога.Да Тогда

			 Элементы.Сформировать.Доступность=Истина;

			     
		Иначе

		      Элементы.Сформировать.Доступность=Ложь;


		КонецЕсли;



КонецПроцедуры





&НаСервере
Функция ПолучитьДанныеДляДокументаЗаявлениеОПроцессуальномПравопреемстве(дог)

		       данныеСтруктура=Новый Структура;
				 
				 
				данныеСтруктура.Вставить("КредитныйДоговор",дог.КрДоговор);
				данныеСтруктура.Вставить("НомерКредитногоДоговора",дог.КрДоговор.НомерДоговора);
				
		  	   данныеСтруктура.Вставить("ПервоначальныйНомерКредитДоговора",дог.КрДоговор.НомерПервичногоКредитногоДоговора);
				
			 
				 
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВкладкаСудСудебнаяСтадияСписокДел.НазваниеСуда КАК НазваниеСуда,
					|	ВкладкаСудСудебнаяСтадияСписокДел.АдресСудаВкладка КАК АдресСудаВкладка
					|ИЗ
					|	Справочник.ВкладкаСудСудебнаяСтадияСписокДел КАК ВкладкаСудСудебнаяСтадияСписокДел
					|ГДЕ
					|	ВкладкаСудСудебнаяСтадияСписокДел.Владелец.КредитныйДоговор = &КредитныйДоговор";
				
				Запрос.УстановитьПараметр("КредитныйДоговор", дог.КрДоговор);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
				
					  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					   данныеСтруктура.Вставить("НазваниеСуда",ВыборкаДетальныеЗаписи.НазваниеСуда);
		   
		               данныеСтруктура.Вставить("АдресСуда",ВыборкаДетальныеЗаписи.АдресСудаВкладка);
					
				     КонецЦикла;

				
				Иначе
				       данныеСтруктура.Вставить("НазваниеСуда","");
		   
		               данныеСтруктура.Вставить("АдресСуда","");

					
				
				КонецЕсли;
				
								
				
				
		       данныеСтруктура.Вставить("ДолжникФИО", дог.ФИОДолжника);
			   
			   данныеСтруктура.Вставить("ДатаРожденияДолжника", дог.ФИОДолжника.ДатаРождения);
			   
			   данныеСтруктура.Вставить("ПаспортныеДанныеДолжника", дог.ФИОДолжника.НомерПаспорта);
			   
			   
			   Если дог.ФИОДолжника.ПаспортКемВыдан<>"" Тогда
			   
			   	    данныеСтруктура.Вставить("ПаспортКемВыдан", дог.ФИОДолжника.ПаспортКемВыдан);
			   
			   Иначе
			   
			   	      данныеСтруктура.Вставить("ПаспортКемВыдан", "");
			   
			   КонецЕсли;
			   
			   
			   Если дог.ФИОДолжника.ПаспортКогдаВыдан<>Дата('00010101') Тогда
			   
			   	  данныеСтруктура.Вставить("ПаспортКогдаВыдан", дог.ФИОДолжника.ПаспортКогдаВыдан);
			   
			   Иначе
				   
				   данныеСтруктура.Вставить("ПаспортКогдаВыдан",Дата('00010101') );
			   	
			   
			   КонецЕсли;
				
				
			   
			   
			   
			   
			   
			    спрТипАдресовРегистрация=Справочники.ТипыАдресов.НайтиПоНаименованию("Регистрации"); 			
				
	 
	     		
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Адреса.Наименование КАК Наименование
					|ИЗ
					|	Справочник.Адреса КАК Адреса
					|ГДЕ
					|	Адреса.Владелец = &Владелец
					|	И Адреса.Тип = &Тип";
				
				Запрос.УстановитьПараметр("Владелец", дог.ФИОДолжника);
				Запрос.УстановитьПараметр("Тип", спрТипАдресовРегистрация);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
				        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
				    	 данныеСтруктура.Вставить("АдресРегистрацииДолжника",ВыборкаДетальныеЗаписи.Наименование);
			    	КонецЦикла;

				Иначе
					  данныеСтруктура.Вставить("АдресРегистрацииДолжника","не заполнено");
				
				КонецЕсли;
				

							   
			   
		   спрДопРеквизМестоРождения=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("Место рождения");
     
								
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ДополнительныеДанные.Наименование КАК Наименование
					|ИЗ
					|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
					|ГДЕ
					|	ДополнительныеДанные.Владелец = &Владелец
					|	И ДополнительныеДанные.Реквизит = &Реквизит";
				
				Запрос.УстановитьПараметр("Владелец", дог.ФИОДолжника);
				Запрос.УстановитьПараметр("Реквизит", спрДопРеквизМестоРождения);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
				        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
				    	данныеСтруктура.Вставить("МестоРожденияДолжника",ВыборкаДетальныеЗаписи.Наименование);
			    	КонецЦикла;

				Иначе
					 данныеСтруктура.Вставить("МестоРожденияДолжника","не заполнено");
				
				КонецЕсли;
		
				
			  данныеСтруктура.Вставить("НаименованиеПервоначальногоКредитора",дог.КрДоговор.Банк.ПолноеНазвание);
			  
		   	  данныеСтруктура.Вставить("НомерДоговораЦессии",дог.НомерДоговораЦессии);
			  
		      данныеСтруктура.Вставить("ДатаДоговораЦессии",дог.ДатаЦессии);
			  
		      данныеСтруктура.Вставить("НомерКредитногоДоговора",дог.КрДоговор.НомерДоговора);
		      данныеСтруктура.Вставить("ДатаКредитногоДоговора",дог.КрДоговор.ДатаФинансирования);
			  
			  данныеСтруктура.Вставить("Заявитель",Взыскатель);
			  
			  данныеСтруктура.Вставить("ТипДокумента",Перечисления.ТипДокумента.исх);
			  
			  ////данныеСтруктура.Вставить("СтадияДокумента",Перечисления.СтадияДокумента.СудебноеПроизводство);

			 
							  
							     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	СписокДелКредитногоДоговора.НомерДела КАК НомерДела,
						|	СписокДелКредитногоДоговора.ДатаДела КАК ДатаДела,
						|	СписокДелКредитногоДоговора.СтадияДела КАК СтадияДела,
						|	СписокДелКредитногоДоговора.НомерЦессии КАК НомерЦессии,
						|	СписокДелКредитногоДоговора.ДатаЦессии КАК ДатаЦессии
						|ИЗ
						|	Справочник.СписокДелКредитногоДоговора КАК СписокДелКредитногоДоговора
						|ГДЕ
						|	СписокДелКредитногоДоговора.Владелец = &Владелец
						|
						|УПОРЯДОЧИТЬ ПО
						|	ДатаДела УБЫВ";
					
					Запрос.УстановитьПараметр("Владелец", дог.КрДоговор);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					      Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						      данныеСтруктура.Вставить("НомерДела",ВыборкаДетальныеЗаписи.НомерДела);
                              данныеСтруктура.Вставить("ДатаДела",ВыборкаДетальныеЗаписи.ДатаДела);
							  
							  данныеСтруктура.Вставить("СтадияДокумента",ВыборкаДетальныеЗаписи.СтадияДела);
							  
							  данныеСтруктура.Вставить("НомерЦессииИзДела",ВыборкаДетальныеЗаписи.НомерЦессии);
                              данныеСтруктура.Вставить("ДатаЦессииИзДела",ВыборкаДетальныеЗаписи.ДатаЦессии);
							  
							  
							  
						
						  КонецЦикла;
					Иначе	  
                             данныеСтруктура.Вставить("НомерДела","");
                             данныеСтруктура.Вставить("ДатаДела",'00010101');
						     данныеСтруктура.Вставить("СтадияДокумента",Перечисления.СтадияДокумента.СудебноеПроизводство);
							 
							  данныеСтруктура.Вставить("НомерЦессииИзДела","");
                              данныеСтруктура.Вставить("ДатаЦессииИзДела",'00010101');
							 
							  
						
					
					КонецЕсли;
					
										
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

							  
					
					
       					
	
	  Возврат данныеСтруктура;
	

КонецФункции // ()





&НаКлиенте
Процедура  СоздатьДокументПр(наименованиеДок,дог)

	  Если наименованиеДок="ЗаявлениеОПроцессуальномПравопреемстве" Тогда
		  
		  
		  
		     данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве=ПолучитьДанныеДляДокументаЗаявлениеОПроцессуальномПравопреемстве(дог);
			 
			  элемСпр= СоздатьНовыйЭлементЗаявлениеОПроцессуальномПравопреемстве(данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве);

			 
						 
			  			 
			 // попробую сформировать файлы ...
			     
			 
			     файлСтр= СформироватьФайлЗаявлениеОПроцессуальномПравопреемстве(элемСпр,дог);
				 
				 
				 
			     
			     Если файлСтр.Количество()<>0 Тогда
			    	 
			    	  записатьВХранилищеЗаявлениеОПроцессуальномПравопреемстве(файлСтр,элемСпр);

			     
			     КонецЕсли;
			     
			    

			     файлВыписка=СформироватьФайлВыпискаИзРеестра(дог);
			     
			     
			     записатьВХранилищеВыпискаИзРеестра(файлВыписка,элемСпр);

			    		 
			     
			
			 
			 
			 
			 
			 
				  
		  
		  
	  
	  КонецЕсли;
	  
	   Если наименованиеДок="ЗаявлениеОВыдачеСудебногоПриказа" Тогда
		   
		       данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа=ПолучитьДанныеДляДокументаЗаявлениеОВыдачеСудебногоПриказа(дог);
		
			   элемСпр=СоздатьНовыйЭлементЗаявлениеОВыдачеСудебногоПриказа(данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа);
			   
			    // попробую сформировать файлы ...
			 
			    файлСтр= СформироватьФайлЗаявлениеОВыдачеСудебногоПриказа(элемСпр,дог);
				 
				 Если файлСтр.Количество()<>0 Тогда
					 
					    записатьВХранилищеЗаявлениеОВыдачеСудебногоПриказа(файлСтр,элемСпр);
			     
			     КонецЕсли;
 
				 
				  файлВыписка=СформироватьФайлВыпискаИзРеестра(дог);

				  записатьВХранилищеВыпискаИзРеестра(файлВыписка,элемСпр);
				 
				 

			   
			   
			   
			   
	  
	   КонецЕсли;
	  
	  
	
	   

КонецПроцедуры






&НаСервере
Процедура записатьВХранилищеЗаявлениеОВыдачеСудебногоПриказа(файлСтр,элемСпр)

	        имяД=Строка(элемСпр.Исполнитель)+"_ЗаявлениеОВыдачеСудебногоПриказа";
			
			адресВХранилище = ПоместитьВоВременноеХранилище(файлСтр.ДвоичныеДанные);
        
          ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(элемСпр.Ссылка,имяД,"docx",,,адресВХранилище);
		  
		  УдалитьФайлы(файлСтр.ИмяФайла);


	
	

КонецПроцедуры



  

&НаСервере
Функция ПолучитьДанныеДляДокументаЗаявлениеОВыдачеСудебногоПриказа(дог)

         	    данныеСтруктура=Новый Структура;
				 
				данныеСтруктура.Вставить("КредитныйДоговор",дог.КрДоговор);
				данныеСтруктура.Вставить("НомерКредитногоДоговора",дог.КрДоговор.НомерДоговора);
				данныеСтруктура.Вставить("ДатаФинансирования",дог.КрДоговор.ДатаФинансирования);
				
				
						  //БанкПервоначальногоКредитора
				
				данныеСтруктура.Вставить("ДолжникФИО",дог.ФИОДолжника);
				данныеСтруктура.Вставить("ДатаРожденияДолжника", дог.ФИОДолжника.ДатаРождения);

				
				  спрТипАдресовРегистрация=Справочники.ТипыАдресов.НайтиПоНаименованию("Регистрации"); 			
				
	 
	     		
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Адреса.Наименование КАК Наименование
					|ИЗ
					|	Справочник.Адреса КАК Адреса
					|ГДЕ
					|	Адреса.Владелец = &Владелец
					|	И Адреса.Тип = &Тип";
				
				Запрос.УстановитьПараметр("Владелец", дог.ФИОДолжника);
				Запрос.УстановитьПараметр("Тип", спрТипАдресовРегистрация);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
				        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
				    	 данныеСтруктура.Вставить("АдресРегистрацииДолжника",ВыборкаДетальныеЗаписи.Наименование);
			    	КонецЦикла;

				Иначе
					  данныеСтруктура.Вставить("АдресРегистрацииДолжника","не заполнено");
				
				КонецЕсли;
				

				
			   
			    данныеСтруктура.Вставить("ПаспортныеДанныеДолжника", дог.ФИОДолжника.НомерПаспорта);
				
				данныеСтруктура.Вставить("ПаспортныеДанныеДолжникаДатаВыдачи", дог.ФИОДолжника.ПаспортКогдаВыдан);
				
				данныеСтруктура.Вставить("ПаспортныеДанныеДолжникаКемВыдан", дог.ФИОДолжника.ПаспортКемВыдан);
				
				
				спрДопРеквизиты=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("Место рождения");
				
				
						//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						// Данный фрагмент построен конструктором.
						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ДополнительныеДанные.Наименование КАК Наименование
							|ИЗ
							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
							|ГДЕ
							|	ДополнительныеДанные.Владелец = &Владелец
							|	И ДополнительныеДанные.Реквизит = &Реквизит";
						
						Запрос.УстановитьПараметр("Владелец", дог.ФИОДолжника);
						Запрос.УстановитьПараметр("Реквизит", спрДопРеквизиты);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
							    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								// Вставить обработку выборки ВыборкаДетальныеЗаписи
							    	 данныеСтруктура.Вставить("МестоРожденияДолжника",ВыборкаДетальныеЗаписи.Наименование);
						    	КонецЦикла;

							Иначе
								  данныеСтруктура.Вставить("МестоРожденияДолжника","не заполнено");
							
						КонецЕсли;
							
						
						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

						
						
			 данныеСтруктура.Вставить("НаименованиеПервоначальногоКредитора",дог.КрДоговор.Банк.ПолноеНазвание);
             данныеСтруктура.Вставить("НомерДоговораЦессии",дог.НомерДоговораЦессии);
			 данныеСтруктура.Вставить("БанкПервоначальногоКредитора",дог.КрДоговор.БанкПервоначальныйКредитор.ПолноеНазвание);
			 
			 данныеСтруктура.Вставить("ПервоначальныйНомерКредитДоговора",дог.КрДоговор.НомерПервичногоКредитногоДоговора);
				
			 
			 

			   данныеСтруктура.Вставить("ДатаДоговораЦессии",дог.ДатаЦессии);
	   
			   	  данныеСтруктура.Вставить("ТипДокумента",Перечисления.ТипДокумента.исх);
			  
			 
							  
							     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	СписокДелКредитногоДоговора.НомерДела КАК НомерДела,
						|	СписокДелКредитногоДоговора.ДатаДела КАК ДатаДела,
						|	СписокДелКредитногоДоговора.СтадияДела КАК СтадияДела,
						|	СписокДелКредитногоДоговора.Ссылка КАК Ссылка,
						|	СписокДелКредитногоДоговора.НомерЦессии КАК НомерЦессии,
						|	СписокДелКредитногоДоговора.ДатаЦессии КАК ДатаЦессии
						|ИЗ
						|	Справочник.СписокДелКредитногоДоговора КАК СписокДелКредитногоДоговора
						|ГДЕ
						|	СписокДелКредитногоДоговора.Владелец = &Владелец
						|
						|УПОРЯДОЧИТЬ ПО
						|	ДатаДела УБЫВ";
					
					Запрос.УстановитьПараметр("Владелец", дог.КрДоговор);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					     списокДел=Истина;	
						
					      Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						      данныеСтруктура.Вставить("НомерДела",ВыборкаДетальныеЗаписи.НомерДела);
                              данныеСтруктура.Вставить("ДатаДела",ВыборкаДетальныеЗаписи.ДатаДела);
							   данныеСтруктура.Вставить("СсылкаДела",ВыборкаДетальныеЗаписи.Ссылка);
							  
							  данныеСтруктура.Вставить("НомерЦессииИзДела",ВыборкаДетальныеЗаписи.НомерЦессии);
                              данныеСтруктура.Вставить("ДатаЦессииИзДела",ВыборкаДетальныеЗаписи.ДатаЦессии);
							 
							  
							  данныеСтруктура.Вставить("СтадияДокумента",ВыборкаДетальныеЗаписи.СтадияДела);
							  
						
						  КонецЦикла;
					  Иначе	 
						  списокДел=Ложь;
                             данныеСтруктура.Вставить("НомерДела","");
                             данныеСтруктура.Вставить("ДатаДела",'00010101');
						      данныеСтруктура.Вставить("СтадияДокумента",Перечисления.СтадияДокумента.СудебноеПроизводство);
							  
							  данныеСтруктура.Вставить("НомерЦессииИзДела","");
                              данныеСтруктура.Вставить("ДатаЦессииИзДела",'00010101');
							 
						
					
					КонецЕсли;
					
					
					      Если списокДел Тогда
							  
									Запрос = Новый Запрос;
									Запрос.Текст = 
										"ВЫБРАТЬ
										|	ВкладкаСудСудебнаяСтадияСписокДел.НазваниеСуда КАК НазваниеСуда,
										|	ВкладкаСудСудебнаяСтадияСписокДел.АдресСудаВкладка КАК АдресСудаВкладка
										|ИЗ
										|	Справочник.ВкладкаСудСудебнаяСтадияСписокДел КАК ВкладкаСудСудебнаяСтадияСписокДел
										|ГДЕ
										|	ВкладкаСудСудебнаяСтадияСписокДел.Владелец = &Владелец";
									
									Запрос.УстановитьПараметр("Владелец", данныеСтруктура.СсылкаДела);
									
									РезультатЗапроса = Запрос.Выполнить();
									
									ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
									
									Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда

													
										Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
											
											   данныеСтруктура.Вставить("НазваниеСуда",ВыборкаДетальныеЗаписи.НазваниеСуда);
                                               данныеСтруктура.Вставить("АдресСудаВкладка",ВыборкаДетальныеЗаписи.АдресСудаВкладка);

											
											
										КонецЦикла;

										
									Иначе
										   данныеСтруктура.Вставить("НазваниеСуда","не заполнено");
                                           данныеСтруктура.Вставить("АдресСудаВкладка","не заполнено");

										
										
									КонецЕсли;
	
						  
						  КонецЕсли;
						  
						  
						 данныеСтруктура.Вставить("Исполнитель",ПользовательТк);
						 данныеСтруктура.Вставить("СуммаКредита",дог.КрДоговор.СуммаКредита);
						 
						 
						  стрДанных= ПолучитьДанныеДляВыпискиИзРеестраДляЗаявлениеОВыдачеСудебногоПриказа(дог.КрДоговор);

						  данныеСтруктура.Вставить("ОбщаяСуммаЗадолженностиПоДоговору", стрДанных.Итого);
						  
						  данныеСтруктура.Вставить("ГоспошлинаНаша", РассчитатьГоспошлину(стрДанных.Итого));
						  
						  данныеСтруктура.Вставить("ГоспошлинаКредитор", стрДанных.Госпошлина);
						  
						  данныеСтруктура.Вставить("Неустойка", стрДанных.ШтрафыИНеустойки);
						  
						  данныеСтруктура.Вставить("ПроцентыНаПроценты", стрДанных.СуммаПроцНаПросрочЗадолж);
						  
						  данныеСтруктура.Вставить("ПроцентНаОсновнойДолг", стрДанных.ТекущиеПроценты);
						  
						  
						  
						   Если   ЗначениеЗаполнено(Взыскатель) Тогда
							   
							   данныеСтруктура.Вставить("ЮридическийАдресЗаявителя", Взыскатель.ЮридическийАдрес);
							   
							   данныеСтруктура.Вставить("EmailЗаявителя", Взыскатель.ЭлектронныйАдрес);
							   
							   
							   данныеСтруктура.Вставить("Телефон", Взыскатель.Телефон);
							   
							   
							Иначе   
							   
								 данныеСтруктура.Вставить("ЮридическийАдресЗаявителя", "");
							   
							     данныеСтруктура.Вставить("EmailЗаявителя", "");
							   
							   
							    данныеСтруктура.Вставить("Телефон", "");
							   
								
	                 	   КонецЕсли;

			 				
				
				 Возврат данныеСтруктура;
				
	

КонецФункции // ()


&НаСервере
Функция РассчитатьГоспошлину(СуммаГосОбщая)

	 	
	ИтогРассчет=0;
	
	Если  СуммаГосОбщая<=20000 Тогда
		
		   ИтогРассчет=МАКС((СуммаГосОбщая/100)*4,400);
	
	КонецЕсли;
	
	
	Если  СуммаГосОбщая<=100000 И СуммаГосОбщая>20000 Тогда
		
		 ИтогРассчет=800+(СуммаГосОбщая-20000)/100*3;
	
	КонецЕсли;
	
	
	Если  СуммаГосОбщая>100000 И  СуммаГосОбщая<200000  Тогда
		
		ИтогРассчет=3200+(СуммаГосОбщая-100000)/100*2;
	
	КонецЕсли;
	
	
	Если  СуммаГосОбщая > 200000 И СуммаГосОбщая<1000000 Тогда
		
		 ИтогРассчет=5200+(СуммаГосОбщая-200000)/100;
	
	КонецЕсли;

	
	Если  СуммаГосОбщая>1000000 Тогда
		
		 ИтогРассчет=МИН(13200+(СуммаГосОбщая-1000000)/100*0,5,60000);
	
	КонецЕсли;

	      ИтогРассчет=ИтогРассчет/100*50;

	
    Возврат  ИтогРассчет;
	

КонецФункции // ()

  

			
			

Функция ПолучитьДанныеДляВыпискиИзРеестраДляЗаявлениеОВыдачеСудебногоПриказа(дог)

	     структДанных=Новый Структура;
	
	
	              //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг КАК ПросроченныйОсновнойДолг,
					|	ДанныеДоговоровСрезПоследних.ПросроченныеПроценты КАК ПросроченныеПроценты,
					|	ДанныеДоговоровСрезПоследних.ТекущиеПроценты КАК ТекущиеПроценты,
					|	ДанныеДоговоровСрезПоследних.Госпошлина КАК Госпошлина,
					|	ДанныеДоговоровСрезПоследних.Неустойка КАК Неустойка,
					|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность,
					|	ДанныеДоговоровСрезПоследних.Период КАК Период
					|ИЗ
					|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&МоментВремени, ) КАК ДанныеДоговоровСрезПоследних
					|ГДЕ
					|	ДанныеДоговоровСрезПоследних.Договор = &Договор
					|
					|УПОРЯДОЧИТЬ ПО
					|	Период УБЫВ";
				
				Запрос.УстановитьПараметр("Договор", дог);
				Запрос.УстановитьПараметр("МоментВремени", ТекущаяДата());
				
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоОсновнДолг",ВыборкаДетальныеЗаписи.ПросроченныйОсновнойДолг);
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоПроцентам",0);
					
					структДанных.Вставить("СуммаПросроченнойКомиссии",0);
					структДанных.Вставить("ШтрафыИНеустойки",ВыборкаДетальныеЗаписи.Неустойка);
					
					структДанных.Вставить("СуммаПроцНаПросрочЗадолж",ВыборкаДетальныеЗаписи.ПросроченныеПроценты);
					
					структДанных.Вставить("Госпошлина",ВыборкаДетальныеЗаписи.Госпошлина);
					
					структДанных.Вставить("Итого",ВыборкаДетальныеЗаписи.ВсегоЗадолженность);
					
					структДанных.Вставить("ТекущиеПроценты",ВыборкаДетальныеЗаписи.ТекущиеПроценты);
					
					
					
				КонецЦикла;
				
		
	
	
   Возврат 	структДанных;
  
				
КонецФункции // ()

			

  

&НаСервере
Процедура записатьВХранилищеВыпискаИзРеестра(файлВыписка,справСсылка)

          имяД=Строка(ПользовательТк)+"_ВыпискаИзРеестра";

	
	      адресВХранилище = ПоместитьВоВременноеХранилище(файлВыписка.ДвоичныеДанные);
        
          ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(справСсылка,имяД,"docx",,,адресВХранилище);
		  
		  УдалитьФайлы(файлВыписка.ИмяФайла);

	

КонецПроцедуры

  
  

&НаСервере
Функция ПолучитьДанныеДляВыпискиИзРеестра(дог)

	     структДанных=Новый Структура;
	
	
	              //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг КАК ПросроченныйОсновнойДолг,
					|	ДанныеДоговоровСрезПоследних.ПросроченныеПроценты КАК ПросроченныеПроценты,
					|	ДанныеДоговоровСрезПоследних.ТекущиеПроценты КАК ТекущиеПроценты,
					|	ДанныеДоговоровСрезПоследних.Госпошлина КАК Госпошлина,
					|	ДанныеДоговоровСрезПоследних.Неустойка КАК Неустойка,
					|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность
					|ИЗ
					|	РегистрСведений.ДанныеДоговоров.СрезПоследних КАК ДанныеДоговоровСрезПоследних
					|ГДЕ
					|	ДанныеДоговоровСрезПоследних.Договор = &Договор";
				
				Запрос.УстановитьПараметр("Договор", дог);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоОсновнДолг",ВыборкаДетальныеЗаписи.ПросроченныйОсновнойДолг);
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоПроцентам",0);
					
					структДанных.Вставить("СуммаПросроченнойКомиссии",0);
					структДанных.Вставить("ШтрафыИНеустойки",ВыборкаДетальныеЗаписи.Неустойка);
					
					структДанных.Вставить("СуммаПроцНаПросрочЗадолж",ВыборкаДетальныеЗаписи.ПросроченныеПроценты);
					
					структДанных.Вставить("Госпошлина",ВыборкаДетальныеЗаписи.Госпошлина);
					
					структДанных.Вставить("Итого",ВыборкаДетальныеЗаписи.ВсегоЗадолженность);
					
					
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорЦессии.НомерДоговора КАК НомерЦессии,
		|	ДоговорЦессии.ДатаЦессии КАК ДатаЦессии,
		|	Договоры.НомерДоговора КАК НомерДоговора,
		|	Договоры.Владелец КАК Владелец,
		|	Договоры.Владелец.ДатаРождения КАК ВладелецДатаРождения,
		|	Договоры.ДатаФинансирования КАК ДатаФинансирования
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорЦессии КАК ДоговорЦессии
		|		ПО (ДоговорЦессии.Владелец = Договоры.Ссылка)
		|ГДЕ
		|	Договоры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", дог);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		структДанных.Вставить("Цессия_заголовок",ВыборкаДетальныеЗаписи.НомерЦессии);
		структДанных.Вставить("ЦессияДата_заголовок",ВыборкаДетальныеЗаписи.ДатаЦессии);
		структДанных.Вставить("Дата_Рождения",ВыборкаДетальныеЗаписи.ВладелецДатаРождения);
		структДанных.Вставить("ФИО_Должник",ВыборкаДетальныеЗаписи.Владелец);
		структДанных.Вставить("НомерКредитногоДоговора",ВыборкаДетальныеЗаписи.НомерДоговора);
		структДанных.Вставить("Дата_ВыдачиКредитногоДоговора",ВыборкаДетальныеЗаписи.ДатаФинансирования);
		
		
		//структДанных.Вставить("Цессия_заголовок",ВыборкаДетальныеЗаписи.НомерЦессии);
		//структДанных.Вставить("Цессия_заголовок",ВыборкаДетальныеЗаписи.НомерЦессии);
		//
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	    	Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	СписокДелКредитногоДоговора.НомерДела КАК НомерДела,
						|	СписокДелКредитногоДоговора.ДатаДела КАК ДатаДела,
						|	СписокДелКредитногоДоговора.СтадияДела КАК СтадияДела,
						|	СписокДелКредитногоДоговора.НомерЦессии КАК НомерЦессии,
						|	СписокДелКредитногоДоговора.ДатаЦессии КАК ДатаЦессии
						|ИЗ
						|	Справочник.СписокДелКредитногоДоговора КАК СписокДелКредитногоДоговора
						|ГДЕ
						|	СписокДелКредитногоДоговора.Владелец = &Владелец
						|
						|УПОРЯДОЧИТЬ ПО
						|	ДатаДела УБЫВ";
					
					Запрос.УстановитьПараметр("Владелец", дог);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					      Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						      структДанных.Вставить("НомерДела",ВыборкаДетальныеЗаписи.НомерДела);
                              структДанных.Вставить("ДатаДела",ВыборкаДетальныеЗаписи.ДатаДела);
							  
							  структДанных.Вставить("СтадияДокумента",ВыборкаДетальныеЗаписи.СтадияДела);
							  
							  структДанных.Вставить("НомерЦессииИзДела",ВыборкаДетальныеЗаписи.НомерЦессии);
                              структДанных.Вставить("ДатаЦессииИзДела",ВыборкаДетальныеЗаписи.ДатаЦессии);
							  
							  
							  
						
						  КонецЦикла;
					Иначе	  
                             структДанных.Вставить("НомерДела","");
                             структДанных.Вставить("ДатаДела",'00010101');
						     структДанных.Вставить("СтадияДокумента",Перечисления.СтадияДокумента.СудебноеПроизводство);
							  структДанных.Вставить("НомерЦессииИзДела","");
                              структДанных.Вставить("ДатаЦессииИзДела",'00010101');
						
					
					КонецЕсли;

	
	
	
	

     структДанных.Вставить("Исполнитель",ПользовательТк);
				
	
	
	
   Возврат 	структДанных;
  
				
КонецФункции // ()

&НаСервере
Функция ПолучитьФайлВыпискаИзРеестраХран()
	
	 
	   НайтиШабл = Справочники.ШаблоныЮристы.НайтиПоНаименованию("ШаблонВыпискиИзРеестра",ИСТИНА);
	 
	     Двоичные=Неопределено;
		 
		 Если НайтиШабл<>Неопределено Тогда
		 
		 	 Если НЕ НайтиШабл.ПУСТАЯ() Тогда  
 
        		Хран=НайтиШабл.ФайлШаблона;
        		Двоичные=Хран.Получить(); 
    			
    		КонецЕсли;
			

		 
		 КонецЕсли; 
    	
			
	  Возврат Двоичные;		
	 

КонецФункции // ()


&НаКлиенте
Функция СформироватьФайлВыпискаИзРеестра(дог)
	
	      спрОбСтруктура=ПолучитьДанныеДляВыпискиИзРеестра(дог.КрДоговор);
		  
		  НомерЦессии="";
		  ДатаЦессии='00010101';
		  
		  Если спрОбСтруктура.Цессия_заголовок=null Тогда
		  
		   	    НомерЦессии=спрОбСтруктура.НомерЦессииИзДела;
		        ДатаЦессии=спрОбСтруктура.ДатаЦессииИзДела;
		  	
		  
		  Иначе
		  
		  	    НомерЦессии=спрОбСтруктура.Цессия_заголовок;
		        ДатаЦессии=спрОбСтруктура.ЦессияДата_заголовок;
		  
		  
		  КонецЕсли;
		  
		  
	
	      ДвоичныеДанные=ПолучитьФайлВыпискаИзРеестраХран();
			 
		  файлСтруктура=Новый Структура;
			 
		  Если ДвоичныеДанные<>Неопределено  Тогда
			  
			  MSWord = новый COMОбъект("Word.Application");
			  Попытка
			
				
				имяД=Строка(ПользовательТк)+"_ВыпискаИзРеестра";
				  
				 
				//Shell = Новый COMОбъект("WScript.Shell");
				//дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
				//
				
				//ИмяФайла=дирМоиД+"\"+имяД+".docx"; 	
				
				
				
							
				ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				
				ВыбранныйФайл = Новый Файл(ИмяФайла);
				Если ВыбранныйФайл.Существует() Тогда
					
					УдалитьФайлы(ВыбранныйФайл);
					
				
				КонецЕсли; 

				ДвоичныеДанные.Записать(ИмяФайла);

				
				 
					 //Передаем текущие параметры форм в MSWord
					 MSWord.Documents.Open(ИмяФайла);	
					 MSWordDoc = MSWord.ActiveDocument();

					 
					  MSWordDoc.Bookmarks("Цессия_заголовок").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(НомерЦессии));

					  
					   //ЦессияДата_заголовок
				    MSWordDoc.Bookmarks("ЦессияДата_заголовок").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датЦессия=ДатаЦессии;
				   дат= Формат(датЦессия, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				    //Дата_Рождения
				    MSWordDoc.Bookmarks("Дата_Рождения").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=спрОбСтруктура.Дата_Рождения;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //Цессия_Название
					  MSWordDoc.Bookmarks("Цессия_Название").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(НомерЦессии));

					  //ЦессияДата_Название
				         MSWordDoc.Bookmarks("ЦессияДата_Название").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датЦессия=ДатаЦессии;
					   дат= Формат(датЦессия, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);

					   
					 // ФИО_Должник
					   MSWordDoc.Bookmarks("ФИО_Должник").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ФИО_Должник));

					  //НомерКредитногоДоговора
					    MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.НомерКредитногоДоговора));

					   
					  //Дата_ВыдачиКредитногоДоговора
					       MSWordDoc.Bookmarks("Дата_ВыдачиКредитногоДоговора").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датЦессия=спрОбСтруктура.Дата_ВыдачиКредитногоДоговора;
					   дат= Формат(датЦессия, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);

					   
					   //ОстатокПросроченнойЗадПоОсновнДолг
					  MSWordDoc.Bookmarks("ОстатокПросроченнойЗадПоОсновнДолг").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ОстатокПросроченнойЗадПоОсновнДолг));

					  
					  //ОстатокПросроченнойЗадПоПроцентам
					  MSWordDoc.Bookmarks("ОстатокПросроченнойЗадПоПроцентам").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ОстатокПросроченнойЗадПоПроцентам));

					  
					  //СуммаПросроченнойКомиссии
					    MSWordDoc.Bookmarks("СуммаПросроченнойКомиссии").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.СуммаПросроченнойКомиссии));

					   //ШтрафыИНеустойки
					   MSWordDoc.Bookmarks("ШтрафыИНеустойки").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ШтрафыИНеустойки));

					  //СуммаПроцНаПросрочЗадолж
					    MSWordDoc.Bookmarks("СуммаПроцНаПросрочЗадолж").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.СуммаПроцНаПросрочЗадолж));

					  
					  //Госпошлина
					     MSWordDoc.Bookmarks("Госпошлина").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.Госпошлина));

					  //Итого
					        MSWordDoc.Bookmarks("Итого").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.Итого));

					  
						 //Дата_подвал
					 Если  MSWordDoc.Bookmarks.Exists("Дата_подвал")  Тогда	 
					   MSWordDoc.Bookmarks("Дата_подвал").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датЦессия=ТекущаяДата();
					   дат= Формат(датЦессия, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
                     КонецЕсли;
					   
					   //ФИОСотрудника
				     Если  MSWordDoc.Bookmarks.Exists("ФИОСотрудника")  Тогда
				      MSWordDoc.Bookmarks("ФИОСотрудника").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(ФИОИсполнителя));
					  
				    КонецЕсли;

					 

					   
					     MSWord.Visible=0;
						
						//MSWord.Activate();
						
					//ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".pdf";
					
					
				      имяД=Строка(ПользовательТк)+"_ВыпискаИзРеестра";

				 
				      ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				     	
				    	ВыбранныйФайл = Новый Файл(ИмяФайла);
				    	Если ВыбранныйФайл.Существует() Тогда
				    		
				    		УдалитьФайлы(ВыбранныйФайл);
				    		
				    	
				    	КонецЕсли; 

							

						
					MSWordDoc.SaveAs(ИмяФайла,16);
					
					MSWordDoc.Close(0);
						
					MSWord.Application.Quit();

					
					
					двФайл = Новый ДвоичныеДанные(ИмяФайла);
					
					файлСтруктура.Вставить("ДвоичныеДанные",двФайл);
					файлСтруктура.Вставить("ИмяФайла",ИмяФайла);
					
					
					ВыбранныйФайл = Новый Файл(ИмяФайла);
					Если ВыбранныйФайл.Существует() Тогда
						
						УдалитьФайлы(ВыбранныйФайл);
						
					
					КонецЕсли; 

					
					
									
				
				
			
			Исключение
				
				  MSWord.Application.Quit();
				   Сообщить("Ошибка-----  Выписки из реестра");
				   ТекстОшибки = ОписаниеОшибки();
				   Сообщить(ТекстОшибки);

				
			КонецПопытки;  
			  
			  
		  КонецЕсли;	  
		  
	 
	    Возврат файлСтруктура;
	

КонецФункции // ()




&НаСервере
Процедура записатьВХранилищеЗаявлениеОПроцессуальномПравопреемстве (стрФайл,элемСпр)

	      имяД=Строка(элемСпр.Исполнитель)+"_ЗаявлениеОПроцессуальномПравопреемстве";

	  
		  	    адресВХранилище = ПоместитьВоВременноеХранилище(стрФайл.ДвоичныеДанные);
        
                ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(элемСпр.Ссылка,имяД,"docx",,,адресВХранилище);
		  
		        УдалитьФайлы(стрФайл.ИмяФайла);

	
	    
	

КонецПроцедуры



&НаСервере
Функция ПолучитьФайлЗаявлениеОПроцессуальномПравопреемствеИзСправочника(ссылкаСпр)

	      Двоичные=Неопределено;

	       Хран=ссылкаСпр.ФайлШаблона;
        	Двоичные=Хран.Получить(); 

	       Возврат Двоичные;	
	
КонецФункции // ()

&НаСервере
Функция ПолучитьФайлЗаявлениеОПроцессуальномПравопреемствеИзХран()
	
	
	
	      Двоичные=Неопределено;

	
	   Если  Не ЗначениеЗаполнено(Шаблон) Тогда
	   
		   	    
			  
			   НайтиШабл = Справочники.ШаблоныЮристы.НайтиПоНаименованию("ШаблонЗаявлениеОПроцессуальномПравопреемстве",ИСТИНА);

			    
				 
				 Если НайтиШабл<>Неопределено Тогда
				 
				 	 Если НЕ НайтиШабл.ПУСТАЯ() Тогда  
		 
		        		Хран=НайтиШабл.ФайлШаблона;
		        		Двоичные=Хран.Получить(); 
		    			
		    		КонецЕсли;
					

			 
			 КонецЕсли; 

	   
	   Иначе
		   
		                об=Шаблон;
						
		    	   		Хран=об.ФайлШаблона;
		        		Двоичные=Хран.Получить(); 
		    			
		    			   
	   	
	   
	   КонецЕсли;  

	       	
			
	  Возврат Двоичные;		
	 

КонецФункции // ()

	   

&НаСервере
Функция Общназн(спр,стрРек)

	  Возврат  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(спр,стрРек)
	

КонецФункции // ()


&НаКлиенте
Функция СформироватьФайлЗаявлениеОВыдачеСудебногоПриказа(элемСпр,дог)
	
	
		    //  Очистит присоединенные файлы
			 массивСтруктур= ПолучитьПрисоединенныеФайлы(элемСпр);
			 
			 Для каждого стрФайл  Из массивСтруктур Цикл
				 
				  строкаПуть= ПолучитьПутьКФайлу(стрФайл);
				 Попытка
					 
					 
				  ВыбФайл = Новый Файл(строкаПуть);	 
				  Если ВыбФайл.Существует() Тогда 
				    Если ВыбФайл.ПолучитьТолькоЧтение() Тогда
				        ВыбФайл.УстановитьТолькоЧтение(Ложь);
				    КонецЕсли;
				    УдалитьФайлы(строкаПуть);                       
				 КонецЕсли;

				  УдалитьИзСправочникаФайл(стрФайл);
				  
				 
				 Исключение
					 
					 ТекстОшибки = ОписаниеОшибки();
					 Сообщить(ТекстОшибки);
					 
				 КонецПопытки;
			 
			 КонецЦикла;
			 
			 
			 
			  ДвоичныеДанные=ПолучитьФайлЗаявлениеОВыдачеСудебногоПриказаИзХран();
			 
			  файлСтруктура=Новый Структура;
			 
			 Если ДвоичныеДанные<>Неопределено  Тогда

				  MSWord = новый COMОбъект("Word.Application");

				 
				 Попытка
					 
					 	   	имяД=Строка(Общназн(элемСпр,"Исполнитель"))+"_ЗаявлениеОВыдачеСудебногоПриказа";
				  
							
							ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
							
							ВыбранныйФайл = Новый Файл(ИмяФайла);
							Если ВыбранныйФайл.Существует() Тогда
								
								УдалитьФайлы(ВыбранныйФайл);
								
							
							КонецЕсли; 

							ДвоичныеДанные.Записать(ИмяФайла);

							
							
							структураЗадолженностьСрезПоследних=ФункцииДляОтчетов.ВсегоЗадолженностьСрезПоследних(ТекущаяДата(),дог.КрДоговор);

							
							
														 //Передаем текущие параметры форм в MSWord
							 MSWord.Documents.Open(ИмяФайла);	
							 MSWordDoc = MSWord.ActiveDocument();

							 
							  Если  MSWordDoc.Bookmarks.Exists("НаименованиеСуда")  Тогда
								  MSWordDoc.Bookmarks("НаименованиеСуда").Select();
								  MSWordDoc.Application.Selection.Font.Color = 1;
				                  MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"НаименованиеСуда")));
							  КонецЕсли;

							  //АдресСуда
							   Если  MSWordDoc.Bookmarks.Exists("АдресСуда")  Тогда
								   MSWordDoc.Bookmarks("АдресСуда").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"АдресСуда"));
                               КонецЕсли;
							   
							   
							   
				 //СуммаПросрочкиПоОД
				  Если  MSWordDoc.Bookmarks.Exists("СуммаПросрочкиПоОД")  Тогда
					  MSWordDoc.Bookmarks("СуммаПросрочкиПоОД").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(структураЗадолженностьСрезПоследних.ПросроченныйОсновнойДолг));
				 КонецЕсли;	  

				 
				 //СуммаПросрочкиПроценты
                   Если  MSWordDoc.Bookmarks.Exists("СуммаПросрочкиПроценты")  Тогда
					  MSWordDoc.Bookmarks("СуммаПросрочкиПроценты").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(структураЗадолженностьСрезПоследних.ПросроченныеПроценты));
				   КонецЕсли;	  
				 
				 //СуммаПросрочкиКомиссий
				    Если  MSWordDoc.Bookmarks.Exists("СуммаПросрочкиКомиссий")  Тогда
				      MSWordDoc.Bookmarks("СуммаПросрочкиКомиссий").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(структураЗадолженностьСрезПоследних.Неустойка));
				   КонецЕсли;	  
				 
				   //СуммаПросрочкиКомиссийНа
				    Если  MSWordDoc.Bookmarks.Exists("СуммаПросрочкиКомиссийНа")  Тогда
				      MSWordDoc.Bookmarks("СуммаПросрочкиКомиссийНа").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(структураЗадолженностьСрезПоследних.Неустойка));
				   КонецЕсли;
				   
				   
				   //ФИОСотрудника
				     Если  MSWordDoc.Bookmarks.Exists("ФИОСотрудника")  Тогда
				      MSWordDoc.Bookmarks("ФИОСотрудника").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(ФИОИсполнителя);
				   КонецЕсли;
 
					 
				   //ВсегоЗадолженностьПоСостояню
				     Если  MSWordDoc.Bookmarks.Exists("ВсегоЗадолженностьПоСостояню")  Тогда
					     MSWordDoc.Bookmarks("ВсегоЗадолженностьПоСостояню").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ОбщаяСуммаЗадолженностиПоДоговору"));
				   КонецЕсли;	 		   
							   
							   
							   
							   
							   //ФИОДолжника 
							   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника")  Тогда
								   MSWordDoc.Bookmarks("ФИОДолжника").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника")));
							   КонецЕсли;
							   
							   //ДатаРожденияДолжника
							   Если  MSWordDoc.Bookmarks.Exists("ДатаРожденияДолжника")  Тогда
								    MSWordDoc.Bookmarks("ДатаРожденияДолжника").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
								   датРож=Общназн(элемСпр,"ДатаРожденияДолжника");
								   дат= Формат(датРож, "ДЛФ=ДД");
								   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   
							   //МестоРожденияДолжника
							   Если  MSWordDoc.Bookmarks.Exists("МестоРожденияДолжника")  Тогда
								   MSWordDoc.Bookmarks("МестоРожденияДолжника").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"МестоРожденияДолжника"));
							   КонецЕсли;
							   
							   //ПаспортНомер
							   Если  MSWordDoc.Bookmarks.Exists("ПаспортНомер")  Тогда
								   MSWordDoc.Bookmarks("ПаспортНомер").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ПаспортныеДанныеДолжника"));
							   КонецЕсли;
							   
							   //ПаспортКемВыдан
							   Если  MSWordDoc.Bookmarks.Exists("КемВыдан")  Тогда
								   MSWordDoc.Bookmarks("КемВыдан").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"КемВыданПаспорт"));
							   КонецЕсли;

										   
										   
							   //ПаспортДатаВыдачи
							   Если  MSWordDoc.Bookmarks.Exists("ПаспортДатаВыдачи")  Тогда
								   MSWordDoc.Bookmarks("ПаспортДатаВыдачи").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
								   датРож=Общназн(элемСпр,"ПаспортДатаВыдачи");
								   дат= Формат(датРож, "ДЛФ=ДД");
								   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   //АдресРегистрации
							   Если  MSWordDoc.Bookmarks.Exists("АдресРегистрации")  Тогда
								    MSWordDoc.Bookmarks("АдресРегистрации").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"АдресРегистрацииДолжника"));
							   КонецЕсли;
							   
							   
							   //СуммаЗадолженности
							   Если  MSWordDoc.Bookmarks.Exists("СуммаЗадолженности")  Тогда
							     MSWordDoc.Bookmarks("СуммаЗадолженности").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ОбщаяСуммаЗадолженностиПоДоговору"));
							   КонецЕсли;
							   
								//ГосПошлина
								Если  MSWordDoc.Bookmarks.Exists("ГосПошлина")  Тогда
								   MSWordDoc.Bookmarks("ГосПошлина").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ГоспошлинаНаша"));
							    КонецЕсли;
							   
							   //ПервоначальныйКредитор
							   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор")  Тогда

								    MSWordDoc.Bookmarks("ПервоначальныйКредитор").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
								   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
								   
							   КонецЕсли;
							   
							   //НомерКредитногоДоговора_выполнении0
							    Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_выполнении0")  Тогда
							        MSWordDoc.Bookmarks("НомерКредитногоДоговора_выполнении0").Select();
							        MSWordDoc.Application.Selection.Font.Color = 1;
							        MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ПервоначальныйНомерКредитДоговора")+" ");
			   
								КонецЕсли;

							   
							   
							   //НомерКредитногоДоговора0
							     Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора0")  Тогда
							        MSWordDoc.Bookmarks("НомерКредитногоДоговора0").Select();
							        MSWordDoc.Application.Selection.Font.Color = 1;
							        MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ПервоначальныйНомерКредитДоговора")+" ");
			   
								КонецЕсли;

								  //ПервоначальныйКредитор_изменены
							    Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_изменены")  Тогда
									   MSWordDoc.Bookmarks("ПервоначальныйКредитор_изменены").Select();
									   MSWordDoc.Application.Selection.Font.Color = 1;
									   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
							   КонецЕсли;

							   
							   //ДатаКредитногоДоговора_изменны
							    Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_изменны")  Тогда
								     MSWordDoc.Bookmarks("ДатаКредитногоДоговора_изменны").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
								   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
								   дат= Формат(датРож, "ДЛФ=ДД");
								   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   //НомерКредитногоДоговора_изменены
							     Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_изменены")  Тогда
							       MSWordDoc.Bookmarks("НомерКредитногоДоговора_изменены").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерКредитногоДоговора"));
							   КонецЕсли;


								
								//НомерКредитногоДоговора_Прошу0
								 Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Прошу0")  Тогда
							        MSWordDoc.Bookmarks("НомерКредитногоДоговора_Прошу0").Select();
							        MSWordDoc.Application.Selection.Font.Color = 1;
							        MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ПервоначальныйНомерКредитДоговора")+" ");
			   
								КонецЕсли;

							   
							   
							//ПервоначальныйКредитор0
							   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор0")  Тогда
							        MSWordDoc.Bookmarks("ПервоначальныйКредитор0").Select();
							        MSWordDoc.Application.Selection.Font.Color = 1;
							        MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"БанкПервоначальногоКредитора")+" ");
			   
								КонецЕсли;
								
								//ПервоначальныйКредитор_заключенной0
								Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_заключенной0")  Тогда
							        MSWordDoc.Bookmarks("ПервоначальныйКредитор_заключенной0").Select();
							        MSWordDoc.Application.Selection.Font.Color = 1;
							        MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"БанкПервоначальногоКредитора")+" ");
			   
								КонецЕсли;
								
								//ПервоначальныйКредитор_Прошу0
								 Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Прошу0")  Тогда
							        MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу0").Select();
							        MSWordDoc.Application.Selection.Font.Color = 1;
							        MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"БанкПервоначальногоКредитора")+" ");
			   
								КонецЕсли;

							   
							   
							   //ФИОДолжника_Между
							   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Между")  Тогда
								     MSWordDoc.Bookmarks("ФИОДолжника_Между").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника"))+" ");
							   КонецЕсли;
							   
							   
							   //НомерКредитногоДоговора
							   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора")  Тогда
							       MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
				                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерКредитногоДоговора"));
							   КонецЕсли;
							   
							   //ДатаКредитногоДоговора
							   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора")  Тогда
								     MSWordDoc.Bookmarks("ДатаКредитногоДоговора").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
								   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
								   дат= Формат(датРож, "ДЛФ=ДД");
								   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   
							   //ПервоначальныйКредитор_заключенной
							   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_заключенной")  Тогда
									   MSWordDoc.Bookmarks("ПервоначальныйКредитор_заключенной").Select();
									   MSWordDoc.Application.Selection.Font.Color = 1;
									   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
							   КонецЕсли;
							   
							 								   
							   
							   
							   //СуммаКредита
							   Если  MSWordDoc.Bookmarks.Exists("СуммаКредита")  Тогда
							         MSWordDoc.Bookmarks("СуммаКредита").Select();
									   MSWordDoc.Application.Selection.Font.Color = 1;
									   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"СуммаКредита"));
							   КонецЕсли;
							   
							   
							   //ДатаЦессии
							   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии")  Тогда
							        MSWordDoc.Bookmarks("ДатаЦессии").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   датРож=Общназн(элемСпр,"ДатаДоговораЦессии");
							   дат= Формат(датРож, "ДЛФ=ДД");
							   длина=СтрДлина(дат);
							   дат=Лев(дат,длина-2);
							   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;
							   
							   //ПервоначальныйКредитор_ДатаЦессии
							   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_ДатаЦессии")  Тогда
							         MSWordDoc.Bookmarks("ПервоначальныйКредитор_ДатаЦессии").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
							   КонецЕсли;
							   
							   //НомерЦессии
							   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии")  Тогда
							      MSWordDoc.Bookmarks("НомерЦессии").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерДоговораЦессии")+" ");
							   КонецЕсли;
							   
							   
							   //ДатаЦессии_БылЗаключен
							   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_БылЗаключен")  Тогда
							       MSWordDoc.Bookmarks("ДатаЦессии_БылЗаключен").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   датРож=Общназн(элемСпр,"ДатаДоговораЦессии");
							   дат= Формат(датРож, "ДЛФ=ДД");
							   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   
							   //НомерКредитногоДоговора_кредитномудого
							   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_кредитномудого")  Тогда
							         MSWordDoc.Bookmarks("НомерКредитногоДоговора_кредитномудого").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерКредитногоДоговора"));
							   КонецЕсли;
							   
							   
							   //НомерКредитногоДоговора_кредитномудого0
							     Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_кредитномудого0")  Тогда
							         MSWordDoc.Bookmarks("НомерКредитногоДоговора_кредитномудого0").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ПервоначальныйНомерКредитДоговора"));
							   КонецЕсли;

							   
							   
							   
							   
							   //ДатаКредитногоДоговора_кредитномудог
							   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_кредитномудог")  Тогда
							       MSWordDoc.Bookmarks("ДатаКредитногоДоговора_кредитномудог").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
							   дат= Формат(датРож, "ДЛФ=ДД");
							   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   
							   //ПервоначальныйКредитор_заключенного_межд
							    Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_заключенного_межд")  Тогда 
							        MSWordDoc.Bookmarks("ПервоначальныйКредитор_заключенного_межд").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
								   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
							   
							    КонецЕсли;

								//ПервоКредитор_заключенного_межд0
								  Если  MSWordDoc.Bookmarks.Exists("ПервоКредитор_заключенного_межд0")  Тогда 
							        MSWordDoc.Bookmarks("ПервоКредитор_заключенного_межд0").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
								   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"БанкПервоначальногоКредитора")+" ");
							   
							    КонецЕсли;

								
								
								
							   
							   //ФИОДолжника_заключенного_между
							   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_заключенного_между")  Тогда
							      MSWordDoc.Bookmarks("ФИОДолжника_заключенного_между").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника"))+" ");
							   КонецЕсли;
							  

							   //ДатаЦессии_уступаемых
							   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_уступаемых")  Тогда
							         MSWordDoc.Bookmarks("ДатаЦессии_уступаемых").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   датРож=Общназн(элемСпр,"ДатаДоговораЦессии");
							   дат= Формат(датРож, "ДЛФ=ДД");
							   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

								//ОбщаяСуммаЗадолженностиПоЦессии
								Если  MSWordDoc.Bookmarks.Exists("ОбщаяСуммаЗадолженностиПоЦессии")  Тогда
						       MSWordDoc.Bookmarks("ОбщаяСуммаЗадолженностиПоЦессии").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ОбщаяСуммаЗадолженностиПоДоговору"));
							   КонецЕсли;
							   
							   
							   //ОбщаяСуммаЗадолженностиПоЦессии_составля
							   Если  MSWordDoc.Bookmarks.Exists("ОбщаяСуммаЗадолженностиПоЦессии_составля")  Тогда
							    MSWordDoc.Bookmarks("ОбщаяСуммаЗадолженностиПоЦессии_составля").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ОбщаяСуммаЗадолженностиПоДоговору"));
							   КонецЕсли;
							   
							   
							   
							   //НомерКредитногоДоговора_выполнении
							   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_выполнении")  Тогда
							   MSWordDoc.Bookmarks("НомерКредитногоДоговора_выполнении").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерКредитногоДоговора"));
							   КонецЕсли;
							   
							   
							   
							   
							   
							   //ДатаКредитногоДоговора_выполнении
							   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_выполнении")  Тогда
							         MSWordDoc.Bookmarks("ДатаКредитногоДоговора_выполнении").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
							   дат= Формат(датРож, "ДЛФ=ДД");
							   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   
							   //ФИОДолжника_Прошу_выдать
							   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Прошу_выдать")  Тогда
							         MSWordDoc.Bookmarks("ФИОДолжника_Прошу_выдать").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника"))+" ");
							   КонецЕсли;
							  
							   
								//ОбщаяСуммаЗадолженностиПоЦессии_Прошу
								Если  MSWordDoc.Bookmarks.Exists("ОбщаяСуммаЗадолженностиПоЦессии_Прошу")  Тогда
								  MSWordDoc.Bookmarks("ОбщаяСуммаЗадолженностиПоЦессии_Прошу").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ОбщаяСуммаЗадолженностиПоДоговору"));
							   КонецЕсли;
							  
							   //НомерКредитногоДоговора_Прошу
							   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Прошу")  Тогда
							    MSWordDoc.Bookmarks("НомерКредитногоДоговора_Прошу").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерКредитногоДоговора"));
							   КонецЕсли;
							 
							   
							   //ДатаКредитногоДоговора_Прошу
							   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_Прошу")  Тогда
							          MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Прошу").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
							   дат= Формат(датРож, "ДЛФ=ДД");
							   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   
							   //ПервоначальныйКредитор_Прошу
							    Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Прошу")  Тогда
								   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
								   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
								   
							   КонецЕсли;
							   
							   //ФИОДолжника_Прошу_Взыскать
							   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Прошу_Взыскать")  Тогда
							   MSWordDoc.Bookmarks("ФИОДолжника_Прошу_Взыскать").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника"))+" ");
							   КонецЕсли;
							   
							   
							   //СуммаГоспошлины_Прошу
							   Если  MSWordDoc.Bookmarks.Exists("СуммаГоспошлины_Прошу")  Тогда
							      MSWordDoc.Bookmarks("СуммаГоспошлины_Прошу").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ГоспошлинаНаша"));
							   КонецЕсли;
							 
							   
							   //НомерКредитногоДоговора_Приложение
							   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Приложение")  Тогда
							      MSWordDoc.Bookmarks("НомерКредитногоДоговора_Приложение").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ПервоначальныйНомерКредитДоговора"));
							   КонецЕсли;
							   
							   //НомерКредитногоДоговора_ПриложениеНеп
							   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_ПриложениеНеп")  Тогда
							      MSWordDoc.Bookmarks("НомерКредитногоДоговора_ПриложениеНеп").Select();
							      MSWordDoc.Application.Selection.Font.Color = 1;
			                     MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерКредитногоДоговора"));
							   КонецЕсли;
							   
							   
							   
							   //ДатаКредитногоДоговора_Приложение
							   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_Приложение")  Тогда
							   MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Приложение").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
							   дат= Формат(датРож, "ДЛФ=ДД");
							   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;


							   //НомерЦессии_Приложение
							   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии_Приложение")  Тогда
							          MSWordDoc.Bookmarks("НомерЦессии_Приложение").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерДоговораЦессии")+" ");
							   КонецЕсли;
							   
							   //ДатаЦессии_Приложение
							   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Приложение")  Тогда
							          MSWordDoc.Bookmarks("ДатаЦессии_Приложение").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   датРож=Общназн(элемСпр,"ДатаДоговораЦессии");
							   дат= Формат(датРож, "ДЛФ=ДД");
							   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   
							   //ДатаЦессии_Приложение_5
							   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Приложение_5")  Тогда
							    MSWordDoc.Bookmarks("ДатаЦессии_Приложение_5").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   датРож=Общназн(элемСпр,"ДатаДоговораЦессии");
							   дат= Формат(датРож, "ДЛФ=ДД");
							   MSWordDoc.Application.Selection.TypeText(дат);
							   КонецЕсли;

							   
								//ДатаЗаявления
							   //          MSWordDoc.Bookmarks("ДатаЗаявления").Select();
							   //MSWordDoc.Application.Selection.Font.Color = 1;
							   //датРож=ТекущаяДата();
							   //дат= Формат(датРож, "ДЛФ=ДД");
							   //MSWordDoc.Application.Selection.TypeText(дат);


							     MSWord.Visible=0;
									
									//MSWord.Activate();
									
								//ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".pdf";
								
								
							      имяД=Строка(Общназн(элемСпр,"Исполнитель"))+"_ЗаявлениеОВыдачеСудебногоПриказа";

							 
							      ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
							     	
							    	ВыбранныйФайл = Новый Файл(ИмяФайла);
							    	Если ВыбранныйФайл.Существует() Тогда
							    		
							    		УдалитьФайлы(ВыбранныйФайл);
							    		
							    	
							    	КонецЕсли; 

										

									
								MSWordDoc.SaveAs(ИмяФайла,16);
								
							    MSWordDoc.Close(0);
									
								MSWord.Application.Quit();

								
								двФайл = Новый ДвоичныеДанные(ИмяФайла);
								
								файлСтруктура.Вставить("ДвоичныеДанные",двФайл);
								файлСтруктура.Вставить("ИмяФайла",ИмяФайла);
								
								
								ВыбранныйФайл = Новый Файл(ИмяФайла);
								Если ВыбранныйФайл.Существует() Тогда
									
									УдалитьФайлы(ВыбранныйФайл);
									
								
								КонецЕсли; 

								
				 	

							
							
							
				 
				 Исключение
					 
					    MSWord.Application.Quit();
					 	Сообщить("Ошибка----- Заявление О Выдаче Судебного Приказа");
				        ТекстОшибки = ОписаниеОшибки();
				        Сообщить(ТекстОшибки);
					 
				 КонецПопытки;
				 
				 
				 
				 
			 КонецЕсли;
				 
			 
			 
			 
     Возврат файлСтруктура; 	 

	
	
КонецФункции // ()


&НаСервере
Функция ПолучитьФайлЗаявлениеОВыдачеСудебногоПриказаИзХран()
	
	 
	 Двоичные=Неопределено;

	
	   Если  Не ЗначениеЗаполнено(Шаблон) Тогда
	   
		   	    
			   НайтиШабл = Справочники.ШаблоныЮристы.НайтиПоНаименованию("ШаблонЗаявлениеОВыдачеСудебногоПриказа",ИСТИНА);
			 
			    
				 
				 Если НайтиШабл<>Неопределено Тогда
				 
				 	 Если НЕ НайтиШабл.ПУСТАЯ() Тогда  
		 
		        		Хран=НайтиШабл.ФайлШаблона;
		        		Двоичные=Хран.Получить(); 
		    			
		    		КонецЕсли;
					

			 
			 КонецЕсли; 

	   
	   Иначе
		   
		                об=Шаблон;
						
		    	   		Хран=об.ФайлШаблона;
		        		Двоичные=Хран.Получить(); 
		    			
		    			   
	   	
	   
	   КонецЕсли;  
	
    	
			
	  Возврат Двоичные;		
	 

КонецФункции // ()




&НаСервере
Функция ПолучитьПрисоединенныеФайлы(владелецФайлов)

		//структураФайлы=Новый Структура;

		массивСтруктур=Новый Массив;
		
	
	         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОФайлах.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СведенияОФайлах КАК СведенияОФайлах
		|ГДЕ
		|	СведенияОФайлах.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", владелецФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи

		//структураФайлы.Вставить("Файл", ВыборкаДетальныеЗаписи.Файл);
		массивСтруктур.Добавить(ВыборкаДетальныеЗаписи.Файл);

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	 //ВыборкаДетальныеЗаписи.Файл.ПутьКФайлу
	
	
	 Возврат массивСтруктур;

КонецФункции // ()


&НаСервере
Функция ПолучитьПутьКФайлу(ссылкаНаФайл)

	        об=ссылкаНаФайл.ПолучитьОбъект();
			
			   
			Возврат  об.Том.ПолныйПутьWindows+ об.ПутьКФайлу;

КонецФункции // ()


&НаСервере
Процедура УдалитьИзСправочникаФайл(ссылкаНаФайл)

	        об=ссылкаНаФайл.ПолучитьОбъект();
			
			
			об.Удалить();
			   
			

КонецПроцедуры	



&НаСервере
Функция АдресБанка(дог)

	адресБ="";
	
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Договоры.Банк.Адрес КАК БанкАдрес
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|ГДЕ
				|	Договоры.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", дог.КрДоговор.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				адресБ=ВыборкаДетальныеЗаписи.БанкАдрес;
				
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	
	 Возврат  адресБ;
	

КонецФункции // ()



&НаКлиенте
Функция СформироватьФайлЗаявлениеОПроцессуальномПравопреемстве(элемСпр,дог)
	
	
	
	   
	
	   //естьШаблон=Ложь;
	   
	   
			  
				    //  Очистит присоединенные файлы
				 массивСтруктур= ПолучитьПрисоединенныеФайлы(элемСпр);
				 
				 Для каждого стрФайл  Из массивСтруктур Цикл
					 
					  строкаПуть= ПолучитьПутьКФайлу(стрФайл);
					 Попытка
						 
						 
					  ВыбФайл = Новый Файл(строкаПуть);	 
					  Если ВыбФайл.Существует() Тогда 
					    Если ВыбФайл.ПолучитьТолькоЧтение() Тогда
					        ВыбФайл.УстановитьТолькоЧтение(Ложь);
					    КонецЕсли;
					    УдалитьФайлы(строкаПуть);                       
					 КонецЕсли;
									 
					

					  УдалитьИзСправочникаФайл(стрФайл);
					  
					 
					 Исключение
						 
						 ТекстОшибки = ОписаниеОшибки();
						 Сообщить(ТекстОшибки);
						 
					 КонецПопытки;
					 
							 	
				 
				 КонецЦикла;
				 

		  
		  
	         ДвоичныеДанные=ПолучитьФайлЗаявлениеОПроцессуальномПравопреемствеИзХран();
			 
			 файлСтруктура=Новый Структура;
			 
			 

	    Если ДвоичныеДанные<>Неопределено  Тогда
			
			MSWord = новый COMОбъект("Word.Application");
			
			Попытка
			
				
				имяД=Строка(Общназн(элемСпр,"Исполнитель"))+"_ЗаявлениеОПроцессуальномПравопреемстве";
				  
				 
				//Shell = Новый COMОбъект("WScript.Shell");
				//дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
				//
				
				//ИмяФайла=дирМоиД+"\"+имяД+".docx"; 	
				
				
				
							
				ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				
				ВыбранныйФайл = Новый Файл(ИмяФайла);
				Если ВыбранныйФайл.Существует() Тогда
					
					УдалитьФайлы(ВыбранныйФайл);
					
				
				КонецЕсли; 

				ДвоичныеДанные.Записать(ИмяФайла);
				
				 
				 //Передаем текущие параметры форм в MSWord
				 MSWord.Documents.Open(ИмяФайла);	
				 MSWordDoc = MSWord.ActiveDocument();

				 
				Если  MSWordDoc.Bookmarks.Exists("НаименованиеСуда")  Тогда 
				   MSWordDoc.Bookmarks("НаименованиеСуда").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"НаименованиеСуда")));
				КонецЕсли;
				   
				   //АдресСуда
				Если  MSWordDoc.Bookmarks.Exists("АдресСуда")  Тогда   
				   MSWordDoc.Bookmarks("АдресСуда").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"АдресСуда"));
			    КонецЕсли;
			   
				   //ФИОДолжника
				 Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника")  Тогда  
				   MSWordDoc.Bookmarks("ФИОДолжника").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника")));
				 КонецЕсли;  
				   
					//ДолжникаДатаРождения
				Если  MSWordDoc.Bookmarks.Exists("ДолжникаДатаРождения")  Тогда	
	  		       MSWordDoc.Bookmarks("ДолжникаДатаРождения").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаРожденияДолжника");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				КонецЕсли;   
				   
					//ДолжникАдрес
				Если  MSWordDoc.Bookmarks.Exists("ДолжникАдрес")  Тогда	
				   MSWordDoc.Bookmarks("ДолжникАдрес").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"АдресРегистрацииДолжника"));
				КонецЕсли; 
				
				
				
				
				
					 //////////////
					 
					 //МестоРожденияДолжника
					Если  MSWordDoc.Bookmarks.Exists("МестоРожденияДолжника")  Тогда
					   MSWordDoc.Bookmarks("МестоРожденияДолжника").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"МестоРожденияДолжника"));
					КонецЕсли;  
					 
					
					//ПаспортНомер
					Если  MSWordDoc.Bookmarks.Exists("ПаспортНомер")  Тогда
					   MSWordDoc.Bookmarks("ПаспортНомер").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"ПаспортныеДанныеДолжника"));
					КонецЕсли;  

					// ПаспортДатаВыдачи
					Если  MSWordDoc.Bookmarks.Exists("ПаспортДатаВыдачи")  Тогда
		  		       MSWordDoc.Bookmarks("ПаспортДатаВыдачи").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Общназн(элемСпр,"ПаспортДатаВыдачи");
					   
					   
					   Если датРож<>Дата('00010101') Тогда
					   
					   	     дат= Формат(датРож, "ДЛФ=ДД");
					   
					   Иначе
					   
					   	     дат= "        ";
					   
					   КонецЕсли;
					   
					   
					    						   
						    MSWordDoc.Application.Selection.TypeText(дат);

						   
						   
						
			   
					 КонецЕсли;  
					
					 
					 // КемВыдан
					 Если  MSWordDoc.Bookmarks.Exists("КемВыдан")  Тогда
					   MSWordDoc.Bookmarks("КемВыдан").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   
					   Если Общназн(элемСпр,"КемВыданПаспорт")<>"" Тогда
					         MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"КемВыданПаспорт"));

					   	
					   
					   Иначе
					         MSWordDoc.Application.Selection.TypeText("     ");

					   	
					   
					   КонецЕсли;
					   
					   
	                   					   
					КонецЕсли;  

					// ПервоначальныйКредиторЗаголовок
					 Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредиторЗаголовок")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредиторЗаголовок").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
					КонецЕсли;   

					
					// ПервоначальныйКредиторАдресЗагол
					 Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредиторАдресЗагол")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредиторАдресЗагол").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(АдресБанка(дог)+" ");
					КонецЕсли;   

					
					// НомерДелаЗаголовок
					  Если  MSWordDoc.Bookmarks.Exists("НомерДелаЗаголовок")  Тогда
					   MSWordDoc.Bookmarks("НомерДелаЗаголовок").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерСудебногоДела")+" ");
					КонецЕсли;   

					//НаименованиеСудаВынес
					  Если  MSWordDoc.Bookmarks.Exists("НаименованиеСудаВынес")  Тогда
					   MSWordDoc.Bookmarks("НаименованиеСудаВынес").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"НаименованиеСуда")));
				     КонецЕсли;

					
					 // НомерДелаВынес
					  Если  MSWordDoc.Bookmarks.Exists("НомерДелаВынес")  Тогда
					   MSWordDoc.Bookmarks("НомерДелаВынес").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерСудебногоДела"));
				     КонецЕсли;

					 
					 // ДатаДелаВынес
					 Если  MSWordDoc.Bookmarks.Exists("ДатаДелаВынес")  Тогда
		  		       MSWordDoc.Bookmarks("ДатаДелаВынес").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Общназн(элемСпр,"ДатаСудебногоДела");
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
					 КонецЕсли;  
					

					 //ПервоначальныйКредиторУдовлетвор
					  Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредиторУдовлетвор")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредиторУдовлетвор").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
					КонецЕсли; 
					 
					 
					// ФИОДОЛЖНИКУдовлет
					Если  MSWordDoc.Bookmarks.Exists("ФИОДОЛЖНИКУдовлет")  Тогда
					   MSWordDoc.Bookmarks("ФИОДОЛЖНИКУдовлет").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника")));
					КонецЕсли;
									 
					   
					   // ФИОСотрудника
					  Если  MSWordDoc.Bookmarks.Exists("ФИОСотрудника")  Тогда
					   MSWordDoc.Bookmarks("ФИОСотрудника").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
                       MSWordDoc.Application.Selection.TypeText(ФИОИсполнителя);
				     КонецЕсли;

					   
					   
					 
					
					////////
					 

					
					
		////////////
					
		           			
					//ПервоначальныйНомерКредитногоДоговора
					Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйНомерКредитногоДоговора")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйНомерКредитногоДоговора").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ПервоначальныйНомерКредитДоговора")));
					КонецЕсли;   
					
					//Номер0КредитногоДоговора_Прошу
					 Если  MSWordDoc.Bookmarks.Exists("Номер0КредитногоДоговора_Прошу")  Тогда
					   MSWordDoc.Bookmarks("Номер0КредитногоДоговора_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ПервоначальныйНомерКредитДоговора")));
					КонецЕсли;   

					
					
					
					
					//ПервоначальныйКредитор_былиизм
					
				    Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_былиизм")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредитор_былиизм").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора"))+" ");
					КонецЕсли;   

					
					//НомерКредитногоДоговора_былизм
					Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_былизм")  Тогда
					   MSWordDoc.Bookmarks("НомерКредитногоДоговора_былизм").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"НомерКредитногоДоговора")));
					КонецЕсли;   
					
			            		
					//ДатаКредитногоДоговора_былиз
					Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_былиз")  Тогда
					   MSWordDoc.Bookmarks("ДатаКредитногоДоговора_былиз").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				    КонецЕсли;

					
				
		
		
		
		
	  ////////////////
				
				
				
				
				
				
					//СудПоле
				Если  MSWordDoc.Bookmarks.Exists("СудПоле")  Тогда	
				   MSWordDoc.Bookmarks("СудПоле").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"НаименованиеСуда"))+" ");
				КонецЕсли;   
				   
				  // НомерДелаВСуде
				  Если  MSWordDoc.Bookmarks.Exists("НомерДелаВСуде")  Тогда
				   MSWordDoc.Bookmarks("НомерДелаВСуде").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерСудебногоДела"));
			      КонецЕсли;
			   
				   //ПервоначальныйКредитор
				  Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор")  Тогда 
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
			     КонецЕсли;
			   
				   
				   //ФИОДолжникПоле
				  Если  MSWordDoc.Bookmarks.Exists("ФИОДолжникПоле")  Тогда 
				   MSWordDoc.Bookmarks("ФИОДолжникПоле").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника")));
			     КонецЕсли;
			   
				   //НомерКредитногоДоговора
				  Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора")  Тогда 
				   MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерКредитногоДоговора"));
				  КонецЕсли; 
				   
				   //ДатаКредитногоДоговора
				  Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора")  Тогда 
				   MSWordDoc.Bookmarks("ДатаКредитногоДоговора").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				  КонецЕсли; 
					
				   //ПервоначальныйКредитор_Между
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Между")  Тогда
				    MSWordDoc.Bookmarks("ПервоначальныйКредитор_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора"))+" ");
                   КонецЕсли;
				   
				   
				   //НомерЦессии
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии")  Тогда
				   MSWordDoc.Bookmarks("НомерЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерДоговораЦессии")+" ");
				   КонецЕсли;
				   

				   //ДатаЦессии
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии")  Тогда
				    MSWordDoc.Bookmarks("ДатаЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаДоговораЦессии");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;
				   
				   
					//НомерКредитногоДоговора_Между
					Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Между")  Тогда
				   MSWordDoc.Bookmarks("НомерКредитногоДоговора_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерКредитногоДоговора"));
				   КонецЕсли;
				   
				   //ДатаКредитногоДоговора_Между
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_Между")  Тогда
				    MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;
				   
				   
				   //ПервоначальныйКредитор_М_между
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_М_между")  Тогда
				     MSWordDoc.Bookmarks("ПервоначальныйКредитор_М_между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
                   КонецЕсли;  
				    
				   
				   //ФИОДолжника_Между
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Между")  Тогда
				     MSWordDoc.Bookmarks("ФИОДолжника_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника")));
				   КонецЕсли;

				   
				   //НомерЦессии_Переход
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии_Переход")  Тогда
				    MSWordDoc.Bookmarks("НомерЦессии_Переход").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерДоговораЦессии")+" ");
				   КонецЕсли;

				   //ДатаЦессии_Переход
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Переход")  Тогда
				     MSWordDoc.Bookmarks("ДатаЦессии_Переход").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаДоговораЦессии");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;
				
				   
				   //ПервоначальныйКредитор_Также
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Также")  Тогда
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Также").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
				   КонецЕсли;

				   //НомерДелаВСуде_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("НомерДелаВСуде_Прошу")  Тогда
				   MSWordDoc.Bookmarks("НомерДелаВСуде_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерСудебногоДела"));
				   КонецЕсли;
				   
				   //ДатаДелаВСуде
				   Если  MSWordDoc.Bookmarks.Exists("ДатаДелаВСуде")  Тогда
				   MSWordDoc.Bookmarks("ДатаДелаВСуде").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаСудебногоДела");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;
				   
				   
				   
				    //ДатаДелаВСуде_1
					Если  MSWordDoc.Bookmarks.Exists("ДатаДелаВСуде_1")  Тогда
					 MSWordDoc.Bookmarks("ДатаДелаВСуде_1").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаСудебногоДела");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;
				   
				  
				    


				   //ПервоначальныйКредитор_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Прошу")  Тогда
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
				   КонецЕсли;

				   
				   //ФИОДолжника_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Прошу")  Тогда
				   MSWordDoc.Bookmarks("ФИОДолжника_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Общназн(элемСпр,"ФИОДолжника")));
				   КонецЕсли;

				   
				   //НомерКредитногоДоговора_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Прошу")  Тогда
				     MSWordDoc.Bookmarks("НомерКредитногоДоговора_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерКредитногоДоговора"));
				   КонецЕсли;
				 
				   //ДатаКредитногоДоговора_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_Прошу")  Тогда
				      MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаКредитногоДоговора");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
				   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;
				  
				   
				   //ПервоначальныйКредитор_Прошу_2
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Прошу_2")  Тогда
				    MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу_2").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НаименованиеПервоначальногоКредитора")+" ");
				   КонецЕсли;

				   
				   
				   //НомерЦессии_Приложение
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии_Приложение")  Тогда
				   MSWordDoc.Bookmarks("НомерЦессии_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерДоговораЦессии")+" ");
				   КонецЕсли;

				   
				   //ДатаЦессии_Приложение
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Приложение")  Тогда
				        MSWordDoc.Bookmarks("ДатаЦессии_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаДоговораЦессии");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
                   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;
				

				   //НомерЦессии_Приложение_Выписка
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии_Приложение_Выписка")  Тогда
				     MSWordDoc.Bookmarks("НомерЦессии_Приложение_Выписка").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Общназн(элемСпр,"НомерДоговораЦессии")+" ");
				   КонецЕсли;

				   
				   //ДатаЦессии_Приложение_Выписка
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Приложение_Выписка")  Тогда
				          MSWordDoc.Bookmarks("ДатаЦессии_Приложение_Выписка").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Общназн(элемСпр,"ДатаДоговораЦессии");
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
                   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;
				

				   ////ДатаЗаявления
				   //Если  MSWordDoc.Bookmarks.Exists("ДатаЗаявления")  Тогда
				   //  MSWordDoc.Bookmarks("ДатаЗаявления").Select();
				   //MSWordDoc.Application.Selection.Font.Color = 1;
				   //датРож=ТекущаяДата();
				   //дат= Формат(датРож, "ДЛФ=ДД");
				   //MSWordDoc.Application.Selection.TypeText(дат);
				   //КонецЕсли;

				   
				    MSWord.Visible=0;
						
						//MSWord.Activate();
						
					//ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".pdf";
					
					
				      имяД=Строка(Общназн(элемСпр,"Исполнитель"))+"_ЗаявлениеОПроцессуальномПравопреемстве";

				 
				      ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				     	
				    	ВыбранныйФайл = Новый Файл(ИмяФайла);
				    	Если ВыбранныйФайл.Существует() Тогда
				    		
				    		УдалитьФайлы(ВыбранныйФайл);
				    		
				    	
				    	КонецЕсли; 

							

						
					MSWordDoc.SaveAs(ИмяФайла,16);
						
					MSWordDoc.Close(0);
						
					MSWord.Application.Quit();

					
					двФайл = Новый ДвоичныеДанные(ИмяФайла);
					
					файлСтруктура.Вставить("ДвоичныеДанные",двФайл);
					файлСтруктура.Вставить("ИмяФайла",ИмяФайла);
					
					
					ВыбранныйФайл = Новый Файл(ИмяФайла);
					Если ВыбранныйФайл.Существует() Тогда
						
						УдалитьФайлы(ВыбранныйФайл);
						
					
					КонецЕсли; 

					
					
				
				   
				  //MSWord.Visible=1;
				  //MSWord.Activate();

				  //
				  //
				 
				  
			
			Исключение
				
				MSWord.Application.Quit();
				
				Сообщить("Ошибка----- Заявление О Процессуальном Правопреемстве");
				ТекстОшибки = ОписаниеОшибки();
				Сообщить(ТекстОшибки);

				
				
			КонецПопытки;
			
			
		КонецЕсли;	

		  
	  
	  
	
	   
		
	

	  Возврат файлСтруктура; 
	
	

КонецФункции // ()




&НаСервере
Функция ПреобразоватьСтадиядела(стадия)

	
	  Если стадия= Перечисления.СтадияДела.ИсполнительноеПроизводство  Тогда
		  
		 Возврат   Перечисления.СтадияДокумента.ИсполнительноеПроизводство;
		 
	  КонецЕсли;
	
	  
	  Если стадия=Перечисления.СтадияДела.СудебноеПроизводство  Тогда
		  
		 Возврат   Перечисления.СтадияДокумента.СудебноеПроизводство;
		 
	  КонецЕсли;
	

	  

КонецФункции // ()


&НаСервере
Функция СоздатьНовыйЭлементЗаявлениеОВыдачеСудебногоПриказа(данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа)
	
	      новыйЭлементСпр=Справочники.ЗаявлениеОВыдачеСудебногоПриказа.СоздатьЭлемент();
		  новыйЭлементСпр.АдресРегистрацииДолжника=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.АдресРегистрацииДолжника;
		  новыйЭлементСпр.АдресСуда=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.АдресСудаВкладка;
		  новыйЭлементСпр.Владелец=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.КредитныйДоговор;
		  новыйЭлементСпр.ГоспошлинаКредитор=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ГоспошлинаКредитор;
		  новыйЭлементСпр.ГоспошлинаНаша=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ГоспошлинаНаша;
		  
		  новыйЭлементСпр.ДатаКредитногоДоговора=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ДатаФинансирования;
		  новыйЭлементСпр.ДатаРожденияДолжника=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ДатаРожденияДолжника;
		  новыйЭлементСпр.ДатаСоздания=ТекущаяДата();
		  новыйЭлементСпр.Исполнитель=ПользовательТк;
		  новыйЭлементСпр.МестоРожденияДолжника=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.МестоРожденияДолжника;
		  новыйЭлементСпр.НазваниеЗаявителя=Взыскатель;
		  новыйЭлементСпр.Наименование="Заявление о выдаче судебного приказа";
		  новыйЭлементСпр.НаименованиеПервоначальногоКредитора=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.НаименованиеПервоначальногоКредитора;
		  
		  новыйЭлементСпр.БанкПервоначальногоКредитора=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.БанкПервоначальногоКредитора;
		  новыйЭлементСпр.ПервоначальныйНомерКредитДоговора=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ПервоначальныйНомерКредитДоговора;
		  
		  
		   Если данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.НомерДоговораЦессии="" Тогда
			   
			    новыйЭлементСпр.ДатаДоговораЦессии=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ДатаЦессииИзДела;
				новыйЭлементСпр.НомерДоговораЦессии=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.НомерЦессииИзДела;

		   	
		   
		   Иначе
		   
		   	    новыйЭлементСпр.ДатаДоговораЦессии=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ДатаДоговораЦессии;
				новыйЭлементСпр.НомерДоговораЦессии=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.НомерДоговораЦессии;
		   
		   КонецЕсли;
		  
		  
		  новыйЭлементСпр.НаименованиеСуда=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.НазваниеСуда;
		  новыйЭлементСпр.Неустойка=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.Неустойка;
		  
		  новыйЭлементСпр.НомерКредитногоДоговора=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.НомерКредитногоДоговора;
		  новыйЭлементСпр.ОбщаяСуммаЗадолженностиПоДоговору=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ОбщаяСуммаЗадолженностиПоДоговору;
		  новыйЭлементСпр.ПаспортДатаВыдачи=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ПаспортныеДанныеДолжникаДатаВыдачи;
		  новыйЭлементСпр.ПроцентНаОсновнойДолг=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ПроцентНаОсновнойДолг;
		  новыйЭлементСпр.ПроцентыНаПроценты=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ПроцентыНаПроценты;
	      новыйЭлементСпр.СтадияДокумента=ПреобразоватьСтадиядела(данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.СтадияДокумента);
		  новыйЭлементСпр.СуммаКредита=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.СуммаКредита;
		  новыйЭлементСпр.ТипДокумента=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ТипДокумента;
		  новыйЭлементСпр.ФИОДолжника=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ДолжникФИО;
		  новыйЭлементСпр.Шаблон=Шаблон;
		  новыйЭлементСпр.КемВыданПаспорт=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ПаспортныеДанныеДолжникаКемВыдан;
		  новыйЭлементСпр.ПаспортныеДанныеДолжника=данныеСтруктураЗаявлениеОВыдачеСудебногоПриказа.ПаспортныеДанныеДолжника;
		  
		  
		 
		  новыйЭлементСпр.is_ready=Истина;
			 
  		  новыйЭлементСпр.Записать();
			 
			 
		  Возврат  новыйЭлементСпр.Ссылка;
	
	
КонецФункции // ()


&НаСервере
Функция СоздатьНовыйЭлементЗаявлениеОПроцессуальномПравопреемстве(данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве)
	
	       
	
	 	     новыйЭлементСпр=Справочники.ЗаявлениеОПроцессуальномПравопреемстве.СоздатьЭлемент();
			 новыйЭлементСпр.АдресРегистрацииДолжника=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.АдресРегистрацииДолжника;
			 новыйЭлементСпр.АдресСуда=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.АдресСуда;
			 новыйЭлементСпр.Владелец=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.КредитныйДоговор;
			 
			 новыйЭлементСпр.ДатаКредитногоДоговора=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ДатаКредитногоДоговора;
			 новыйЭлементСпр.ДатаРожденияДолжника=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ДатаРожденияДолжника;
			 новыйЭлементСпр.ДатаСоздания=ТекущаяДата();
			 новыйЭлементСпр.ДатаСудебногоДела=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ДатаДела;
			 новыйЭлементСпр.Исполнитель=ПользовательТк;
			 новыйЭлементСпр.МестоРожденияДолжника=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.МестоРожденияДолжника;
			 новыйЭлементСпр.НазваниеЗаявителя=Взыскатель;
			 новыйЭлементСпр.Наименование="Заявление о процессуальном правопреемстве";
			 новыйЭлементСпр.НаименованиеПервоначальногоКредитора=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.НаименованиеПервоначальногоКредитора;
			 новыйЭлементСпр.НаименованиеСуда=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.НазваниеСуда;
			 
			 Если данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.НомерДоговораЦессии="" Тогда
			 
			 	   новыйЭлементСпр.НомерДоговораЦессии=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.НомерЦессииИзДела;
  			       новыйЭлементСпр.ДатаДоговораЦессии=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ДатаЦессииИзДела;
			 

			 
			 Иначе
			       новыйЭлементСпр.НомерДоговораЦессии=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.НомерДоговораЦессии;
  			       новыйЭлементСпр.ДатаДоговораЦессии=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ДатаДоговораЦессии;
			 
			 КонецЕсли;
				 
							 
			 новыйЭлементСпр.НомерКредитногоДоговора=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.НомерКредитногоДоговора;
			 новыйЭлементСпр.НомерСудебногоДела=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.НомерДела;
			 
			 новыйЭлементСпр.ПаспортныеДанныеДолжника=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ПаспортныеДанныеДолжника;
			 
			 новыйЭлементСпр.КемВыданПаспорт=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ПаспортКемВыдан;
			 новыйЭлементСпр.ПаспортДатаВыдачи=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ПаспортКогдаВыдан;
			 
			 
			 
			 
			 новыйЭлементСпр.СтадияДокумента=ПреобразоватьСтадиядела(данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.СтадияДокумента);
			 
			 новыйЭлементСпр.ШаблонДляПечати=Шаблон;
			 
			 новыйЭлементСпр.ПервоначальныйНомерКредитДоговора=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ПервоначальныйНомерКредитДоговора;
			 
			 			 
			 
			 новыйЭлементСпр.ТипДокумента=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ТипДокумента;
			 новыйЭлементСпр.ФИОДолжника=данныеСтруктураЗаявлениеОПроцессуальномПравопреемстве.ДолжникФИО;
			 
			 новыйЭлементСпр.is_ready=Истина;
			 
			 новыйЭлементСпр.Записать();
			 
			 
			Возврат  новыйЭлементСпр.Ссылка;
			  
	
	

КонецФункции // ()






  
  
