
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	СтандартнаяОбработка=Ложь;
	
	
	
	 	
	
	Если  Параметры.Свойство("ДоговорСтр") Тогда
		      Объект.Владелец=Параметры.ДоговорСтр;
			  Объект.НомерКредитногоДоговора=Параметры.ДоговорСтр.НомерДоговора;
			  Объект.ДатаКредитногоДоговора=Параметры.ДоговорСтр.ДатаФинансирования;
			  
	
	КонецЕсли;
	
	Если  Параметры.Свойство("ДолжникФИО") Тогда
		      Объект.ФИОДолжника=Параметры.ДолжникФИО;
  	КонецЕсли;
	
	
	Если  РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
		
		      Объект.ДатаСоздания=ТекущаяДата();
         	  Объект.Наименование="Заявление о выдаче судебного приказа";
	  
 

		     Объект.ДатаРожденияДолжника=Параметры.ДатаРожденияДолжника;
	 
			 Объект.АдресРегистрацииДолжника=Параметры.АдресРегистрацииДолжника;

			 Объект.ПаспортныеДанныеДолжника=Параметры.ПаспортныеДанныеДолжника;
			 
			 Объект.ПаспортДатаВыдачи=Параметры.ПаспортныеДанныеДолжникаДатаВыдачи;
			 Объект.КемВыданПаспорт=Параметры.ПаспортКемВыдан;
			 
			 
			 
			 
			 Объект.МестоРожденияДолжника=Параметры.МестоРожденияДолжника;
			 
			 Объект.НаименованиеПервоначальногоКредитора=Параметры.НаименованиеПервоначальногоКредитора;
			 
			 Объект.НомерДоговораЦессии=Параметры.НомерДоговораЦессии;
			 
			 Объект.ДатаДоговораЦессии=Параметры.ДатаДоговораЦессии;
			 
			 Объект.ТипДокумента=Перечисления.ТипДокумента.исх;
			 
			 Объект.СтадияДокумента=Перечисления.СтадияДокумента.СудебноеПроизводство;
			 
			 Объект.НаименованиеСуда=Параметры.НазваниеСуда;
			 
             Объект.АдресСуда=Параметры.АдресСудаВкладка;
			 
			 Объект.Исполнитель=Параметры.Исполнитель;
			 
			
			 
			 ФИОИсполнителя=Параметры.Исполнитель.ФИО;
			 
			 
			 Объект.СуммаКредита=Параметры.СуммаКредита;
			 
			 
			 стрДанных= ПолучитьДанныеДляВыпискиИзРеестра(Параметры.ДоговорСтр);

			 Объект.ОбщаяСуммаЗадолженностиПоДоговору=стрДанных.Итого;
			 
			 
			 
			 Объект.ГоспошлинаНаша=РассчитатьГоспошлину(стрДанных.Итого);
			 
			 Объект.ГоспошлинаКредитор=стрДанных.Госпошлина;
			 
			 Объект.Неустойка=стрДанных.ШтрафыИНеустойки;
			 
			 Объект.ПроцентыНаПроценты=стрДанных.СуммаПроцНаПросрочЗадолж;
			 
			 Объект.ПроцентНаОсновнойДолг=стрДанных.ТекущиеПроценты;
			 
			 Объект.ПервоначальныйНомерКредитДоговора=Параметры.ПервоначальныйНомерКредитДоговора;
			 
			 Объект.БанкПервоначальногоКредитора=Параметры.ПервоначальныйКредитор0;
			 
			 
			 
	  Иначе
		  
		   Если   ЗначениеЗаполнено(Объект.НазваниеЗаявителя) Тогда
		          ЮридическийАдресЗаявителя=Объект.НазваниеЗаявителя.ЮридическийАдрес;
	              EmailЗаявителя=Объект.НазваниеЗаявителя.ЭлектронныйАдрес;
	              Телефон=Объект.НазваниеЗаявителя.Телефон;
		   	
		   
		   КонецЕсли;

		  ФИОИсполнителя=Объект.Исполнитель.ФИО;

	 
		  
      КонецЕсли;
	  
	
		 
	 

КонецПроцедуры

&НаСервере
Функция РассчитатьГоспошлину(СуммаГосОбщая)

	 	
	ИтогРассчет=0;
	
	Если  СуммаГосОбщая<=20000 Тогда
		
		   ИтогРассчет=МАКС((СуммаГосОбщая/100)*4,400);
	
	КонецЕсли;
	
	
	Если  СуммаГосОбщая<=100000 И СуммаГосОбщая>20000 Тогда
		
		 ИтогРассчет=800+(СуммаГосОбщая-20000)/100*3;
	
	КонецЕсли;
	
	
	Если  СуммаГосОбщая>100000 И  СуммаГосОбщая<200000  Тогда
		
		ИтогРассчет=3200+(СуммаГосОбщая-100000)/100*2;
	
	КонецЕсли;
	
	
	Если  СуммаГосОбщая > 200000 И СуммаГосОбщая<1000000 Тогда
		
		 ИтогРассчет=5200+(СуммаГосОбщая-200000)/100;
	
	КонецЕсли;

	
	Если  СуммаГосОбщая>1000000 Тогда
		
		 ИтогРассчет=МИН(13200+(СуммаГосОбщая-1000000)/100*0,5,60000);
	
	КонецЕсли;

	
	 ИтогРассчет=ИтогРассчет/100*50;
	
    Возврат  ИтогРассчет;
	

КонецФункции // ()

  
  

&НаКлиенте
Процедура НазваниеЗаявителяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	      НайтиДанныеПолучателя(ВыбранноеЗначение);

	
	
	  КонецПроцедуры
	  
	  &НаСервере
Процедура НайтиДанныеПолучателя(значпор)

	ЮридическийАдресЗаявителя=значпор.ЮридическийАдрес;
	EmailЗаявителя=значпор.ЭлектронныйАдрес;
	Телефон=значпор.Телефон;
	
	
	

КонецПроцедуры



Функция ПолучитьДанныеДляВыпискиИзРеестра(дог)

	     структДанных=Новый Структура;
	
	
	              //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1 
					|	ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг КАК ПросроченныйОсновнойДолг,
					|	ДанныеДоговоровСрезПоследних.ПросроченныеПроценты КАК ПросроченныеПроценты,
					|	ДанныеДоговоровСрезПоследних.ТекущиеПроценты КАК ТекущиеПроценты,
					|	ДанныеДоговоровСрезПоследних.Госпошлина КАК Госпошлина,
					|	ДанныеДоговоровСрезПоследних.Неустойка КАК Неустойка,
					|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность,
					|	ДанныеДоговоровСрезПоследних.Период КАК Период
					|ИЗ
					|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&МоментВремени, ) КАК ДанныеДоговоровСрезПоследних
					|ГДЕ
					|	ДанныеДоговоровСрезПоследних.Договор = &Договор
					|
					|УПОРЯДОЧИТЬ ПО
					|	Период УБЫВ";
				
				Запрос.УстановитьПараметр("Договор", дог);
				Запрос.УстановитьПараметр("МоментВремени", ТекущаяДата());
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоОсновнДолг",ВыборкаДетальныеЗаписи.ПросроченныйОсновнойДолг);
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоПроцентам",0);
					
					структДанных.Вставить("СуммаПросроченнойКомиссии",0);
					структДанных.Вставить("ШтрафыИНеустойки",ВыборкаДетальныеЗаписи.Неустойка);
					
					структДанных.Вставить("СуммаПроцНаПросрочЗадолж",ВыборкаДетальныеЗаписи.ПросроченныеПроценты);
					
					структДанных.Вставить("Госпошлина",ВыборкаДетальныеЗаписи.Госпошлина);
					
					структДанных.Вставить("Итого",ВыборкаДетальныеЗаписи.ВсегоЗадолженность);
					
					структДанных.Вставить("ТекущиеПроценты",ВыборкаДетальныеЗаписи.ТекущиеПроценты);
					
					
					
				КонецЦикла;
				
		
	
	
   Возврат 	структДанных;
  
				
КонецФункции // ()




&НаКлиенте
Процедура Печать(Команда)
	
	    ДвоичныеДанные=ПолучитьФайлИзХран();
		
		Если ДвоичныеДанные<>Неопределено  Тогда
			
			Попытка
			
				имяД=Строка(Объект.Исполнитель)+"_ЗаявлениеОВыдачеСудебногоПриказа";
				  
							
				ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				
				ВыбранныйФайл = Новый Файл(ИмяФайла);
				Если ВыбранныйФайл.Существует() Тогда
					
					УдалитьФайлы(ВыбранныйФайл);
					
				
				КонецЕсли; 

				ДвоичныеДанные.Записать(ИмяФайла);
				
				
				 MSWord = новый COMОбъект("Word.Application");
				 //Передаем текущие параметры форм в MSWord
				 MSWord.Documents.Open(ИмяФайла);	
				 MSWordDoc = MSWord.ActiveDocument();

				
				  MSWordDoc.Bookmarks("НаименованиеСуда").Select();
				  MSWordDoc.Application.Selection.Font.Color = 1;
                  MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеСуда));

				  //АдресСуда
				   MSWordDoc.Bookmarks("АдресСуда").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.АдресСуда);

				   
				   //ФИОДолжника 
				   MSWordDoc.Bookmarks("ФИОДолжника").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
				   
				   //ДатаРожденияДолжника
				    MSWordDoc.Bookmarks("ДатаРожденияДолжника").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаРожденияДолжника;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //МестоРожденияДолжника
				   MSWordDoc.Bookmarks("МестоРожденияДолжника").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.МестоРожденияДолжника);
				   
				   //ПаспортНомер
				   MSWordDoc.Bookmarks("ПаспортНомер").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.ПаспортныеДанныеДолжника);
				   
				   
				   //ПаспортДатаВыдачи
				   MSWordDoc.Bookmarks("ПаспортДатаВыдачи").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ПаспортДатаВыдачи;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   //АдресРегистрации
				    MSWordDoc.Bookmarks("АдресРегистрации").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.АдресРегистрацииДолжника);
				   
				   
				   //СуммаЗадолженности
				     MSWordDoc.Bookmarks("СуммаЗадолженности").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.ОбщаяСуммаЗадолженностиПоДоговору);
				   
					//ГосПошлина
				   MSWordDoc.Bookmarks("ГосПошлина").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.ГоспошлинаНаша);
				   
				   //ПервоначальныйКредитор
				    MSWordDoc.Bookmarks("ПервоначальныйКредитор").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
				   
				   //ФИОДолжника_Между
				     MSWordDoc.Bookmarks("ФИОДолжника_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника)+" ");
				   
				   
				   //НомерКредитногоДоговора
				       MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				   
				   //ДатаКредитногоДоговора
				     MSWordDoc.Bookmarks("ДатаКредитногоДоговора").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //ПервоначальныйКредитор_заключенной
				      MSWordDoc.Bookmarks("ПервоначальныйКредитор_заключенной").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
				  
				   //СуммаКредита
				         MSWordDoc.Bookmarks("СуммаКредита").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.СуммаКредита);
				   
				   
				   //ДатаЦессии
				        MSWordDoc.Bookmarks("ДатаЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
				   MSWordDoc.Application.Selection.TypeText(дат);
				   
				   //ПервоначальныйКредитор_ДатаЦессии
				         MSWordDoc.Bookmarks("ПервоначальныйКредитор_ДатаЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
				   
				   //НомерЦессии
				      MSWordDoc.Bookmarks("НомерЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
				   
				   
				   //ДатаЦессии_БылЗаключен
				       MSWordDoc.Bookmarks("ДатаЦессии_БылЗаключен").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //НомерКредитногоДоговора_кредитномудого
				         MSWordDoc.Bookmarks("НомерКредитногоДоговора_кредитномудого").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				   
				   
				   //ДатаКредитногоДоговора_кредитномудог
				       MSWordDoc.Bookmarks("ДатаКредитногоДоговора_кредитномудог").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //ПервоначальныйКредитор_заключенного_межд
				        MSWordDoc.Bookmarks("ПервоначальныйКредитор_заключенного_межд").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
				   
				   
				   //ФИОДолжника_заключенного_между
				      MSWordDoc.Bookmarks("ФИОДолжника_заключенного_между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника)+" ");
				  

				   //ДатаЦессии_уступаемых
				         MSWordDoc.Bookmarks("ДатаЦессии_уступаемых").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

					//ОбщаяСуммаЗадолженностиПоЦессии
			       MSWordDoc.Bookmarks("ОбщаяСуммаЗадолженностиПоЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.ОбщаяСуммаЗадолженностиПоДоговору);
				   
				   
				   //ОбщаяСуммаЗадолженностиПоЦессии_составля
				    MSWordDoc.Bookmarks("ОбщаяСуммаЗадолженностиПоЦессии_составля").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.ОбщаяСуммаЗадолженностиПоДоговору);
				   
				   //НомерКредитногоДоговора_выполнении
				   MSWordDoc.Bookmarks("НомерКредитногоДоговора_выполнении").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				 
				   
				   //ДатаКредитногоДоговора_выполнении
				         MSWordDoc.Bookmarks("ДатаКредитногоДоговора_выполнении").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //ФИОДолжника_Прошу_выдать
				         MSWordDoc.Bookmarks("ФИОДолжника_Прошу_выдать").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника)+" ");
				  
				   
					//ОбщаяСуммаЗадолженностиПоЦессии_Прошу
					  MSWordDoc.Bookmarks("ОбщаяСуммаЗадолженностиПоЦессии_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.ОбщаяСуммаЗадолженностиПоДоговору);
				  
				   //НомерКредитногоДоговора_Прошу
				    MSWordDoc.Bookmarks("НомерКредитногоДоговора_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				 
				   
				   //ДатаКредитногоДоговора_Прошу
				          MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //ПервоначальныйКредитор_Прошу
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
				   
				   
				   //ФИОДолжника_Прошу_Взыскать
				   MSWordDoc.Bookmarks("ФИОДолжника_Прошу_Взыскать").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника)+" ");
				   
				   
				   //СуммаГоспошлины_Прошу
				      MSWordDoc.Bookmarks("СуммаГоспошлины_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.ГоспошлинаНаша);
				 
				   
				   //НомерКредитногоДоговора_Приложение
				      MSWordDoc.Bookmarks("НомерКредитногоДоговора_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				   
				   
				   //ДатаКредитногоДоговора_Приложение
				   MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);


				   //НомерЦессии_Приложение
				          MSWordDoc.Bookmarks("НомерЦессии_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
				   
				   //ДатаЦессии_Приложение
				          MSWordDoc.Bookmarks("ДатаЦессии_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //ДатаЦессии_Приложение_5
				    MSWordDoc.Bookmarks("ДатаЦессии_Приложение_5").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
					//ДатаЗаявления
				             MSWordDoc.Bookmarks("ДатаЗаявления").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=ТекущаяДата();
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);


				   
				   
				   
				   
				 
				  MSWord.Visible=1;
				  MSWord.Activate();

				

			
			Исключение
				
					Сообщить("Ошибка----- Печать Заявление О Выдаче Судебного Приказа");
				ТекстОшибки = ОписаниеОшибки();
				Сообщить(ТекстОшибки);

				
			КонецПопытки;
			
		КонецЕсли;
			
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФайлИзХран()
	
	 
	   НайтиШабл = Справочники.ШаблоныЮристы.НайтиПоНаименованию("ШаблонЗаявлениеОВыдачеСудебногоПриказа",ИСТИНА);
	 
	     Двоичные=Неопределено;
		 
		 Если НайтиШабл<>Неопределено Тогда
		 
		 	 Если НЕ НайтиШабл.ПУСТАЯ() Тогда  
 
        		Хран=НайтиШабл.ФайлШаблона;
        		Двоичные=Хран.Получить(); 
    			
    		КонецЕсли;
			

		 
		 КонецЕсли; 
    	
			
	  Возврат Двоичные;		
	 

КонецФункции // ()

&НаКлиенте
Процедура РассчитатьГоспошлинуНаша(Команда)
	// Вставить содержимое обработчика.
	 Оповещение = Новый ОписаниеОповещения("РассчетГоспошлины", ЭтотОбъект);
      парамСтруктура=Новый Структура;
	  парамСтруктура.Вставить("РасчетнаяСуммаГоспошлина",Объект.ОбщаяСуммаЗадолженностиПоДоговору);
	 
	 ОткрытьФорму("Обработка.СудебнаяСтадия.Форма.ФормаГоспошлина",парамСтруктура,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	 

	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчетГоспошлины(РезультатРассчета, Параметры) Экспорт

	           Объект.ГоспошлинаНаша=РезультатРассчета.Госпошлина;
	           ЭтаФорма.Прочитать();
	
  
  
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеСудаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Объект.АдресСуда=АдресСуда(ВыбранноеЗначение); 
	
КонецПроцедуры

&НаСервере
Функция АдресСуда(СсылкаСуд)
	
	 справСуды=СсылкаСуд.ПолучитьОбъект();
	 
	 Возврат  справСуды.Адрес;

КонецФункции // ()

&НаКлиенте
Процедура is_readyПриИзменении(Элемент)
	
	Если Объект.is_ready Тогда
		
		     	
		 //  Очистит присоединенные файлы
		 массивСтруктур= ПолучитьПрисоединенныеФайлы(Объект.Ссылка);
		 
		 Для каждого стрФайл  Из массивСтруктур Цикл
			 
			  строкаПуть= ПолучитьПутьКФайлу(стрФайл);
			 Попытка
				 
				 
			  ВыбФайл = Новый Файл(строкаПуть);	 
			  Если ВыбФайл.Существует() Тогда 
			    Если ВыбФайл.ПолучитьТолькоЧтение() Тогда
			        ВыбФайл.УстановитьТолькоЧтение(Ложь);
			    КонецЕсли;
			    УдалитьФайлы(строкаПуть);                       
			 КонецЕсли;
							 
			

			  УдалитьИзСправочникаФайл(стрФайл);
			  
			 
			 Исключение
				 
				 ТекстОшибки = ОписаниеОшибки();
				 Сообщить(ТекстОшибки);
				 
			 КонецПопытки;
			 
					 	
		 
		 КонецЦикла;
		 
		
		
		
		  файлСтр= СформироватьФайлЗаявлениеОВыдачеСудебногоПриказа();

		  
		  записатьВХранилищеЗаявлениеОВыдачеСудебногоПриказа(файлСтр);
		  
		  
	      файлВыписка=СформироватьФайлВыпискаИзРеестра(Объект.Владелец);
		 
		 
		   записатьВХранилищеВыпискаИзРеестра(файлВыписка);

		   Оповестить("ОбновитьСписок1");
		  
		  
		  Сообщить("Ок");
		
	КонецЕсли;

	
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПутьКФайлу(ссылкаНаФайл)

	        об=ссылкаНаФайл.ПолучитьОбъект();
			
			   
			Возврат  об.Том.ПолныйПутьWindows+ об.ПутьКФайлу;

КонецФункции // ()


&НаСервере
Процедура УдалитьИзСправочникаФайл(ссылкаНаФайл)

	        об=ссылкаНаФайл.ПолучитьОбъект();
			
			
			об.Удалить();
			   
			

КонецПроцедуры	


&НаСервере
Функция ПолучитьПрисоединенныеФайлы(владелецФайлов)

		//структураФайлы=Новый Структура;

		массивСтруктур=Новый Массив;
		
	
	         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОФайлах.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СведенияОФайлах КАК СведенияОФайлах
		|ГДЕ
		|	СведенияОФайлах.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", владелецФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи

		//структураФайлы.Вставить("Файл", ВыборкаДетальныеЗаписи.Файл);
		массивСтруктур.Добавить(ВыборкаДетальныеЗаписи.Файл);

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	 //ВыборкаДетальныеЗаписи.Файл.ПутьКФайлу
	
	
	 Возврат массивСтруктур;

КонецФункции // ()



&НаСервере
Процедура записатьВХранилищеВыпискаИзРеестра(файлВыписка)

          имяД=Строка(Объект.Исполнитель)+"_ВыпискаИзРеестра";

	
	      адресВХранилище = ПоместитьВоВременноеХранилище(файлВыписка.ДвоичныеДанные);
        
          ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(Объект.Ссылка,имяД,"docx",,,адресВХранилище);
		  
		  УдалитьФайлы(файлВыписка.ИмяФайла);

	

КонецПроцедуры


&НаСервере
Функция ПолучитьДанныеДляВыпискиИзРеестраВхр(дог)

	     структДанных=Новый Структура;
	
	
	              //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг КАК ПросроченныйОсновнойДолг,
					|	ДанныеДоговоровСрезПоследних.ПросроченныеПроценты КАК ПросроченныеПроценты,
					|	ДанныеДоговоровСрезПоследних.ТекущиеПроценты КАК ТекущиеПроценты,
					|	ДанныеДоговоровСрезПоследних.Госпошлина КАК Госпошлина,
					|	ДанныеДоговоровСрезПоследних.Неустойка КАК Неустойка,
					|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность
					|ИЗ
					|	РегистрСведений.ДанныеДоговоров.СрезПоследних КАК ДанныеДоговоровСрезПоследних
					|ГДЕ
					|	ДанныеДоговоровСрезПоследних.Договор = &Договор";
				
				Запрос.УстановитьПараметр("Договор", дог);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоОсновнДолг",ВыборкаДетальныеЗаписи.ПросроченныйОсновнойДолг);
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоПроцентам",0);
					
					структДанных.Вставить("СуммаПросроченнойКомиссии",0);
					структДанных.Вставить("ШтрафыИНеустойки",ВыборкаДетальныеЗаписи.Неустойка);
					
					структДанных.Вставить("СуммаПроцНаПросрочЗадолж",ВыборкаДетальныеЗаписи.ПросроченныеПроценты);
					
					структДанных.Вставить("Госпошлина",ВыборкаДетальныеЗаписи.Госпошлина);
					
					структДанных.Вставить("Итого",ВыборкаДетальныеЗаписи.ВсегоЗадолженность);
					
					
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорЦессии.НомерДоговора КАК НомерЦессии,
		|	ДоговорЦессии.ДатаЦессии КАК ДатаЦессии,
		|	Договоры.НомерДоговора КАК НомерДоговора,
		|	Договоры.Владелец КАК Владелец,
		|	Договоры.Владелец.ДатаРождения КАК ВладелецДатаРождения,
		|	Договоры.ДатаФинансирования КАК ДатаФинансирования
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорЦессии КАК ДоговорЦессии
		|		ПО (ДоговорЦессии.Владелец = Договоры.Ссылка)
		|ГДЕ
		|	Договоры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", дог);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		структДанных.Вставить("Цессия_заголовок",ВыборкаДетальныеЗаписи.НомерЦессии);
		структДанных.Вставить("ЦессияДата_заголовок",ВыборкаДетальныеЗаписи.ДатаЦессии);
		структДанных.Вставить("Дата_Рождения",ВыборкаДетальныеЗаписи.ВладелецДатаРождения);
		структДанных.Вставить("ФИО_Должник",ВыборкаДетальныеЗаписи.Владелец);
		структДанных.Вставить("НомерКредитногоДоговора",ВыборкаДетальныеЗаписи.НомерДоговора);
		структДанных.Вставить("Дата_ВыдачиКредитногоДоговора",ВыборкаДетальныеЗаписи.ДатаФинансирования);
		
		
		//структДанных.Вставить("Цессия_заголовок",ВыборкаДетальныеЗаписи.НомерЦессии);
		//структДанных.Вставить("Цессия_заголовок",ВыборкаДетальныеЗаписи.НомерЦессии);
		//
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
		Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	СписокДелКредитногоДоговора.НомерДела КАК НомерДела,
						|	СписокДелКредитногоДоговора.ДатаДела КАК ДатаДела,
						|	СписокДелКредитногоДоговора.СтадияДела КАК СтадияДела,
						|	СписокДелКредитногоДоговора.НомерЦессии КАК НомерЦессии,
						|	СписокДелКредитногоДоговора.ДатаЦессии КАК ДатаЦессии
						|ИЗ
						|	Справочник.СписокДелКредитногоДоговора КАК СписокДелКредитногоДоговора
						|ГДЕ
						|	СписокДелКредитногоДоговора.Владелец = &Владелец
						|
						|УПОРЯДОЧИТЬ ПО
						|	ДатаДела УБЫВ";
					
					Запрос.УстановитьПараметр("Владелец", дог);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					      Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						      структДанных.Вставить("НомерДела",ВыборкаДетальныеЗаписи.НомерДела);
                              структДанных.Вставить("ДатаДела",ВыборкаДетальныеЗаписи.ДатаДела);
							  
							  структДанных.Вставить("СтадияДокумента",ВыборкаДетальныеЗаписи.СтадияДела);
							  
							  структДанных.Вставить("НомерЦессииИзДела",ВыборкаДетальныеЗаписи.НомерЦессии);
                              структДанных.Вставить("ДатаЦессииИзДела",ВыборкаДетальныеЗаписи.ДатаЦессии);
							  
							  
							  
						
						  КонецЦикла;
					Иначе	  
                             структДанных.Вставить("НомерДела","");
                             структДанных.Вставить("ДатаДела",'00010101');
						     структДанных.Вставить("СтадияДокумента",Перечисления.СтадияДокумента.СудебноеПроизводство);
							  структДанных.Вставить("НомерЦессииИзДела","");
                              структДанных.Вставить("ДатаЦессииИзДела",'00010101');
						
					
					КонецЕсли;

	


     структДанных.Вставить("Исполнитель",Объект.Исполнитель);
				
	
	
	
   Возврат 	структДанных;
  
				
КонецФункции // ()


&НаКлиенте
Функция СформироватьФайлВыпискаИзРеестра(дог)
	
	      спрОбСтруктура=ПолучитьДанныеДляВыпискиИзРеестраВхр(дог);
		  
		    НомерЦессии="";
		  ДатаЦессии='00010101';
		  
		  Если спрОбСтруктура.Цессия_заголовок=null Тогда
		  
		   	    НомерЦессии=спрОбСтруктура.НомерЦессииИзДела;
		        ДатаЦессии=спрОбСтруктура.ДатаЦессииИзДела;
		  	
		  
		  Иначе
		  
		  	    НомерЦессии=спрОбСтруктура.Цессия_заголовок;
		        ДатаЦессии=спрОбСтруктура.ЦессияДата_заголовок;
		  
		  
		  КонецЕсли;

		  
		  
	
	      ДвоичныеДанные=ПолучитьФайлВыпискаИзРеестраХран();
			 
		  файлСтруктура=Новый Структура;
			 
		  Если ДвоичныеДанные<>Неопределено  Тогда
			  
			  
			   MSWord = новый COMОбъект("Word.Application");

			  Попытка
			
				
				имяД=Строка(Объект.Исполнитель)+"_ВыпискаИзРеестра";
				  
				 
				//Shell = Новый COMОбъект("WScript.Shell");
				//дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
				//
				
				//ИмяФайла=дирМоиД+"\"+имяД+".docx"; 	
				
				
				
							
				ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				
				ВыбранныйФайл = Новый Файл(ИмяФайла);
				Если ВыбранныйФайл.Существует() Тогда
					
					УдалитьФайлы(ВыбранныйФайл);
					
				
				КонецЕсли; 

				ДвоичныеДанные.Записать(ИмяФайла);

				
				
					 //Передаем текущие параметры форм в MSWord
					 MSWord.Documents.Open(ИмяФайла);	
					 MSWordDoc = MSWord.ActiveDocument();

					 
					  MSWordDoc.Bookmarks("Цессия_заголовок").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(НомерЦессии));

					  
					   //ЦессияДата_заголовок
				    MSWordDoc.Bookmarks("ЦессияДата_заголовок").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датЦессия=ДатаЦессии;
				   дат= Формат(датЦессия, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				    //Дата_Рождения
				    MSWordDoc.Bookmarks("Дата_Рождения").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=спрОбСтруктура.Дата_Рождения;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //Цессия_Название
					  MSWordDoc.Bookmarks("Цессия_Название").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(НомерЦессии));

					  //ЦессияДата_Название
				         MSWordDoc.Bookmarks("ЦессияДата_Название").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датЦессия=ДатаЦессии;
					   дат= Формат(датЦессия, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);

					   
					 // ФИО_Должник
					   MSWordDoc.Bookmarks("ФИО_Должник").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ФИО_Должник));

					  //НомерКредитногоДоговора
					    MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.НомерКредитногоДоговора));

					   
					  //Дата_ВыдачиКредитногоДоговора
					       MSWordDoc.Bookmarks("Дата_ВыдачиКредитногоДоговора").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датЦессия=спрОбСтруктура.Дата_ВыдачиКредитногоДоговора;
					   дат= Формат(датЦессия, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);

					   
					   //ОстатокПросроченнойЗадПоОсновнДолг
					  MSWordDoc.Bookmarks("ОстатокПросроченнойЗадПоОсновнДолг").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ОстатокПросроченнойЗадПоОсновнДолг));

					  
					  //ОстатокПросроченнойЗадПоПроцентам
					  MSWordDoc.Bookmarks("ОстатокПросроченнойЗадПоПроцентам").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ОстатокПросроченнойЗадПоПроцентам));

					  
					  //СуммаПросроченнойКомиссии
					    MSWordDoc.Bookmarks("СуммаПросроченнойКомиссии").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.СуммаПросроченнойКомиссии));

					   //ШтрафыИНеустойки
					   MSWordDoc.Bookmarks("ШтрафыИНеустойки").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ШтрафыИНеустойки));

					  //СуммаПроцНаПросрочЗадолж
					    MSWordDoc.Bookmarks("СуммаПроцНаПросрочЗадолж").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.СуммаПроцНаПросрочЗадолж));

					  
					  //Госпошлина
					     MSWordDoc.Bookmarks("Госпошлина").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.Госпошлина));

					  //Итого
					        MSWordDoc.Bookmarks("Итого").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.Итого));

					  
						 //Дата_подвал
					  Если  MSWordDoc.Bookmarks.Exists("Дата_подвал")  Тогда
						   MSWordDoc.Bookmarks("Дата_подвал").Select();
						   MSWordDoc.Application.Selection.Font.Color = 1;
						   датЦессия=ТекущаяДата();
						   дат= Формат(датЦессия, "ДЛФ=ДД");
						   MSWordDoc.Application.Selection.TypeText(дат);
                      КонецЕсли;
					   
					     //ФИОСотрудника
					   Если  MSWordDoc.Bookmarks.Exists("ФИОСотрудника")  Тогда
					      MSWordDoc.Bookmarks("ФИОСотрудника").Select();
						  MSWordDoc.Application.Selection.Font.Color = 1;
		                  MSWordDoc.Application.Selection.TypeText(Строка(ФИОИсполнителя));
					   КонецЕсли;


					   
					     MSWord.Visible=0;
						
						//MSWord.Activate();
						
					//ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".pdf";
					
					
				      имяД=Строка(Объект.Исполнитель)+"_ВыпискаИзРеестра";

				 
				      ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				     	
				    	ВыбранныйФайл = Новый Файл(ИмяФайла);
				    	Если ВыбранныйФайл.Существует() Тогда
				    		
				    		УдалитьФайлы(ВыбранныйФайл);
				    		
				    	
				    	КонецЕсли; 

							

						
					MSWordDoc.SaveAs(ИмяФайла,16);
					
					MSWordDoc.Close(0);
						
					MSWord.Application.Quit();


					
					двФайл = Новый ДвоичныеДанные(ИмяФайла);
					
					файлСтруктура.Вставить("ДвоичныеДанные",двФайл);
					файлСтруктура.Вставить("ИмяФайла",ИмяФайла);
					
					
					ВыбранныйФайл = Новый Файл(ИмяФайла);
					Если ВыбранныйФайл.Существует() Тогда
						
						УдалитьФайлы(ВыбранныйФайл);
						
					
					КонецЕсли; 

					
					
					
								
				
				
			
			Исключение
				
				   MSWord.Application.Quit();

				   Сообщить("Ошибка-----  Выписки из реестра");
				   ТекстОшибки = ОписаниеОшибки();
				   Сообщить(ТекстОшибки);

				
			КонецПопытки;  
			  
			  
		  КонецЕсли;	  
		  
	 
	    Возврат файлСтруктура;
	

КонецФункции // ()



&НаСервере
Функция ПолучитьФайлВыпискаИзРеестраХран()
	
	 
	   НайтиШабл = Справочники.ШаблоныЮристы.НайтиПоНаименованию("ШаблонВыпискиИзРеестра",ИСТИНА);
	 
	     Двоичные=Неопределено;
		 
		 Если НайтиШабл<>Неопределено Тогда
		 
		 	 Если НЕ НайтиШабл.ПУСТАЯ() Тогда  
 
        		Хран=НайтиШабл.ФайлШаблона;
        		Двоичные=Хран.Получить(); 
    			
    		КонецЕсли;
			

		 
		 КонецЕсли; 
    	
			
	  Возврат Двоичные;		
	 

КонецФункции // ()



&НаСервере
Процедура записатьВХранилищеЗаявлениеОВыдачеСудебногоПриказа(файлСтр)

	        имяД=Строка(Объект.Исполнитель)+"_ЗаявлениеОВыдачеСудебногоПриказа";
			
			адресВХранилище = ПоместитьВоВременноеХранилище(файлСтр.ДвоичныеДанные);
        
          ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(Объект.Ссылка,имяД,"docx",,,адресВХранилище);
		  
		  УдалитьФайлы(файлСтр.ИмяФайла);


	
	

КонецПроцедуры



&НаКлиенте
Функция СформироватьФайлЗаявлениеОВыдачеСудебногоПриказа()
	
	         ДвоичныеДанные=ПолучитьФайлЗаявлениеОВыдачеСудебногоПриказаИзХран();
			 
			 файлСтруктура=Новый Структура;
			 
			 Если ДвоичныеДанные<>Неопределено  Тогда
				 
				 
				  MSWord = новый COMОбъект("Word.Application");

				 
				 Попытка
					 
					   	имяД=Строка(Объект.Исполнитель)+"_ЗаявлениеОВыдачеСудебногоПриказа";
				  
							
				ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				
				ВыбранныйФайл = Новый Файл(ИмяФайла);
				Если ВыбранныйФайл.Существует() Тогда
					
					УдалитьФайлы(ВыбранныйФайл);
					
				
				КонецЕсли; 

				ДвоичныеДанные.Записать(ИмяФайла);
				
				
				структураЗадолженностьСрезПоследних=ФункцииДляОтчетов.ВсегоЗадолженностьСрезПоследних(ТекущаяДата(),Объект.Владелец);
				
				
				 
				 //Передаем текущие параметры форм в MSWord
				 MSWord.Documents.Open(ИмяФайла);	
				 MSWordDoc = MSWord.ActiveDocument();

				 
				 Если  MSWordDoc.Bookmarks.Exists("НаименованиеСуда")  Тогда
					  MSWordDoc.Bookmarks("НаименованиеСуда").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеСуда));
				 КонецЕсли;	  

				 
				 //СуммаПросрочкиПоОД
				  Если  MSWordDoc.Bookmarks.Exists("СуммаПросрочкиПоОД")  Тогда
					  MSWordDoc.Bookmarks("СуммаПросрочкиПоОД").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(структураЗадолженностьСрезПоследних.ПросроченныйОсновнойДолг));
				 КонецЕсли;	  

				 
				 //СуммаПросрочкиПроценты
                   Если  MSWordDoc.Bookmarks.Exists("СуммаПросрочкиПроценты")  Тогда
					  MSWordDoc.Bookmarks("СуммаПросрочкиПроценты").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(структураЗадолженностьСрезПоследних.ПросроченныеПроценты));
				   КонецЕсли;	  
				 
				 //СуммаПросрочкиКомиссий
				    Если  MSWordDoc.Bookmarks.Exists("СуммаПросрочкиКомиссий")  Тогда
				      MSWordDoc.Bookmarks("СуммаПросрочкиКомиссий").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(структураЗадолженностьСрезПоследних.Неустойка));
				   КонецЕсли;	  
				 
				   //СуммаПросрочкиКомиссийНа
				    Если  MSWordDoc.Bookmarks.Exists("СуммаПросрочкиКомиссийНа")  Тогда
				      MSWordDoc.Bookmarks("СуммаПросрочкиКомиссийНа").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(структураЗадолженностьСрезПоследних.Неустойка));
				   КонецЕсли;
				   
				   //ВсегоЗадолженностьПоСостояню
				     Если  MSWordDoc.Bookmarks.Exists("ВсегоЗадолженностьПоСостояню")  Тогда
					     MSWordDoc.Bookmarks("ВсегоЗадолженностьПоСостояню").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ОбщаяСуммаЗадолженностиПоДоговору);
				   КонецЕсли;	   
				   
				   
				   //ФИОСотрудника
				     Если  MSWordDoc.Bookmarks.Exists("ФИОСотрудника")  Тогда
				      MSWordDoc.Bookmarks("ФИОСотрудника").Select();
					  MSWordDoc.Application.Selection.Font.Color = 1;
	                  MSWordDoc.Application.Selection.TypeText(Строка(ФИОИсполнителя));
				   КонецЕсли;
				 
				 
				  //АдресСуда
				  Если  MSWordDoc.Bookmarks.Exists("АдресСуда")  Тогда
				   MSWordDoc.Bookmarks("АдресСуда").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.АдресСуда);
                  КонецЕсли;
				   
				   //ФИОДолжника
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника")  Тогда
				   MSWordDoc.Bookmarks("ФИОДолжника").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
				   КонецЕсли;
				   
				   //ДатаРожденияДолжника
				   Если  MSWordDoc.Bookmarks.Exists("ДатаРожденияДолжника")  Тогда
				    MSWordDoc.Bookmarks("ДатаРожденияДолжника").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаРожденияДолжника;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;

				   
				   //МестоРожденияДолжника
				   Если  MSWordDoc.Bookmarks.Exists("МестоРожденияДолжника")  Тогда
				   MSWordDoc.Bookmarks("МестоРожденияДолжника").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.МестоРожденияДолжника);
				   КонецЕсли;
				   
				   //ПаспортНомер
				   Если  MSWordDoc.Bookmarks.Exists("ПаспортНомер")  Тогда
					   MSWordDoc.Bookmarks("ПаспортНомер").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ПаспортныеДанныеДолжника);
				   КонецЕсли;
					   
					   
				   //ПаспортКемВыдан
				   Если  MSWordDoc.Bookmarks.Exists("КемВыдан")  Тогда
					   MSWordDoc.Bookmarks("КемВыдан").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.КемВыданПаспорт);
				   КонецЕсли;
				   
				   
				   //ПаспортДатаВыдачи
				   Если  MSWordDoc.Bookmarks.Exists("ПаспортДатаВыдачи")  Тогда
					   MSWordDoc.Bookmarks("ПаспортДатаВыдачи").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ПаспортДатаВыдачи;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;
				   
				   

				   //АдресРегистрации
				   Если  MSWordDoc.Bookmarks.Exists("АдресРегистрации")  Тогда
					    MSWordDoc.Bookmarks("АдресРегистрации").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.АдресРегистрацииДолжника);
				   КонецЕсли;
					   
				   
				   //СуммаЗадолженности
				   Если  MSWordDoc.Bookmarks.Exists("СуммаЗадолженности")  Тогда
					     MSWordDoc.Bookmarks("СуммаЗадолженности").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ОбщаяСуммаЗадолженностиПоДоговору);
				   КонецЕсли;	   
					   
					//ГосПошлина
					Если  MSWordDoc.Bookmarks.Exists("ГосПошлина")  Тогда
					   MSWordDoc.Bookmarks("ГосПошлина").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ГоспошлинаНаша);
					КонецЕсли;   
					   
				   //ПервоначальныйКредитор
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор")  Тогда
				        MSWordDoc.Bookmarks("ПервоначальныйКредитор").Select();
				        MSWordDoc.Application.Selection.Font.Color = 1;
				        MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
   
					КонецЕсли;
					
					
					 //НомерКредитногоДоговора_выполнении0
							    Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_выполнении0")  Тогда
							        MSWordDoc.Bookmarks("НомерКредитногоДоговора_выполнении0").Select();
							        MSWordDoc.Application.Selection.Font.Color = 1;
							        MSWordDoc.Application.Selection.TypeText(Объект.ПервоначальныйНомерКредитДоговора+" ");
			   
								КонецЕсли;

					
					//НомерКредитногоДоговора0
					     Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора0")  Тогда
					        MSWordDoc.Bookmarks("НомерКредитногоДоговора0").Select();
					        MSWordDoc.Application.Selection.Font.Color = 1;
					        MSWordDoc.Application.Selection.TypeText(Объект.ПервоначальныйНомерКредитДоговора+" ");
	   
						КонецЕсли;

		     	  //ПервоначальныйКредитор_изменены
					    Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_изменены")  Тогда
							   MSWordDoc.Bookmarks("ПервоначальныйКредитор_изменены").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
							   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					   КонецЕсли;

					   
					   //ДатаКредитногоДоговора_изменны
					    Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_изменны")  Тогда
						     MSWordDoc.Bookmarks("ДатаКредитногоДоговора_изменны").Select();
						   MSWordDoc.Application.Selection.Font.Color = 1;
						   датРож=Объект.ДатаКредитногоДоговора;
						   дат= Формат(датРож, "ДЛФ=ДД");
						   MSWordDoc.Application.Selection.TypeText(дат);
					   КонецЕсли;

					   //НомерКредитногоДоговора_изменены
					     Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_изменены")  Тогда
					       MSWordDoc.Bookmarks("НомерКредитногоДоговора_изменены").Select();
						   MSWordDoc.Application.Selection.Font.Color = 1;
		                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
					   КонецЕсли;

					   
					      //НомерКредитногоДоговора_ПриложениеНеп
							   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_ПриложениеНеп")  Тогда
							      MSWordDoc.Bookmarks("НомерКредитногоДоговора_ПриложениеНеп").Select();
							      MSWordDoc.Application.Selection.Font.Color = 1;
			                     MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
							   КонецЕсли;
							   

					   
					   
					   	//НомерКредитногоДоговора_Прошу0
							 Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Прошу0")  Тогда
						        MSWordDoc.Bookmarks("НомерКредитногоДоговора_Прошу0").Select();
						        MSWordDoc.Application.Selection.Font.Color = 1;
						        MSWordDoc.Application.Selection.TypeText(Объект.ПервоначальныйНомерКредитДоговора+" ");
		   
							КонецЕсли;

					   
						
					
					//ПервоначальныйКредитор0
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор0")  Тогда
				        MSWordDoc.Bookmarks("ПервоначальныйКредитор0").Select();
				        MSWordDoc.Application.Selection.Font.Color = 1;
				        MSWordDoc.Application.Selection.TypeText(Объект.БанкПервоначальногоКредитора+" ");
   
					КонецЕсли;
					
					//ПервоначальныйКредитор_заключенной0
					Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_заключенной0")  Тогда
				        MSWordDoc.Bookmarks("ПервоначальныйКредитор_заключенной0").Select();
				        MSWordDoc.Application.Selection.Font.Color = 1;
				        MSWordDoc.Application.Selection.TypeText(Объект.БанкПервоначальногоКредитора+" ");
   
					КонецЕсли;
					
					//ПервоначальныйКредитор_Прошу0
					 Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Прошу0")  Тогда
				        MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу0").Select();
				        MSWordDoc.Application.Selection.Font.Color = 1;
				        MSWordDoc.Application.Selection.TypeText(Объект.БанкПервоначальногоКредитора+" ");
   
					КонецЕсли;
					
						//ПервоКредитор_заключенного_межд0
								  Если  MSWordDoc.Bookmarks.Exists("ПервоКредитор_заключенного_межд0")  Тогда 
							        MSWordDoc.Bookmarks("ПервоКредитор_заключенного_межд0").Select();
								   MSWordDoc.Application.Selection.Font.Color = 1;
								   MSWordDoc.Application.Selection.TypeText(Объект.БанкПервоначальногоКредитора+" ");
							   
							    КонецЕсли;

					
					
				   				   
				   //ФИОДолжника_Между
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Между")  Тогда
					     MSWordDoc.Bookmarks("ФИОДолжника_Между").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника)+" ");
				   КонецЕсли;	   
				   
				   //НомерКредитногоДоговора
				   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора")  Тогда
					       MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
					КонецЕсли;   
					   
				   //ДатаКредитногоДоговора
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора")  Тогда
					     MSWordDoc.Bookmarks("ДатаКредитногоДоговора").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаКредитногоДоговора;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;

				   
				   //ПервоначальныйКредитор_заключенной
				     Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_заключенной")  Тогда
					      MSWordDoc.Bookmarks("ПервоначальныйКредитор_заключенной").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					 КонецЕсли;
				   
				   //СуммаКредита
				   Если  MSWordDoc.Bookmarks.Exists("СуммаКредита")  Тогда
					         MSWordDoc.Bookmarks("СуммаКредита").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.СуммаКредита);
					КонецЕсли;   
				   
				   //ДатаЦессии
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии")  Тогда
					        MSWordDoc.Bookmarks("ДатаЦессии").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаДоговораЦессии;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   длина=СтрДлина(дат);
					   дат=Лев(дат,длина-2);
					   MSWordDoc.Application.Selection.TypeText(дат);
					КонецЕсли;   
					   
				   //ПервоначальныйКредитор_ДатаЦессии
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_ДатаЦессии")  Тогда
					         MSWordDoc.Bookmarks("ПервоначальныйКредитор_ДатаЦессии").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					КонецЕсли;   
					   
				   //НомерЦессии
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии")  Тогда
					      MSWordDoc.Bookmarks("НомерЦессии").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
					КонецЕсли;   
				   
				   //ДатаЦессии_БылЗаключен
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_БылЗаключен")  Тогда
					       MSWordDoc.Bookmarks("ДатаЦессии_БылЗаключен").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаДоговораЦессии;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
                   КонецЕсли;
				   
				   //НомерКредитногоДоговора_кредитномудого
				   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_кредитномудого")  Тогда
					         MSWordDoc.Bookmarks("НомерКредитногоДоговора_кредитномудого").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				   КонецЕсли;	   
				   
				   //ДатаКредитногоДоговора_кредитномудог
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_кредитномудог")  Тогда
					       MSWordDoc.Bookmarks("ДатаКредитногоДоговора_кредитномудог").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаКредитногоДоговора;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				 КонецЕсли;

				   
				   //ПервоначальныйКредитор_заключенного_межд
				   
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_заключенного_межд")  Тогда

					        MSWordDoc.Bookmarks("ПервоначальныйКредитор_заключенного_межд").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					   
				   КонецЕсли;
				   
				   //ФИОДолжника_заключенного_между
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_заключенного_между")  Тогда
					      MSWordDoc.Bookmarks("ФИОДолжника_заключенного_между").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника)+" ");
					 КонецЕсли; 

				   //ДатаЦессии_уступаемых
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_уступаемых")  Тогда
					         MSWordDoc.Bookmarks("ДатаЦессии_уступаемых").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаДоговораЦессии;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
					КонецЕсли;

					   
					//ОбщаяСуммаЗадолженностиПоЦессии
					Если  MSWordDoc.Bookmarks.Exists("ОбщаяСуммаЗадолженностиПоЦессии")  Тогда
				       MSWordDoc.Bookmarks("ОбщаяСуммаЗадолженностиПоЦессии").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ОбщаяСуммаЗадолженностиПоДоговору);
					КонецЕсли;
					   
				   
				   //ОбщаяСуммаЗадолженностиПоЦессии_составля
				   Если  MSWordDoc.Bookmarks.Exists("ОбщаяСуммаЗадолженностиПоЦессии_составля")  Тогда
					    MSWordDoc.Bookmarks("ОбщаяСуммаЗадолженностиПоЦессии_составля").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ОбщаяСуммаЗадолженностиПоДоговору);
					КонецЕсли;   
					   
					   
				   //НомерКредитногоДоговора_выполнении
				   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_выполнении")  Тогда
					   MSWordDoc.Bookmarks("НомерКредитногоДоговора_выполнении").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
					 КонецЕсли;
				   
				   //ДатаКредитногоДоговора_выполнении
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_выполнении")  Тогда
				         MSWordDoc.Bookmarks("ДатаКредитногоДоговора_выполнении").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаКредитногоДоговора;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				    КонецЕсли;

				   
				   //ФИОДолжника_Прошу_выдать
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Прошу_выдать")  Тогда
				         MSWordDoc.Bookmarks("ФИОДолжника_Прошу_выдать").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника)+" ");
					КонецЕсли;   
					  
				   
					//ОбщаяСуммаЗадолженностиПоЦессии_Прошу
					Если  MSWordDoc.Bookmarks.Exists("ОбщаяСуммаЗадолженностиПоЦессии_Прошу")  Тогда
					  MSWordDoc.Bookmarks("ОбщаяСуммаЗадолженностиПоЦессии_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ОбщаяСуммаЗадолженностиПоДоговору);
					 КонецЕсли;
					   
				   //НомерКредитногоДоговора_Прошу
				    Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Прошу")  Тогда
					    MSWordDoc.Bookmarks("НомерКредитногоДоговора_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				   КонецЕсли; 
				   
				   
				    
							   //НомерКредитногоДоговора_кредитномудого0
							     Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_кредитномудого0")  Тогда
							         MSWordDoc.Bookmarks("НомерКредитногоДоговора_кредитномудого0").Select();
							   MSWordDoc.Application.Selection.Font.Color = 1;
			                   MSWordDoc.Application.Selection.TypeText(Объект.ПервоначальныйНомерКредитДоговора);
							   КонецЕсли;

				   
				   //ДатаКредитногоДоговора_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_Прошу")  Тогда
				          MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаКредитногоДоговора;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
                   КонецЕсли;
				   
				   //ПервоначальныйКредитор_Прошу
				    Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Прошу")  Тогда

					   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
				    КонецЕсли;
				   
				   //ФИОДолжника_Прошу_Взыскать
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Прошу_Взыскать")  Тогда
					   MSWordDoc.Bookmarks("ФИОДолжника_Прошу_Взыскать").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника)+" ");
				   КонецЕсли;	   
				   
				   //СуммаГоспошлины_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("СуммаГоспошлины_Прошу")  Тогда
				      MSWordDoc.Bookmarks("СуммаГоспошлины_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ГоспошлинаНаша);
					КонецЕсли; 
				   
				   //НомерКредитногоДоговора_Приложение
				   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Приложение")  Тогда
				      MSWordDoc.Bookmarks("НомерКредитногоДоговора_Приложение").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ПервоначальныйНомерКредитДоговора);
				   КонецЕсли; 	   
				   
				   //ДатаКредитногоДоговора_Приложение
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_Приложение")  Тогда
					   MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Приложение").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаКредитногоДоговора;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
					КонецЕсли;   


				   //НомерЦессии_Приложение
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии_Приложение")  Тогда
				          MSWordDoc.Bookmarks("НомерЦессии_Приложение").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
				   КонецЕсли;	   
					   
				   //ДатаЦессии_Приложение
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Приложение")  Тогда
				          MSWordDoc.Bookmarks("ДатаЦессии_Приложение").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаДоговораЦессии;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;

				   
				   //ДатаЦессии_Приложение_5
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Приложение_5")  Тогда
					    MSWordDoc.Bookmarks("ДатаЦессии_Приложение_5").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаДоговораЦессии;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				   КонецЕсли;	   

				   
					//ДатаЗаявления
					   //  MSWordDoc.Bookmarks("ДатаЗаявления").Select();
					   //MSWordDoc.Application.Selection.Font.Color = 1;
					   //датРож=ТекущаяДата();
					   //дат= Формат(датРож, "ДЛФ=ДД");
					   //MSWordDoc.Application.Selection.TypeText(дат);


				     MSWord.Visible=0;
						
						//MSWord.Activate();
						
					//ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".pdf";
					
					
				      имяД=Строка(Объект.Исполнитель)+"_ЗаявлениеОВыдачеСудебногоПриказа";

				 
				      ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				     	
				    	ВыбранныйФайл = Новый Файл(ИмяФайла);
				    	Если ВыбранныйФайл.Существует() Тогда
				    		
				    		УдалитьФайлы(ВыбранныйФайл);
				    		
				    	
				    	КонецЕсли; 

							

						
					MSWordDoc.SaveAs(ИмяФайла,16);
					
						
					MSWordDoc.Close(0);
						
						
						
					MSWord.Application.Quit();

				   

					
					двФайл = Новый ДвоичныеДанные(ИмяФайла);
					
					файлСтруктура.Вставить("ДвоичныеДанные",двФайл);
					файлСтруктура.Вставить("ИмяФайла",ИмяФайла);
					
					
					ВыбранныйФайл = Новый Файл(ИмяФайла);
					Если ВыбранныйФайл.Существует() Тогда
						
						УдалитьФайлы(ВыбранныйФайл);
						
					
					КонецЕсли; 

					
					
								   
				   

					 
					 
				 	
				 
				 Исключение
						   //MSWordDoc.Close(0);
					   
					   MSWord.Application.Quit();

					   
					    	Сообщить("Ошибка----- Заявление О Выдаче Судебного Приказа");
				            ТекстОшибки = ОписаниеОшибки();
				            Сообщить(ТекстОшибки);

					 
				 КонецПопытки;
				 
				 
			 КонецЕсли;	 
			
			 
		  Возврат файлСтруктура; 	 
			 
	
	
	
	
КонецФункции // ()

&НаСервере
Функция ПолучитьФайлЗаявлениеОВыдачеСудебногоПриказаИзХран()
	
	   Двоичные=Неопределено;

	
	   Если  Не ЗначениеЗаполнено(Объект.Шаблон) Тогда
	   
		   	    
			   НайтиШабл = Справочники.ШаблоныЮристы.НайтиПоНаименованию("ШаблонЗаявлениеОВыдачеСудебногоПриказа",ИСТИНА);
			 
			    
				 
				 Если НайтиШабл<>Неопределено Тогда
				 
				 	 Если НЕ НайтиШабл.ПУСТАЯ() Тогда  
		 
		        		Хран=НайтиШабл.ФайлШаблона;
		        		Двоичные=Хран.Получить(); 
		    			
		    		КонецЕсли;
					

			 
			 КонецЕсли; 

	   
	   Иначе
		   
		                об=Объект.Шаблон;
						
		    	   		Хран=об.ФайлШаблона;
		        		Двоичные=Хран.Получить(); 
		    			
		    			   
	   	
	   
	   КонецЕсли;  
	
	
	    	
			
	  Возврат Двоичные;		
	 

КонецФункции // ()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.БанкПервоначальногоКредитора<>"" Тогда
		Элементы.БанкПервоначальногоКредитора.Видимость=Истина;
		
		
	
	КонецЕсли;
	
	
КонецПроцедуры

		 


	  
	  
