
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должники.Ссылка КАК Ссылка,
		|	Должники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Должники КАК Должники
		|ГДЕ
		|	Должники.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка",Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	  номерД= НомераДоговоров(Выборка.Ссылка);
		   
	  СтрокаСписка=Строки[Выборка.Ссылка];	   
	  СтрокаСписка.Данные.НомерДоговора=номерД;
	  
		
	КонецЦикла;

	
 	  
	
	
КонецПроцедуры





&НаСервереБезКонтекста
Функция НомераДоговоров(долж) 
	
	номерД=""; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.НомерДоговора КАК НомерДоговора
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", долж);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		номерД=ВыборкаДетальныеЗаписи.НомерДоговора+" "+номерД;
		
		
	КонецЦикла;

  Возврат номерД;	
	
	
КонецФункции // ()



