
Процедура СкопироватьДокументыДолжнику() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 200
	               |	ЗаданияКПереносуДокументов.Объект КАК Объект,
	               |	ЗаданияКПереносуДокументов.ДатаПостановкиВочередь КАК ДатаПостановкиВочередь
	               |ИЗ
	               |	РегистрСведений.ЗаданияКПереносуДокументов КАК ЗаданияКПереносуДокументов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПостановкиВочередь";
	Запрос = Новый Запрос (ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Объект;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Должник") Тогда
			Должник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Должник");
			Если ЗначениеЗаполнено(Должник) Тогда
				МассивФайлов = Новый Массив;
				ПрисоединенныеФайлы.ПолучитьПрикрепленныеФайлыКОбъекту(Объект, МассивФайлов);
				МассивФайловДолжника = Новый Массив;
				ПрисоединенныеФайлы.ПолучитьПрикрепленныеФайлыКОбъекту(Объект, МассивФайловДолжника);
				Для Каждого ПрисоединенныйФайл Из МассивФайлов Цикл
					Для Каждого ФайлДолжника Из МассивФайловДолжника Цикл
						Если ФайлДолжника.ПутьКФайлу = ПрисоединенныйФайл.ПутьКФайлу И
							ФайлДолжника.Том = ПрисоединенныйФайл.Том Тогда
							Продолжить;
						КонецЕсли;
					КонецЦикла;
					
					НоваяЗаписьФайла = ПрисоединенныйФайл.Скопировать();
					НоваяЗаписьФайла.ВладелецФайла = Должник;
					НоваяЗаписьФайла.Записать();
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Набор = РегистрыСведений.ЗаданияКПереносуДокументов.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Объект);
		Набор.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры