Функция глПредставлениеПодтверждения(Значение) Экспорт

	Если Значение = ПредопределенноеЗначение("Перечисление.ПодтверждениеДанных.Верные") Тогда
		Представление = "[В]";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ПодтверждениеДанных.Неверные") Тогда
		Представление = "[х]";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ПодтверждениеДанных.НеПодтвержденные") Тогда
		Представление = "[?]";
	Иначе
		Представление = "[?]";
	КонецЕсли; 
	
	Возврат Представление;
КонецФункции // Подтверждение()