Процедура ОбработкаПроведения(Отказ, Режим)
	Отказ = ДоступностьИзмененийПоДатеЗапрета(Дата);
	Для Каждого ТекСтрокаДолжники Из Должники Цикл
		// регистр ПривязкаСотрудник 
		Движение = Движения.ПривязкаСотрудник.Добавить();
		Движение.Период 	= Дата;
		Движение.Должник 	= ТекСтрокаДолжники.Должник;
		Движение.Сотрудник 	= ТекСтрокаДолжники.Сотрудник;
		Движение.СотрМенеджер 	= ТекСтрокаДолжники.Сотрудник;
		
		// регистр ПривязкаОтдел 
		Движение = Движения.ПривязкаОтдел.Добавить();
		Движение.Период 		= Дата;
		Движение.Должник 		= ТекСтрокаДолжники.Должник;
		Движение.Отдел 			= ТекСтрокаДолжники.Отдел;
		Если ТекСтрокаДолжники.Отдел.РольОтдела = Перечисления.РольОтдела.Архив Тогда
			Движение.СвободныйПул = Ложь;
		ИначеЕсли ТекСтрокаДолжники.Сотрудник.Пустая() Тогда
			Движение.СвободныйПул = Истина;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

