
&НаКлиенте
Процедура НаименованиеДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	
	 СтандартнаяОбработка=Ложь;
	 ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораНаименования",ЭтаФорма);
	 
	 ОткрытьФорму("Справочник.НазванияДокументов.Форма.ФормаВыбораПолноеНазвание",,ЭтаФорма,,,,ОповещениеОЗакрытии); 

	 
КонецПроцедуры



&НаКлиенте
Процедура ДанныеВыбораНаименования(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	Если РезультатЗакрытия= Неопределено Тогда
	     Возврат;
		
	
	Иначе

		  
		   
		   
		   НаименованиеДокумента= РезультатЗакрытия.ПолноеНаименование;
		   ШифрДокумента=РезультатЗакрытия.ШифрНазвания;
			
		
	КонецЕсли;

	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ЭтаФорма.Закрыть();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	струтураДанные=Новый Структура;
	
	
	струтураДанные.Вставить("НаименованиеДокумента",НаименованиеДокумента);
	струтураДанные.Вставить("ШифрДокумента",ШифрДокумента);
	
	
	ОповеститьОВыборе(струтураДанные);
	
	
	
	
	
КонецПроцедуры
 
 
