
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	  спрОтделСудебнаяСтадия=Справочники.Отделы.НайтиПоНаименованию("Судебная стадия",Истина);
	
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗадачаПривязкаДолжника.Номер КАК Номер,
				|	ЗадачаПривязкаДолжника.Дата КАК Дата,
				|	ЗадачаПривязкаДолжника.БизнесПроцесс КАК БизнесПроцесс,
				|	ЗадачаПривязкаДолжника.Сотрудник КАК Сотрудник,
				|	ЗадачаПривязкаДолжника.Отдел КАК Отдел,
				|	ЗадачаПривязкаДолжника.Ссылка КАК Задача,
				|	ЗадачаПривязкаДолжника.Выполнена КАК Выполнена
				|ИЗ
				|	Задача.ЗадачаПривязкаДолжника КАК ЗадачаПривязкаДолжника
				|ГДЕ
				|	ЗадачаПривязкаДолжника.БизнесПроцесс.ОтделРабота = &ОтделРабота";
			
			Запрос.УстановитьПараметр("ОтделРабота", спрОтделСудебнаяСтадия);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА




	
	
КонецПроцедуры
