
&НаКлиенте
Процедура УдалитьВСправочникеДопДанные(Команда)
	
	 УдалитьНаСервере(Объект.Реестр);
	 
	 Сообщить("Ок");
	
КонецПроцедуры


&НаСервере
Процедура УдалитьНаСервере(реестр)

					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	РеестрДолжники.Должник КАК Должник,
						|	РеестрДолжники.Договор КАК Договор
						|ИЗ
						|	Документ.Реестр.Должники КАК РеестрДолжники
						|ГДЕ
						|	РеестрДолжники.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", реестр);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				 	
						Запись=Объект.ТЧ.Добавить();
						
						Запись.Должник=ВыборкаДетальныеЗаписи.Должник;
						Запись.Договор=ВыборкаДетальныеЗаписи.Договор;
	
						
						
					КонецЦикла;
					
					
					Для каждого стр  Из Объект.ТЧ  Цикл
						
						  УдалитьСпрДополнительныеДанные(стр.Должник);
						  
						  УдалитьТелефоны(стр.Должник);
						  
						  УдалитьАдреса(стр.Должник);

					
					КонецЦикла;
					
	

				КонецПроцедуры
				
&НаСервере				
Процедура УдалитьАдреса(долж)

	     ТемпАдреса.Очистить();
		 
		  	
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	Адреса.Ссылка КАК Ссылка,
							|	Адреса.Тип КАК Тип,
							|	Адреса.Адрес КАК Адрес
							|ИЗ
							|	Справочник.Адреса КАК Адреса
							|ГДЕ
							|	Адреса.Владелец = &Владелец";
						
						Запрос.УстановитьПараметр("Владелец", долж);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							записьА=ТемпАдреса.Добавить();
							
							записьА.Тип=ВыборкаДетальныеЗаписи.Тип;
							записьА.Адрес=ВыборкаДетальныеЗаписи.Адрес;
							записьА.СсылкаАдрес=ВыборкаДетальныеЗаписи.Ссылка;
							
							
						КонецЦикла;
						
						
						
						Для каждого стр Из ТемпАдреса Цикл
							
							
							    ПоменятьДвойныеАдреса(стр.Адрес,стр.Тип );
							
						
						КонецЦикла;
		 
	 
	                    УдалитьВсеАдреса();
	

КонецПроцедуры

&НаСервере
Процедура УдалитьВсеАдреса()

	
	   	Для каждого стр Из АдресаДляУдаления  Цикл

			
						        	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Адреса.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Адреса КАК Адреса
					|ГДЕ
					|	Адреса.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", стр.АдресСсылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					        элемСправ= ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
										  
							элемСправ.Удалить();
										  

					
					
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

			
			
			
			
	    КонецЦикла;
	

КонецПроцедуры

					
					
				

&НаСервере
Процедура ПоменятьДвойныеАдреса(адрес, тип)

	      Т3= ТемпАдреса.Выгрузить();

		  
		       				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
				    | *	
					|ПОМЕСТИТЬ ТВ_ТВ
					|ИЗ
					|	&Т3 КАК Т3
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТВ_ТВ.Тип КАК Тип,
					|	ТВ_ТВ.Адрес КАК Адрес,
					|	ТВ_ТВ.СсылкаАдрес КАК СсылкаАдрес
					|ИЗ
					|	ТВ_ТВ КАК ТВ_ТВ
					|ГДЕ
					|	ТВ_ТВ.Тип = &Тип И ТВ_ТВ.Адрес=&Адрес
					|";
				
				Запрос.УстановитьПараметр("Тип",тип);
				
				Запрос.УстановитьПараметр("Адрес", адрес);
			    Запрос.УстановитьПараметр("Т3", Т3);

				
				 массивНомерстр=Новый Массив;

				
				РезультатЗапроса = Запрос.Выполнить();

				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		       
				Если ВыборкаДетальныеЗаписи.Количество()>1 Тогда
				
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					         ВыборкаДетальныеЗаписи.Следующий();
							 
							 массивНомерстр.Добавить(ВыборкаДетальныеЗаписи.СсылкаАдрес);
					
				     КонецЦикла;

				
				КонецЕсли;

				Для каждого стр Из массивНомерстр Цикл

					 НулевыеСтроки = ТемпАдреса.НайтиСтроки(Новый Структура("СсылкаАдрес",стр));

					 Для каждого стрД Из НулевыеСтроки Цикл
     
						 
						 
						    записьТТ= АдресаДляУдаления.Добавить(); 
							записьТТ.АдресСсылка=стрД.СсылкаАдрес;
							
						   	ТемпАдреса.Удалить(стрД);
			 
						 
					 КонецЦикла;
					
    			КонецЦикла;

				
	
	

КонецПроцедуры


				
				
&НаСервере
Процедура  УдалитьТелефоны(долж)

	  ТемпТелефоны.Очистить();
	
	  
							    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
							// Данный фрагмент построен конструктором.
							// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
							
							Запрос = Новый Запрос;
							Запрос.Текст = 
								"ВЫБРАТЬ
								|	Телефоны.Ссылка КАК Ссылка,
								|	Телефоны.Код КАК Код,
								|	Телефоны.Наименование КАК Наименование,
								|	Телефоны.Подтверждение КАК Подтверждение,
								|	Телефоны.Тип КАК Тип,
								|	Телефоны.Номер КАК Номер
								|ИЗ
								|	Справочник.Телефоны КАК Телефоны
								|ГДЕ
								|	Телефоны.Владелец = &Владелец";
							
							Запрос.УстановитьПараметр("Владелец", долж);
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								// Вставить обработку выборки ВыборкаДетальныеЗаписи
								 записьТ=ТемпТелефоны.Добавить();
								 записьТ.Тип=ВыборкаДетальныеЗаписи.Тип;
								 
								 записьТ.Номер=ВыборкаДетальныеЗаписи.Номер;
								 записьТ.Подтверждение=ВыборкаДетальныеЗаписи.Подтверждение;
								 записьТ.НаименованиеСтр=ВыборкаДетальныеЗаписи.Наименование;
								 записьТ.Код=ВыборкаДетальныеЗаписи.Код;
								 записьТ.СсылкаТел=ВыборкаДетальныеЗаписи.Ссылка;
								 
								
							КонецЦикла;
							
							//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

							 Для каждого стр Из ТемпТелефоны  Цикл
						 
								   ПометитьДвойныеТелефоны(стр.Номер,стр.Тип);
					 	
					 
					         КонецЦикла;
  
							
							УдалитьВсеТелефоныДолж(долж);
							
							
							

КонецПроцедуры


&НаСервере
Процедура ПометитьДвойныеТелефоны(номер, типт)
	
	            Т3= ТемпТелефоны.Выгрузить();

			  				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
				    | *	
					|ПОМЕСТИТЬ ТВ_ТВ
					|ИЗ
					|	&Т3 КАК Т3
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТВ_ТВ.Тип КАК Тип,
					|	ТВ_ТВ.Код КАК Код,
					|	ТВ_ТВ.СсылкаТел КАК СсылкаТел,
					|	ТВ_ТВ.Номер КАК Номер
					|ИЗ
					|	ТВ_ТВ КАК ТВ_ТВ
					|ГДЕ
					|	ТВ_ТВ.Тип = &Тип И ТВ_ТВ.Номер=&Номер
					|";
				
				Запрос.УстановитьПараметр("Тип",типт);
				
				Запрос.УстановитьПараметр("Номер", номер);
			    Запрос.УстановитьПараметр("Т3", Т3);

				
				 массивНомерстр=Новый Массив;

				
				РезультатЗапроса = Запрос.Выполнить();

				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

				Если ВыборкаДетальныеЗаписи.Количество()>1 Тогда
				
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					         ВыборкаДетальныеЗаписи.Следующий();
							 
							 массивНомерстр.Добавить(ВыборкаДетальныеЗаписи.Код);
					
					  
					
				     КонецЦикла;

				
				КонецЕсли;
				

				
				Для каждого стр Из массивНомерстр Цикл
				
    				   НулевыеСтроки = ТемпТелефоны.НайтиСтроки(Новый Структура("Код",стр));
					   
					   Для каждого стрД Из НулевыеСтроки Цикл
						   
						     Если ЕстьлиТакойТелефонВКонтактах(стрД.СсылкаТел) Тогда
								записьТ=ТелефоныВКонтактах.Добавить();
								записьТ.СсылкаТел=стрД.СсылкаТел;
								записьТ.Номер=стрД.Номер;
							 
							 КонецЕсли;
							 
							 
						 	записьТТ= ТелефоныДляУдаления.Добавить(); 
							записьТТ.СсылкаТел=стрД.СсылкаТел;
							
							
						   	ТемпТелефоны.Удалить(стрД);
							   
							   
					   КонецЦикла;
					   
					     
	  
					   
				КонецЦикла;

				
			  
	

КонецПроцедуры
			
&НаСервере
Функция ЕстьлиТакойТелефонВКонтактах(ссылкаТ)
       телвКонтактахЕсть=Ложь;
	
	      	
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	КонтактТелефоны.Телефон.Номер КАК ТелефонНомер,
						|	КонтактТелефоны.Ссылка КАК СсылкаКонтакт,
						|	КонтактТелефоны.Телефон.Ссылка КАК ТелефонСсылка
						|ИЗ
						|	Документ.Контакт.Телефоны КАК КонтактТелефоны
						|ГДЕ
						|	КонтактТелефоны.Телефон.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", ссылкаТ);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					      телвКонтактахЕсть=Истина;
						
					
					КонецЕсли;
					
					//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
					//КонецЦикла;
					//
					
					
					
					
					
					
	   Возврат  телвКонтактахЕсть;

КонецФункции // ()


			



&НаСервере
Процедура УдалитьСпрДополнительныеДанные(долж)
	
	   
	
	  ТемпДопДанные.Очистить();
	
					         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ДополнительныеДанные.Ссылка КАК Ссылка,
						|	ДополнительныеДанные.Код КАК Код,
						|	ДополнительныеДанные.Наименование КАК Наименование,
						|	ДополнительныеДанные.Реквизит КАК Реквизит
						|ИЗ
						|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
						|ГДЕ
						|	ДополнительныеДанные.Владелец = &Владелец";
					
					Запрос.УстановитьПараметр("Владелец", долж);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						
					     записьТ=ТемпДопДанные.Добавить();
						 записьТ.РеквизитДопДанные= ВыборкаДетальныеЗаписи.Реквизит;
						 
						 записьТ.НаименованиеСтр=ВыборкаДетальныеЗаписи.Наименование;
						 
						 записьТ.Код=ВыборкаДетальныеЗаписи.Код;
						
						
					КонецЦикла;
					
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

					
					
					 Для каждого стр Из ТемпДопДанные  Цикл
						 
						      ПометитьДвойные(стр.РеквизитДопДанные,стр.НаименованиеСтр);
					 	
					 
					 КонецЦикла;
					
					
					 УдалитьВсеДопДанныеДолж(долж);
					 
					 
					 
					 Для каждого стр Из ТемпДопДанные Цикл
					 
						   спрЭлемент=Справочники.ДополнительныеДанные.СоздатьЭлемент();
						   
						   спрЭлемент.Владелец=долж;
						   
						   спрЭлемент.Реквизит=стр.РеквизитДопДанные;
						   
						   спрЭлемент.Наименование=стр.НаименованиеСтр;
						   
						   спрЭлемент.Записать();
						 
					 
					 КонецЦикла;
					 
					 
											
					
	

КонецПроцедуры
					

&НаСервере
Процедура УдалитьВсеТелефоныДолж(долж)

  	         массивСсылок=Новый массив;
			 
						//Запрос = Новый Запрос;
						////Запрос.Текст = 
						//	"ВЫБРАТЬ
						//	|	Телефоны.Ссылка КАК Ссылка
						//	|ИЗ
						//	|	Справочник.Телефоны КАК Телефоны
						//	|ГДЕ
						//	|	Телефоны.Владелец = &Владелец";
						//
						//Запрос.УстановитьПараметр("Владелец", долж);
						//
						//РезультатЗапроса = Запрос.Выполнить();
						//
						//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						//
						//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

						//		массивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);

						//	
						//КонецЦикла;
						//
						
						
						
						
				// Поменять в контактах телефон
    			Если ТелефоныВКонтактах.Количество()>0 Тогда
					
					Для каждого стрк  Из ТелефоныВКонтактах  Цикл
					
						  стДубль= ТемпТелефоны.НайтиСтроки(Новый Структура("Номер",стрк.Номер));
						  
						  Для каждого стрД Из стДубль Цикл
							  
							   ПоменятьНомерТелефонаВКонтакте(стрк.СсылкаТел, стрД.СсылкаТел);
							  
						  КонецЦикла;	  
						  
						     
		
				
				    КонецЦикла;

					
				
				КонецЕсли;
				
				
						
						
						
						
						
	        	Для каждого стр Из ТелефоныДляУдаления  Цикл
					
													            	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
									// Данный фрагмент построен конструктором.
									// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
									
									Запрос = Новый Запрос;
									Запрос.Текст = 
										"ВЫБРАТЬ
										|	Телефоны.Ссылка КАК Ссылка
										|ИЗ
										|	Справочник.Телефоны КАК Телефоны
										|ГДЕ
										|	Телефоны.Ссылка = &Ссылка";
									
									Запрос.УстановитьПараметр("Ссылка", стр.СсылкаТел);
									
									РезультатЗапроса = Запрос.Выполнить();
									
									ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
									
									Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
										// Вставить обработку выборки ВыборкаДетальныеЗаписи
										
										  элемСправ= ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
										  
										  элемСправ.Удалить();
										  
										
									КонецЦикла;
									
									//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

					//			 элемСправ= стр.ПолучитьОбъект();					
					//
					//             элемСправ.Удалить();
					//
					
					
					
				
				КонецЦикла;

			 
			 
	
КонецПроцедуры

&НаСервере
Процедура ПоменятьНомерТелефонаВКонтакте(ссылкаТелБыл, новаяссылка)

	    массивСсылок=Новый Массив;
	
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	КонтактТелефоны.Ссылка КАК Ссылка,
							|	КонтактТелефоны.Телефон КАК Телефон
							|ИЗ
							|	Документ.Контакт.Телефоны КАК КонтактТелефоны
							|ГДЕ
							|	КонтактТелефоны.Телефон = &Телефон";
						
						Запрос.УстановитьПараметр("Телефон", ссылкаТелБыл);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							  
							  массивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
							
							
						КонецЦикла;
						
						
						
						Для каждого стрдок  Из массивСсылок Цикл
							
							док=стрдок.ПолучитьОбъект();
							
							массивСтрок = док.Телефоны.НайтиСтроки(Новый Структура("Телефон",ссылкаТелБыл));
							
							Для каждого стрТел  Из массивСтрок Цикл
								
								стрТел.Телефон= новаяссылка;
								
							
							КонецЦикла;
							
							док.Записать();
							
							
							
						
						КонецЦикла;
						
						
						
						
	

КонецПроцедуры



&НаСервере
Процедура УдалитьВсеДопДанныеДолж(долж)

	      массивСсылок=Новый массив;
	
				      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ДополнительныеДанные.Ссылка КАК Ссылка,
					|	ДополнительныеДанные.Владелец КАК Владелец
					|ИЗ
					|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
					|ГДЕ
					|	ДополнительныеДанные.Владелец = &Владелец";
				
				Запрос.УстановитьПараметр("Владелец", долж);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					
					массивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
					
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
				Для каждого стр Из массивСсылок  Цикл
					элемСправ= стр.ПолучитьОбъект();					
					
					элемСправ.Удалить();
				
				КонецЦикла;
				
				
	
КонецПроцедуры




&НаСервере
Процедура ПометитьДвойные(рек, наим)

	
					Т3= ТемпДопДанные.Выгрузить();
									

								
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
				    | *	
					|ПОМЕСТИТЬ ТВ_ТВ
					|ИЗ
					|	&ТЗ КАК ТЗ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТВ_ТВ.РеквизитДопДанные КАК РеквизитДопДанные,
					|	ТВ_ТВ.Код КАК Код,
					|	ТВ_ТВ.НаименованиеСтр КАК НаименованиеСтр
					|ИЗ
					|	ТВ_ТВ КАК ТВ_ТВ
					|ГДЕ
					|	ТВ_ТВ.НаименованиеСтр = &Имя И ТВ_ТВ.РеквизитДопДанные=&РеквизитДопДанные
					|";
				
				Запрос.УстановитьПараметр("Имя",наим);
				
				Запрос.УстановитьПараметр("РеквизитДопДанные", рек);
			    Запрос.УстановитьПараметр("ТЗ", Т3);

				
				 массивНомерстр=Новый Массив;

				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

				Если ВыборкаДетальныеЗаписи.Количество()>1 Тогда
				
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					         ВыборкаДетальныеЗаписи.Следующий();
							 массивНомерстр.Добавить(ВыборкаДетальныеЗаписи.Код);
					
					  
					
				     КонецЦикла;

				
				КонецЕсли;
				
				
				Для каждого стр Из массивНомерстр Цикл
				
    				   НулевыеСтроки = ТемпДопДанные.НайтиСтроки(Новый Структура("Код",стр));
					   
					   Для каждого стрД Из НулевыеСтроки Цикл
					   
					   	     ТемпДопДанные.Удалить(стрД);
					   
					   КонецЦикла;
					   
					     
	  
					   
				КонецЦикла;
				
				
			
	
	
	

КонецПроцедуры

					
				
				
				
				
				
				
