
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		ТекЗапись.ПолноеНаименование = СтрШаблон("%1 %2", ТекЗапись.НазваниеДокумента, ТекЗапись.РасширениеНазвания);
		Если ЗначениеЗаполнено(ТекЗапись.ШифрНазвания) = Ложь Тогда
			ТекЗапись.ШифрНазвания = ПолучитьМаксимальныйШифр();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМаксимальныйШифр()
	
	Результат = 0;
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ШаблоныНазванийДокументов.ШифрНазвания КАК ШифрНазвания
	               |ИЗ
	               |	РегистрСведений.ШаблоныНазванийДокументов КАК ШаблоныНазванийДокументов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ШифрНазвания УБЫВ";
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ШифрНазвания;
	КонецЕсли;
	
	Возврат Результат + 1;
	
КонецФункции
