
&НаСервере
Процедура УбратьВопросыИзАдресаНаСервере()
	// Вставить содержимое обработчика.
	
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адреса.Наименование КАК Наименование,
		|	Адреса.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Адреса КАК Адреса";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		  стрновая=УбратьВопросИзСтроки(ВыборкаДетальныеЗаписи.Наименование);
		 		  
		   ЗаменитьНаимменование(ВыборкаДетальныеЗаписи.Ссылка, стрновая);

		 
		  
		  
		  
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьНаимменование(ссылкаОб, стр)

	      об=ссылкаОб.ПолучитьОбъект();
		  
		  об.Наименование=стр;
		  
		  об.Записать();

	     

КонецПроцедуры




&НаСервере
Функция УбратьВопросИзСтроки(стр)

	  инд=СтрНайти(стр,"[?]",НаправлениеПоиска.СНачала);
	  
	  длинастр=СтрДлина(стр);
	  
	  стрновая= Прав(стр,длинастр-3-инд);
	  
	  Возврат стрновая;
	  
КонецФункции // ()



&НаКлиенте
Процедура УбратьВопросыИзАдреса(Команда)
	УбратьВопросыИзАдресаНаСервере();
	Сообщить("Ок");
	
КонецПроцедуры
