
&НаСервере
Процедура ЗагрузитьНаСервере()
	
	 перОбработан=Перечисления.РезультатЗапросаВФССП.Обработан;
	 
	 
	            	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросывФССПдляРеестра.Должник КАК Должник,
		|	ЗапросывФССПдляРеестра.КЗ КАК КЗ,
		|	ЗапросывФССПдляРеестра.Ошибка_запрос КАК Ошибка_запрос,
		|	ЗапросывФССПдляРеестра.ЗапросПослан КАК ЗапросПослан
		|ИЗ
		|	РегистрСведений.ЗапросывФССПдляРеестра КАК ЗапросывФССПдляРеестра
		|ГДЕ
		|	ЗапросывФССПдляРеестра.КЗ = &КЗ
		|	И ЗапросывФССПдляРеестра.ЗапросПослан <> &Статус";
	
	Запрос.УстановитьПараметр("КЗ", 1);
	Запрос.УстановитьПараметр("Статус", перОбработан);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		    стрРег= РегионКод (ВыборкаДетальныеЗаписи.Должник);
			Запись=ТЧ.Добавить();
			Запись.Должник=ВыборкаДетальныеЗаписи.Должник;
			
			Запись.Статус=ВыборкаДетальныеЗаписи.ЗапросПослан;
			Запись.Регион= стрРег["СсылкаРегион"];
			Запись.КодРегиона=стрРег["КодРегион"];
			Запись.ОшибкаЗапрос=ВыборкаДетальныеЗаписи.Ошибка_запрос;
			
			
		
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
КонецПроцедуры

&НаСервере
Функция РегионКод (долж)

	стрРегион=Новый Структура;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Регионы.КодРегионаФССП КАК КодРегионаФССП,
		|	Регионы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Должники КАК Должники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Регионы КАК Регионы
		|		ПО Должники.Регион = Регионы.Ссылка
		|ГДЕ
		|	Должники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", долж);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 стрРегион.Вставить("СсылкаРегион",ВыборкаДетальныеЗаписи.Ссылка);
		 стрРегион.Вставить("КодРегион",ВыборкаДетальныеЗаписи.КодРегионаФССП);
		 
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


   Возврат 	стрРегион;
	

КонецФункции // ()




&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьНаСервере()
	
	   Для каждого стр Из ТЧ  Цикл
		   
		      Если стр.КодРегиона<>"" Тогда
				  
				    ПоменятьВРеестре(стр.Должник);
					
					
			  
			  КонецЕсли;
	   	
	   
	   КонецЦикла;
	
	   Сообщить("Ок");
	
	
 КонецПроцедуры
 
 
 &НаСервере
 Процедура ПоменятьВРеестре(долж)
	 
	    
	 
	   НаборЗаписей=РегистрыСведений.ЗапросывФССПдляРеестра.СоздатьНаборЗаписей();
	   
	   НаборЗаписей.Отбор.Должник.Установить(долж);
	   
	   НаборЗаписей.Прочитать();
	   
	   Для каждого запись  Из НаборЗаписей Цикл
		   
		   запись.КЗ=0; 
	   	   запись.ЗапросПослан=Перечисления.РезультатЗапросаВФССП.ПослатьЗапрос; 
		   
		   
	   КонецЦикла;
	   
	   НаборЗаписей.Записать();
	   
 
 КонецПроцедуры
 
   

&НаКлиенте
Процедура Обработать(Команда)
	ОбработатьНаСервере();
КонецПроцедуры
