&НаКлиенте
Процедура ОбработкаКомандыФормы(Команда)
	Если Команда.Имя = "Свернуть" Тогда
		Свернуть();
	ИначеЕсли Команда.Имя = "СвернутьПоДолжникам" Тогда
		СвернутьПоДолжникам();
	КонецЕсли;
КонецПроцедуры

Процедура Свернуть()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Должник, Сотрудник", "");
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

Процедура СвернутьПоДолжникам()
	Об = РеквизитФормыВЗначение("Объект");
	
	ТЗ = Об.Должники.Выгрузить();
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.ЗаполнитьЗначения(1, "Количество");
	ТЗ.Свернуть("Должник", "Количество");
	
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Должник", СтрокаТЗ.Должник);
		НайденныеСтроки = Об.Должники.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
			СтрокаДолжники.Контроль = СтрокаТЗ.Количество;
		КонецЦикла; 
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры
