
&НаКлиенте
Процедура Старт(Команда)
	// Вставить содержимое обработчика.
	
	УстановитьКодФССП(); 
	Сообщить("Ок");
	
КонецПроцедуры



&НаСервере
Процедура УстановитьКодФССП ()

		// пройдусь по справочнику регионы
		
					
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Регионы.Ссылка КАК Ссылка,
					|	Регионы.Наименование КАК Наименование,
					|	Регионы.КодРегионаФССП КАК КодРегионаФССП,
					|	Регионы.СинонимФСПП КАК СинонимФСПП
					|ИЗ
					|	Справочник.Регионы КАК Регионы";
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаРегионы = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаРегионы.Следующий() Цикл
					
					   СтрРегион=ВыборкаРегионы.Наименование;

					     // Найду код  в Коды ФССП

						  СтрКодФССП="";
							
						Запрос2 = Новый Запрос;
						Запрос2.Текст = 
							"ВЫБРАТЬ
							|	КодыРегионовФССП.КодРегионаФССП КАК КодРегионаФССП,
							|	КодыРегионовФССП.Синоним КАК Синоним,
							|	КодыРегионовФССП.Наименование КАК Наименование
							|ИЗ
							|	Справочник.КодыРегионовФССП КАК КодыРегионовФССП";
						
						РезультатЗапроса2 = Запрос2.Выполнить();
						
						Выборка = РезультатЗапроса2.Выбрать();
						
						Пока Выборка.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							СтрКодФССП=Выборка.Синоним;
							
							индексстр=Найти(ВРег(СтрРегион), ВРег(СтрКодФССП));
							
							 Если индексстр<>0 Тогда
								 
								 
								 
								   ЗаписьСправочинка = ВыборкаРегионы.Ссылка.ПолучитьОбъект();
								   ЗаписьСправочинка.КодРегионаФССП=Выборка.КодРегионаФССП;
								   ЗаписьСправочинка.СинонимФСПП=Выборка.Синоним;
								   
								   ЗаписьСправочинка.Записать();
								 

								 								 
							 
							 КонецЕсли;  
							 
							 
							
							
						КонецЦикла;
  
						 
					
					
					
					
				КонецЦикла;
	
	
	
	

КонецПроцедуры

&НаКлиенте
Процедура Продолжение(Команда)
	// Вставить содержимое обработчика.
	
	//УстановитьКодФССППродолж();
	Сообщить("Ок");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКодФССППродолж()

		// пройдусь по справочнику регионы
		
					
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Регионы.Ссылка КАК Ссылка,
					|	Регионы.Наименование КАК Наименование,
					|	Регионы.КодРегионаФССП КАК КодРегионаФССП,
					|	Регионы.СинонимФСПП КАК СинонимФСПП
					|ИЗ
					|	Справочник.Регионы КАК Регионы";
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаРегионы = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаРегионы.Следующий() Цикл
					
					   СтрРегион=ВыборкаРегионы.Наименование;

					     // Найду код  в Коды ФССП

						  СтрКодФССП="";
							
						Запрос2 = Новый Запрос;
						Запрос2.Текст = 
							"ВЫБРАТЬ
							|	КодыРегионовФССП.КодРегионаФССП КАК КодРегионаФССП,
							|	КодыРегионовФССП.Синоним КАК Синоним,
							|	КодыРегионовФССП.Наименование КАК Наименование
							|ИЗ
							|	Справочник.КодыРегионовФССП КАК КодыРегионовФССП";
						
						РезультатЗапроса2 = Запрос2.Выполнить();
						
						Выборка = РезультатЗапроса2.Выбрать();
						
						Пока Выборка.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							СтрКодФССП=Лев(Выборка.Синоним,10);
							
							индексстр=Найти(ВРег(СтрРегион), ВРег(СтрКодФССП));
							
							 Если индексстр<>0 Тогда
								 
								 Если ВыборкаРегионы.КодРегионаФССП="" Тогда
									 
									 ЗаписьСправочинка = ВыборкаРегионы.Ссылка.ПолучитьОбъект();
										 
									 ЗаписьСправочинка.КодРегионаФССП=Выборка.КодРегионаФССП;
								     ЗаписьСправочинка.СинонимФСПП=Выборка.Синоним;
								   
								     ЗаписьСправочинка.Записать();

								 	
								 
								 КонецЕсли;
								 
								  								 

								 								 
							 
							 КонецЕсли;  
							 
							 
							
							
						КонецЦикла;
  
						 
					
					
					
					
				КонецЦикла;
	
	
	
	

КонецПроцедуры

&НаКлиенте
Процедура Продолжение8(Команда)
	
	// Вставить содержимое обработчика.
	
	    УстановитьКодФССППродолж8();
		
		Сообщить("Ок");

	
КонецПроцедуры


&НаСервере

Процедура УстановитьКодФССППродолж8()

		// пройдусь по справочнику регионы
		
					
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Регионы.Ссылка КАК Ссылка,
					|	Регионы.Наименование КАК Наименование,
					|	Регионы.КодРегионаФССП КАК КодРегионаФССП,
					|	Регионы.СинонимФСПП КАК СинонимФСПП
					|ИЗ
					|	Справочник.Регионы КАК Регионы";
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаРегионы = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаРегионы.Следующий() Цикл
					
					   СтрРегион=ВыборкаРегионы.Наименование;

					     // Найду код  в Коды ФССП

						  СтрКодФССП="";
							
						Запрос2 = Новый Запрос;
						Запрос2.Текст = 
							"ВЫБРАТЬ
							|	КодыРегионовФССП.КодРегионаФССП КАК КодРегионаФССП,
							|	КодыРегионовФССП.Синоним КАК Синоним,
							|	КодыРегионовФССП.Наименование КАК Наименование
							|ИЗ
							|	Справочник.КодыРегионовФССП КАК КодыРегионовФССП";
						
						РезультатЗапроса2 = Запрос2.Выполнить();
						
						Выборка = РезультатЗапроса2.Выбрать();
						
						Пока Выборка.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							СтрКодФССП=Лев(Выборка.Синоним,7);
							
							индексстр=Найти(ВРег(СтрРегион), ВРег(СтрКодФССП));
							
							 Если индексстр<>0 Тогда
								 
								 Если ВыборкаРегионы.КодРегионаФССП="" Тогда
									 
									 ЗаписьСправочинка = ВыборкаРегионы.Ссылка.ПолучитьОбъект();
										 
									 ЗаписьСправочинка.КодРегионаФССП=Выборка.КодРегионаФССП;
								     ЗаписьСправочинка.СинонимФСПП=Выборка.Синоним;
								   
								     ЗаписьСправочинка.Записать();

								 	
								 
								 КонецЕсли;
								 
								  								 

								 								 
							 
							 КонецЕсли;  
							 
							 
							
							
						КонецЦикла;
  
						 
					
					
					
					
				КонецЦикла;
	
	
	
	

КонецПроцедуры




