
&НаКлиенте
Процедура Сформировать(Команда)
	// Вставить содержимое обработчика.
	
	 ДвумМассив = Новый Массив;

	
      ДвумМассив= СформироватьНаСервере(Объект.Банк);
	 
	  
	  // Это должники с номером договора - ДвумМассив
	 
	  
	  

	  
	  //ТабЗначений.Колонки.Добавить("КолКод");
	  //ТабЗначений.Колонки.Добавить("КолНоменклатура");
	  //ТабЗначений.Колонки.Добавить("КолКоличество");
	  //
	  
	  
	  Для Каждого ЭлМассив из ДвумМассив Цикл
		  
		  
			 // найду все контакты за период  по должнику
		    
		  
			   
			   резКонт= НайтиСколькоКонтактов(ЭлМассив[0],Объект.ДатаНачала,Объект.ДатаКонец );
			   
			   стр= Объект.ТЧ.Добавить();
			   
			   
			   
			   //
			    стр.НомерДоговора=ЭлМассив[1];
			    стр.Должник=ЭлМассив[0];
			    стр.ЗвонокВсего=резКонт["ВсегоКонтактов"];
			    
			   
			    стр.ЗвонокУспешные=резКонт["ХорошихКонтактов"];
			   // 
			   // 
			    стр.Результат=резКонт["ПоследнийСтатус"];
			   // 
		  
				
				
			   
		  //Сообщить(Строка(ЭлМассив[0])+"-"+Строка(ЭлМассив[1]));
      КонецЦикла;
	   
	 
	   
	       Объект.ТЧ.Сортировать("Должник");
	 
	 
	 Сообщить("Ок");
	
КонецПроцедуры


&НаСервере
Функция НайтиСколькоКонтактов(долж,датнач,датак)

	
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Контакт.Статус КАК Статус,
	//	|	Контакт.Телефоны.(
	//	|		КОЛИЧЕСТВО(РезультатКонтакта) КАК РезультатКонтакта
	//	|	) КАК Телефоны
	//	|ИЗ
	//	|	Документ.Контакт КАК Контакт
	//	|ГДЕ
	//	|	Контакт.Дата МЕЖДУ &ДатаНачала И &ДатаКонец
	//	|	И Контакт.Должник = &Должник
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Контакт.Дата";
	//
	

	
	 резКонт = Новый Структура;
	 
	  //спрСтатусП1=Справочники.Статусы.НайтиПоНаименованию("Обещание оплатить",Истина);
	  
	  
	 
	 
	 спрСтатусП1=Справочники.Статусы.НайтиПоКоду("000000003",Истина);
	 
	 спрСтатусП2=Справочники.Статусы.НайтиПоКоду("000000009",Истина);
	 
	 спрСтатусП21=Справочники.Статусы.НайтиПоКоду("000000001",Истина);
	 
	 спрСтатусП3=Справочники.Статусы.НайтиПоНаименованию("Прогноз");
	 
	 спрСтатусП31=Справочники.Статусы.НайтиПоКоду("000000002",Истина);
	 
	 //спрСтатусП41=Справочники.Статусы.НайтиПоНаименованию("Оставлена информация",Истина);
	 
	 спрСтатусП4=Справочники.Статусы.НайтиПоКоду("000000005",Истина);
	 
	 хорКонтакт=0;
	 
	 всегоКонт=0;
	 
	 статусПосл=Неопределено;
	 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контакт.Статус КАК Статус
		|ИЗ
		|	Документ.Контакт КАК Контакт
		|ГДЕ
		|	Контакт.Дата МЕЖДУ &ДатаНачала И &ДатаКонец
		|	И Контакт.Должник = &Должник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контакт.Дата";
	
	
		
	Запрос.УстановитьПараметр("ДатаКонец", датак);
	Запрос.УстановитьПараметр("ДатаНачала", датнач);
	Запрос.УстановитьПараметр("Должник", долж);
	

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		  всегоКонт=всегоКонт+1;
		  
		 статусВ=ВыборкаДетальныеЗаписи.Статус;
		 
		 		 
		Если  (статусВ.Наименование=спрСтатусП1.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		КонецЕсли;

		 		 
		Если  (статусВ.Наименование=спрСтатусП2.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
		 
		 
	 	Если  (статусВ.Наименование=спрСтатусП21.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
	
		 
		 Если  (статусВ.Наименование=спрСтатусП3.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
		 
		 Если  (статусВ.Наименование=спрСтатусП31.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
		 
		 

		  Если  (статусВ.Наименование=спрСтатусП4.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
		
		
		 
				
		статусПосл=ВыборкаДетальныеЗаписи.Статус;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

      
        
	  резКонт.Вставить("ВсегоКонтактов",всегоКонт);
	  
	  резКонт.Вставить("ХорошихКонтактов", хорКонтакт);
	  
	  резКонт.Вставить("ПоследнийСтатус", статусПосл);
	  

	
	   Возврат резКонт;

КонецФункции // ()





&НаСервере
Функция СформироватьНаСервере(банк)

	     // Найти долж где банк - 
	
	
	     ДвумМассив = Новый Массив;
		
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Договоры.Владелец КАК Владелец,
			|	Договоры.НомерДоговора КАК НомерДоговора
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.Банк = &Банк";
		
		Запрос.УстановитьПараметр("Банк", банк);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
			
			ОднмМассив = Новый Массив(2);
			
			ОднмМассив[0] = ВыборкаДетальныеЗаписи.Владелец;
            ОднмМассив[1] = ВыборкаДетальныеЗаписи.НомерДоговора;
            ДвумМассив.Добавить(ОднмМассив);
			
			
			
		КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
		
		
		
		
		
		Возврат ДвумМассив;
		
		

КонецФункции // ()

&НаКлиенте
Процедура Печать(Команда)
	// Вставить содержимое обработчика.
	 ТабДокумент= ПолучитьМакетНаСервере();
	
     ТабДокумент.Показать("ОТЧЕТ АГЕНТА");

	
	Сообщить("Ок");
КонецПроцедуры
 



&НаСервере
Функция ПолучитьМакетНаСервере()
	
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ТолькоПросмотр=Истина;
    ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет =  ОтчетОбъект.ПолучитьМакет("Макет"); 
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ДатаНачала=Формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаКонец=Формат(Объект.ДатаКонец,"ДФ=dd.MM.yyyy");
	
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	
	
	
	Для каждого Стр  Из Объект.ТЧ  Цикл
		
		ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
		
		
		ОбластьСтрока.Параметры.НомерДоговора=Стр.НомерДоговора;
		ОбластьСтрока.Параметры.ФИО=Стр.Должник;
		ОбластьСтрока.Параметры.ЗвонокВсего=Стр.ЗвонокВсего;
		ОбластьСтрока.Параметры.ЗвонокУспешные=Стр.ЗвонокУспешные;
		ОбластьСтрока.Параметры.Результат=Стр.Результат;
		
		 ТабДокумент.Вывести(ОбластьСтрока);
	
	 КонецЦикла;
	 
	 
	
	
    ОбластьПодвал=Макет.ПолучитьОбласть("Подвал");
	
	
	ТабДокумент.Вывести(ОбластьПодвал);


	

    Возврат  ТабДокумент;
    
КонецФункции

	
	
	  
	
	

	



