
Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ДатаСоздания) = Ложь Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) = Ложь Тогда
		ДатаСоздания = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ТипДокумента = Перечисления.ТипДокумента.исх;
	
	Если ЗначениеЗаполнено(НазваниеДокументаСправочник) Тогда
		НазваниеДокумента = НазваниеДокументаСправочник.ПолноеНаименование;
	ИначеЕсли ЗначениеЗаполнено(НазваниеДокумента) Тогда
		НазваниеДокумента = НазваниеДокумента; // может это из загрузки
	Иначе
		НазваниеДокумента = Ссылка.Метаданные().Синоним;
	КонецЕсли;
	
	Наименование = СтрШаблон("%1 от %2", НазваниеДокумента, Формат(ДатаСоздания, "ДЛФ=D"));
	
КонецПроцедуры
