 //Перем массивБанкВыбор;




&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	  СтандартнаяОбработка=Ложь;
	  
	  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Вставить содержимое обработчика
	
	
	стрДанные = Элементы.Список.ВыделенныеСтроки;

	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Банкимассив",стрДанные);
	
	
	ОповеститьОВыборе(СписокПараметров);

	
	
КонецПроцедуры
