
&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	       ЗагрузитьФайлНаСервере();

		   Сообщить("ОК");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНаСервере()

	
	   ФайлДанных = ИмяФайла;
		
	   ФайлЕксел.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();

	   Для каждого стр Из ТаблицаЗначений Цикл
		   
		   
		     структураДолжник= НайтиДолжникДоговор(стр.НомерКредита, стр.ФИОКлиента);
			 
			 
 			  стрФайлыМассив= ПолучитьПрисоединенныеФайлы(структураДолжник.Должник);
			  
			   Shell = Новый COMОбъект("WScript.Shell");
               дирМоиД=Shell.SpecialFolders.Item("MyDocuments");

			  

			  Для каждого стрМассив  Из стрФайлыМассив  Цикл
				  
				  
				     инд=Найти(ВРег(стрМассив.Наименование),"ОПП");
					 
					 Если инд>0 Тогда
						 
						 строкаПуть= ПолучитьПутьКФайлу(стрМассив);
						 
						 имяФайлаСред=стрМассив.Наименование+"_"+стрМассив.ДатаСоздания+"_"+ структураДолжник.Должник;
						  имяФайлаСред=СтрЗаменить(имяФайлаСред,".","");
						  
						  имяФайлаСред=СтрЗаменить(имяФайлаСред," ","");
						  
						   имяФайлаСред=СтрЗаменить(имяФайлаСред,":","");
                             имяФайлаСред=СтрЗаменить(имяФайлаСред,",","");
						  
						  

						  имяфайлатемп="D:\Distr\1\"+имяФайлаСред+"."+стрМассив.Расширение;

					     
						Попытка
							
							
							Ф = Новый Файл(строкаПуть);
							
							  Ф.УстановитьТолькоЧтение(Ложь);
							
							
							 КопироватьФайл(строкаПуть,имяфайлатемп);
						
						Исключение
							 
							 ТекстОшибки = ОписаниеОшибки();  
							 Сообщить(ТекстОшибки);
							
						КонецПопытки;  
						  

		 	
					 
					 КонецЕсли;
					  
				
					
					
				КонецЦикла;	
		   
       	  		   
		   //стр.ФИОКлиента
		   //стр.НомерКредита
		   
		   
	   КонецЦикла;

			
			
			
	
	
КонецПроцедуры	


&НаСервере
Функция ПолучитьПутьКФайлу(ссылкаНаФайл)

	        об=ссылкаНаФайл.ПолучитьОбъект();
			
			   
			Возврат  об.Том.ПолныйПутьWindows+ об.ПутьКФайлу;

КонецФункции // ()



&НаСервере
Функция НайтиДолжникДоговор(дог, долж)

	  должСсылка=Неопределено;
      договорСсылка=Неопределено;

	  
	  данныеДогДолж=Новый Структура;
	  
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Должники.Ссылка КАК ДолжникСсылка,
						|	Договоры.Ссылка КАК ДоговорСсылка
						|ИЗ
						|	Справочник.Договоры КАК Договоры
						|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должники КАК Должники
						|		ПО Договоры.Владелец = Должники.Ссылка
						|ГДЕ
						|	Должники.Наименование = &Наименование
						|	И Договоры.НомерДоговора ПОДОБНО &НомерДоговора";
					
					Запрос.УстановитьПараметр("Наименование", долж);
					Запрос.УстановитьПараметр("НомерДоговора", СокрЛ(дог)+"%");

					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДолжникДоговор = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДолжникДоговор.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						должСсылка=ВыборкаДолжникДоговор.ДолжникСсылка;
						договорСсылка=ВыборкаДолжникДоговор.ДоговорСсылка;
					КонецЦикла;
					
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

					данныеДогДолж.Вставить("Должник",должСсылка);
					
					данныеДогДолж.Вставить("Договор",договорСсылка);
					
	
	      Возврат данныеДогДолж;

КонецФункции // ()





&НаСервере
Функция ПолучитьПрисоединенныеФайлы(владелецФайлов)

		//структураФайлы=Новый Структура;

		массивСтруктур=Новый Массив;
		
	
	         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОФайлах.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СведенияОФайлах КАК СведенияОФайлах
		|ГДЕ
		|	СведенияОФайлах.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", владелецФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи

		//структураФайлы.Вставить("Файл", ВыборкаДетальныеЗаписи.Файл);
		массивСтруктур.Добавить(ВыборкаДетальныеЗаписи.Файл);

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	 //ВыборкаДетальныеЗаписи.Файл.ПутьКФайлу
	
	
	 Возврат массивСтруктур;

КонецФункции // ()

   
   
	



&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	 ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры


