&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийМенеджер = Константы.Менеджер.Получить();
	Об = РеквизитФормыВЗначение("Объект");
	Если Об.ЭтоНовый() Тогда
		Объект.Менеджер = ТекущийМенеджер;
		Объект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли; 
	
	Элементы.Подписан.Доступность = ПараметрыСеанса.Администратор;
КонецПроцедуры

&НаКлиенте
Процедура ПередачаВСвободныйПулПриИзменении(Элемент)
	ОбновитьПредупреждение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредупреждение()
	Если Объект.ПередачаВСвободныйПул Тогда
		Текст = "Внимание! При передаче в свободный пул будут сняты все текущие привязки должников.";
	Иначе	
		Текст = "";
	КонецЕсли; 
	
	Элементы.НадписьПредупреждение.Заголовок = Текст;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДолжников(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТЧДолжники", ЭтотОбъект);	
	ОткрытьФорму("Обработка.ЗагрузкаДолжников.Форма.Форма",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧДолжники(Результат, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Для каждого строкаРезультата Из Результат Цикл
			НоваяСтрока = Объект.Должники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, строкаРезультата);
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьТЧДоллжники()

&НаКлиенте
Процедура ОтказПередачи(Команда)
	Объект.Подписан = Ложь;
	Объект.ОтказПередачи = Истина;
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НапечататьКарточку(Команда)
	МассивДолжников = Новый Массив;
	ВыделенныеСтроки = Элементы.Должники.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			СтрокаДолжника = Объект.Должники.НайтиПоИдентификатору(ВыделеннаяСтрока);
			МассивДолжников.Добавить(СтрокаДолжника.Должник);
		КонецЦикла;
	Иначе
		МассивДолжников = Объект.Должники.Выгрузить("Должник");
	КонецЕсли;
	Для Каждого Должник Из МассивДолжников Цикл
		Если Должник.Пустая() Тогда
			Сообщить("Не выбран должник.");
			Возврат;	
		КонецЕсли; 
		
		Таблица = Новый ТабличныйДокумент;
		
		ЗаполнитьКарточкуНаСервере(Таблица, Должник);
		
		Таблица.Защита = Истина;
		Таблица.ТолькоПросмотр = Истина;
		Таблица.Показать("Карточка " + Строка(Должник));
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКарточкуНаСервере(Таблица, Знач ТекДолжник)
	
	ОбработкаОтчета = Отчеты.КарточкаДолжника.Создать();
	ОбработкаОтчета.Должник = ТекДолжник;
	ОбработкаОтчета.КарточкаДолжника(Таблица, ТекДолжник);
	
КонецПроцедуры

