
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Об = РеквизитФормыВЗначение("Объект");
	ЭтоНовый = Об.ЭтоНовый();
	
	Если ЭтоНовый Тогда
		
	   Объект.Владелец=Параметры.Владелец;
	   Объект.Наименование="Копия Договора цессии  - " + Параметры.НомерЦессии;
	   Объект.ДоговорЦессии=Параметры.НомерЦессии;
		
		
	КонецЕсли;  
	

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
	    стрДанные=Объект.Ссылка;
		
		ОповеститьОВыборе(стрДанные);

	
КонецПроцедуры
