Функция ПолучитьСводнуюТаблицуДляВыезда(Дата, Сотрудник, СписокДолжников) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Новых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Выезд,
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление КАК Направление,
	               |	ВыездСрезПоследних.Должник.Район КАК Район
	               |ИЗ
	               |	РегистрСведений.Выезд.СрезПоследних(
	               |			&Дата,
	               |			Сотрудник = &Сотрудник
	               |				И Должник В (&СписокДолжников)) КАК ВыездСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление,
	               |	ВыездСрезПоследних.Должник.Район";
	
	Запрос.УстановитьПараметр("Дата", 	Дата);
	Запрос.УстановитьПараметр("Обзвон", Перечисления.РежимыРаботы.Обзвон);
	Запрос.УстановитьПараметр("Выезд", 	Перечисления.РежимыРаботы.Выезд);
	Запрос.УстановитьПараметр("СписокДолжников", СписокДолжников);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции // ПолучитьСводнуюТаблицуДляВыезда()
 
Функция ПолучитьСводнуюТаблицуДляВыездаССуммами(Дата, Сотрудник, СписокДолжников) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Новых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Выезд,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаОбзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаНовых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаВыезд,
	               |	СУММА(1) КАК ВсегоДолжников,
	               |	СУММА(БалансДолжниковОстатки.СуммаОстаток) КАК СуммаВсего,
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление КАК Направление,
	               |	ВыездСрезПоследних.Должник.Район КАК Район
	               |ИЗ
	               |	РегистрСведений.Выезд.СрезПоследних(
	               |			&Дата,
	               |			Сотрудник = &Сотрудник
	               |				И Должник В (&СписокДолжников)) КАК ВыездСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БалансДолжников.Остатки(&Дата, Должник В (&СписокДолжников)) КАК БалансДолжниковОстатки
	               |		ПО ВыездСрезПоследних.Должник = БалансДолжниковОстатки.Должник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление,
	               |	ВыездСрезПоследних.Должник.Район";
	
	Запрос.УстановитьПараметр("Дата", 				Дата);
	Запрос.УстановитьПараметр("Обзвон", 			Перечисления.РежимыРаботы.Обзвон);
	Запрос.УстановитьПараметр("Выезд", 				Перечисления.РежимыРаботы.Выезд);
	Запрос.УстановитьПараметр("Сотрудник", 			Сотрудник);
	Запрос.УстановитьПараметр("СписокДолжников", 	СписокДолжников);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции // ПолучитьСводнуюТаблицуДляВыезда()

Функция ПолучитьСводнуюТаблицуДляВыездаССуммами_БезДат(Дата, Сотрудник, СписокДолжников) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Новых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Выезд,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаОбзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаНовых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаВыезд,
	               |	СУММА(1) КАК ВсегоДолжников,
	               |	СУММА(БалансДолжниковОстатки.СуммаОстаток) КАК СуммаВсего,
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление КАК Направление,
	               |	ВыездСрезПоследних.Должник.Район КАК Район
	               |ИЗ
	               |	РегистрСведений.Выезд.СрезПоследних(
	               |			&Дата,
	               |			Сотрудник = &Сотрудник
	               |				И Должник В (&СписокДолжников)) КАК ВыездСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БалансДолжников.Остатки(&Дата, Должник В (&СписокДолжников)) КАК БалансДолжниковОстатки
	               |		ПО ВыездСрезПоследних.Должник = БалансДолжниковОстатки.Должник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыездСрезПоследних.Должник.Направление,
	               |	ВыездСрезПоследних.Должник.Район";
	
	Запрос.УстановитьПараметр("Дата", 				Дата);
	Запрос.УстановитьПараметр("Обзвон", 			Перечисления.РежимыРаботы.Обзвон);
	Запрос.УстановитьПараметр("Выезд", 				Перечисления.РежимыРаботы.Выезд);
	Запрос.УстановитьПараметр("Сотрудник", 			Сотрудник);
	Запрос.УстановитьПараметр("СписокДолжников", 	СписокДолжников);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции // ПолучитьСводнуюТаблицуДляВыезда()
