

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка=Ложь;
	//
	//стрДанные = Элемент.ТекущиеДанные;
	//
	//СписокПараметров = Новый Структура;
	//СписокПараметров.Вставить("НомерДоговора",стрДанные.НомерДоговора);
	//
	//СписокПараметров.Вставить("Договор",стрДанные.Ссылка);
	//
	//СписокПараметров.Вставить("Владелец",стрДанные.Владелец);
	//
	//
	//
	//
	//ОповеститьОВыборе(СписокПараметров);

	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	//
	// стрДанные = Элементы.Список.ВыделенныеСтроки;
	// 
	// 
	// стрДанные = Элемент.ТекущиеДанные;

	// 
	//СписокПараметров = Новый Структура;
	//СписокПараметров.Вставить("Договорамассив",стрДанные);


	
	 массивРезультат=Новый Массив;
	//
	//стрДанные = Элементы.Список.ВыделенныеСтроки;
	//
	Для каждого СтрСписка Из Элементы.Список.ВыделенныеСтроки  Цикл
	
		   ДанныеСтр = Элементы.Список.ДанныеСтроки(СтрСписка);
		   
		   
		   
		   массивРезультат.Добавить(ДанныеСтр);
	КонецЦикла;
	
		
	
	
	ОповеститьОВыборе(массивРезультат);

	
КонецПроцедуры
