
&НаКлиенте
Процедура РеестрыПортфеляРеестрПриИзменении(Элемент)
	
	
	    пр= Элементы.РеестрыПортфеля.ТекущиеДанные;
		
		НомерРеестра=НомерРеестра(пр.Реестр);

		пр.НомерРеестра=НомерРеестра;
				
		
КонецПроцедуры


&НаСервере
Функция НомерРеестра(реестр)
	
	 номерРеестра="";
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Реестр.НомерДляПечати КАК Номер
						|ИЗ
						|	Документ.Реестр КАК Реестр
						|ГДЕ
						|	Реестр.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", реестр);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						номерРеестра=ВыборкаДетальныеЗаписи.Номер;
					КонецЦикла;
					
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
   Возврат  номерРеестра;
					
КонецФункции // ()


&НаКлиенте
Процедура Добавить(Команда)
	// Вставить содержимое обработчика.
	     СтандартнаяОбработка = Ложь;
		 
		 ПараметрыФормы  = Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина);
         ОбработкаВыбора = Новый ОписаниеОповещения("ВыбратьЭлементСправочника", ЭтаФорма);
	  
		 
		  формаЭ=ОткрытьФорму("Документ.Реестр.Форма.ФормаВыбора1",ПараметрыФормы,,,,,ОбработкаВыбора);
		
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьЭлементСправочника(РезультатЗакрытия,ДопПараметры) Экспорт

			Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
			   Возврат;
			КонецЕсли;

			
			Для каждого стр Из РезультатЗакрытия  Цикл
				  трокаТаб=Объект.РеестрыПортфеля.Добавить();
				  трокаТаб.Реестр=стр;
				  трокаТаб.НомерРеестра=НомерРеестра(стр);
				
				
			
			КонецЦикла; 
			
			
			
КонецПроцедуры	 


	 
