
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	    ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
 	

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	    ФайлДанных = ИмяФайла;
		
	   ФайлЕксел.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();

	    Для каждого стр Из ТаблицаЗначений Цикл

			Если стр.НомерДоговора<>"" и стр.ФИОКлиента<>"" Тогда
				
				     ДобавитьПервоначальногоКредитора(стр.НомерДоговора, стр.Банк_первоначальныйКредитор, стр.НомерПервичногоКредитногоДоговора,стр.ФИОКлиента);
				
			
			КонецЕсли;
			
			
			//стр.Банк_первоначальныйКредитор
			//стр.НомерДоговора
			  //стр.НомерПервичногоКредитногоДоговора
			  //стр.ФИОКлиента
			  
			  
			  
			
		КонецЦикла;
	   
	   
	
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьПервоначальногоКредитора(дог, первКредитор, догПервоначальный,фиоДолж)

	                    догСсылка=Неопределено;
						должСсылка=Неопределено;
						банкСсылка=Неопределено;
						
						//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						// Данный фрагмент построен конструктором.
						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	Договоры.Ссылка КАК Ссылка,
							|	Договоры.Владелец КАК Владелец
							|ИЗ
							|	Справочник.Договоры КАК Договоры
							|ГДЕ
							|	Договоры.НомерДоговора = &НомерДоговора
							|	И Договоры.Владелец.Наименование = &Наименование";
						
						Запрос.УстановитьПараметр("Наименование", фиоДолж);
						Запрос.УстановитьПараметр("НомерДоговора", дог);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							догСсылка=ВыборкаДетальныеЗаписи.Ссылка;
							должСсылка=ВыборкаДетальныеЗаписи.Владелец;
						КонецЦикла;
						
						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

						
						
	                    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
							// Данный фрагмент построен конструктором.
							// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
							
							Запрос = Новый Запрос;
							Запрос.Текст = 
								"ВЫБРАТЬ
								|	Банки.Ссылка КАК Ссылка
								|ИЗ
								|	Справочник.Банки КАК Банки
								|ГДЕ
								|	Банки.Наименование = &Наименование";
							
							Запрос.УстановитьПараметр("Наименование", первКредитор);
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								
								    банкСсылка=ВыборкаДетальныеЗаписи.Ссылка;
								
							КонецЦикла;
							
							//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

							
							
							Если банкСсылка=Неопределено Тогда
								
								новыйЭлемент=Справочники.Банки.СоздатьЭлемент();
								
								новыйЭлемент.Наименование=первКредитор;
								
								новыйЭлемент.Записать();
								
								банкСсылка=новыйЭлемент.Ссылка;
							
							КонецЕсли;
							
							
							
							Если догСсылка<>Неопределено  Тогда
								
								 об=догСсылка.ПолучитьОбъект();
								 
								 об.НомерПервичногоКредитногоДоговора=догПервоначальный;
								 
								 об.БанкПервоначальныйКредитор=банкСсылка;
								 
								 об.Записать();
								
								
								
								
							
							КонецЕсли;
							
							
							
							
							
							
	
	
	

КонецПроцедуры


	
	
	

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
	
	Сообщить("Ок");
	
	
КонецПроцедуры
