
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
	СписокПараметров = Новый Структура;
	
	СписокПараметров.Вставить("Госпошлина", Госпошлина);
	
	
	ОповеститьОВыборе(СписокПараметров);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	
	ИтогРассчет=0;
	
	Если  СуммаГосОбщая<=20000 Тогда
		
		   ИтогРассчет=МАКС((СуммаГосОбщая/100)*4,400);
	
	КонецЕсли;
	
	
	Если  СуммаГосОбщая<=100000 И СуммаГосОбщая>20000 Тогда
		
		 ИтогРассчет=800+(СуммаГосОбщая-20000)/100*3;
	
	КонецЕсли;
	
	
	Если  СуммаГосОбщая>100000 И  СуммаГосОбщая<200000  Тогда
		
		ИтогРассчет=3200+(СуммаГосОбщая-100000)/100*2;
	
	КонецЕсли;
	
	
	Если  СуммаГосОбщая > 200000 И СуммаГосОбщая<1000000 Тогда
		
		 ИтогРассчет=5200+(СуммаГосОбщая-200000)/100;
	
	КонецЕсли;

	
	Если  СуммаГосОбщая>1000000 Тогда
		
		 ИтогРассчет=МИН(13200+(СуммаГосОбщая-1000000)/100*0,5,60000);
	
	КонецЕсли;

	
     Госпошлина=ИтогРассчет;
	 
	 ЭтаФорма.Закрыть();
	
КонецПроцедуры
