&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Должники
	Для Каждого Реквизит Из Метаданные.Справочники.Должники.Реквизиты Цикл 
		ДолжникиРеквизит.Добавить(Реквизит.Имя, Реквизит.Представление());
	КонецЦикла; 

	//Договоры
	Для Каждого Реквизит Из Метаданные.Справочники.Договоры.Реквизиты Цикл 
		ДоговорыРеквизит.Добавить(Реквизит.Имя, Реквизит.Представление());
	КонецЦикла; 
	
	//Адреса
	Для Каждого Реквизит Из Метаданные.Справочники.Адреса.Реквизиты Цикл 
		Если Реквизит.Имя = "Тип" Тогда
			Продолжить;
		КонецЕсли; 
		АдресаРеквизит.Добавить(Реквизит.Имя, Реквизит.Представление());
	КонецЦикла; 
	
	//Телефоны
	Для Каждого Реквизит Из Метаданные.Справочники.Телефоны.Реквизиты Цикл 
		Если Реквизит.Имя = "Тип" Тогда
			Продолжить;
		КонецЕсли;
		ТелефоныРеквизит.Добавить(Реквизит.Имя, Реквизит.Представление());
	КонецЦикла; 
	
	//Реестр
	Для Каждого Реквизит Из Метаданные.Документы.Реестр.ТабличныеЧасти.Должники.Реквизиты Цикл 
		РеестрРеквизит.Добавить(Реквизит.Имя, "(Табл) " + Реквизит.Представление()); 
	КонецЦикла; 
	
	//Контакты
	Для Каждого Реквизит Из Метаданные.Документы.Контакт.Реквизиты Цикл 
		Если Реквизит.Имя = "Тип" Тогда
			Продолжить;
		КонецЕсли; 
		ДокументКонтактРеквизит.Добавить(Реквизит.Имя, Реквизит.Представление());
	КонецЦикла;
	
	//ОбновлениеРеестра
	Для Каждого Реквизит Из Метаданные.Документы.ОбновлениеРеестра.ТабличныеЧасти.Должники.Реквизиты Цикл
		ОбновлениеРеестраРеквизит.Добавить(Реквизит.Имя, "(Табл) " + Реквизит.Представление());
	КонецЦикла;
	
	//Платежи
	Для Каждого Реквизит Из Метаданные.Документы.Платежи.ТабличныеЧасти.Должники.Реквизиты Цикл
		ПлатежиРеквизит.Добавить(Реквизит.Имя, "(Табл) " + Реквизит.Представление());
	КонецЦикла; 
	
	
	//Дополнительные реквизиты
	
	     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизиты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		  ДополнительныеРеквизитыРеквизит.Добавить(ВыборкаДетальныеЗаписи.Наименование);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	// Договор цессии
	
	Для Каждого Реквизит Из Метаданные.Справочники.ДоговорЦессии.Реквизиты Цикл 
		
		Если Реквизит.Имя = "Тип" Тогда
			Продолжить;
		КонецЕсли; 
		
		 ДоговорЦессииРеквизит.Добавить(Реквизит.Имя);
	КонецЦикла; 
	
	
	 Для Каждого Реквизит Из Метаданные.Справочники.Поручители.Реквизиты Цикл 
		
		Если Реквизит.Имя = "Тип" Тогда
			Продолжить;
		КонецЕсли; 
		
		 ПоручителиРеквизит.Добавить(Реквизит.Имя);
	КонецЦикла; 
	
	
	 Для Каждого Реквизит Из Метаданные.Справочники.УведомленияОбУступкеПраваТребования.Реквизиты Цикл 
		
		Если Реквизит.Имя = "Тип" Тогда
			Продолжить;
		КонецЕсли; 
		
		 УведомленияОбУступкеПраваТребованияРеквизит.Добавить(Реквизит.Имя, Реквизит.Представление());
		 
	КонецЦикла; 
	
	
    
	
	  	
	
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяЭлемента = Элемент.Имя;
	ДанныеВыбора = ЭтотОбъект[ИмяЭлемента];
КонецПроцедуры
