&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	НовоеНаименование = СтрШаблон("От %1 до %2.", Строка(Объект.МинимальноеЗначение), Строка(Объект.МаксимальноеЗначение));
	ДанныеВыбора.Добавить(НовоеНаименование);
	
КонецПроцедуры

&НаКлиенте
Процедура МинМаксЗначениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.МинимальноеЗначение) И (Объект.МаксимальноеЗначение) Тогда
		Если Объект.МинимальноеЗначение > Объект.МаксимальноеЗначение Тогда
			ТекстПредупреждения = СтрШаблон("Неверно задан интервал. %1 > %2.", Объект.МинимальноеЗначение, Объект.МаксимальноеЗначение);
			ПоказатьПредупреждение(, ТекстПредупреждения, 15);
			Возврат;
		КонецЕсли;
		НовоеНаименование = СтрШаблон("От %1 до %2.", Строка(Объект.МинимальноеЗначение), Строка(Объект.МаксимальноеЗначение));
		Объект.Наименование = НовоеНаименование;
	КонецЕсли;
	
КонецПроцедуры

