&НаКлиенте
Процедура ОбработкаКомандыФормы(Команда)
	Если Команда.Имя = "Свернуть" Тогда
		СвернутьПоСтрокам();
	ИначеЕсли Команда.Имя = "СвернутьПоДолжникам" Тогда
		СвернутьПоДолжникам();
	ИначеЕсли Команда.Имя = "Обработка1" Тогда
		Обработка1();
	ИначеЕсли Команда.Имя = "ПроставитьАрхив" Тогда
		ПроставитьАрхив();
	ИначеЕсли Команда.Имя = "УдалитьКонтроль1" Тогда
		УдалитьКонтроль1();
	КонецЕсли;
КонецПроцедуры

Процедура СвернутьПоСтрокам()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Должник, Отдел, Сотрудник", "");
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

Процедура СвернутьПоДолжникам()
	Об = РеквизитФормыВЗначение("Объект");
	
	ТЗ = Об.Должники.Выгрузить();
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.ЗаполнитьЗначения(1, "Количество");
	ТЗ.Свернуть("Должник", "Количество");
	
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Должник", СтрокаТЗ.Должник);
		НайденныеСтроки = Об.Должники.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
			СтрокаДолжники.Контроль = СтрокаТЗ.Количество;
		КонецЦикла; 
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

Процедура Обработка1()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Должник, Отдел, Сотрудник", "");
	
	ТЗ = Об.Должники.Выгрузить();
	ТЗ.Колонки.Добавить("Количество");
	
	ТЗ.ЗаполнитьЗначения(1, "Количество");
	
	ТЗ.Свернуть("Должник", "Количество");
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		Если СтрокаТЗ.Количество < 2 Тогда
			Продолжить;
		КонецЕсли; 
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Должник", СтрокаТЗ.Должник);
		НайденныеСтроки = Об.Должники.НайтиСтроки(ПараметрыОтбора);
		
		Пустая = Неопределено;
		Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
			Если СтрокаДолжники.Отдел.Пустая() И СтрокаДолжники.Сотрудник.Пустая() Тогда
				СтрокаДолжники.Отдел = Архив;
				Сообщить(СтрШаблон("Изменена %1 %2 %3.", СтрокаДолжники.Отдел, СтрокаДолжники.Сотрудник, СтрокаДолжники.Должник));
				Пустая = СтрокаДолжники;
			КонецЕсли; 
		КонецЦикла; 
		
		Если НЕ Пустая = Неопределено Тогда
			Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
				Если НЕ Пустая = СтрокаДолжники Тогда
					Сообщить(СтрШаблон("Удалена %1 %2 %3.", СтрокаДолжники.Отдел, СтрокаДолжники.Сотрудник, СтрокаДолжники.Должник));
					Об.Должники.Удалить(СтрокаДолжники);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьАрхив()
	Для каждого СтрокаДолжники Из Объект.Должники Цикл
		Если ЗначениеЗаполнено(СтрокаДолжники.Отдел) = Ложь И ЗначениеЗаполнено(СтрокаДолжники.Сотрудник) = Ложь Тогда
			СтрокаДолжники.Отдел = Архив;
			Сообщить(СтрШаблон("Изменена %1 %2 %3.", СтрокаДолжники.Отдел, СтрокаДолжники.Сотрудник, СтрокаДолжники.Должник));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКонтроль1()
	СтруктураОтбора = Новый Структура("Контроль", 1);
	НайденныеСтроки = Объект.Должники.НайтиСтроки(СтруктураОтбора);
	Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
		Объект.Должники.Удалить(СтрокаДолжники);
	КонецЦикла;
КонецПроцедуры