
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 
	
	            Список.Параметры.УстановитьЗначениеПараметра("Владелец",Параметры.тДоговор);
				 
				 ФИОДолжника=Параметры.тДолжник;
				 Цедент=Параметры.тЦедент;
				 НомерДоговораЦессии=Параметры.тНомерДоговораЦессии;
				 
				 ДатаЦессии=Параметры.тДатаЦессии;
				 ВидПродукта=Параметры.тВидПродукта;
				 
				 СуммаЗадолженностиПереданная=Параметры.тСуммаЗадолженностиПереданная;
				 ОтветственныйСотрудник=Параметры.тОтветственныйСотрудник;
				 КрДоговор=Параметры.тДоговор;
				 
				  Если Параметры.Свойство("номерСтроки") Тогда

					  номерСтрокиСпрГруппаДог=Параметры.номерСтроки;

					  
				  КонецЕсли;	  
				  
				  Если Параметры.Свойство("спрГруппадоговоровЮристСсылка") Тогда

 	 		         спрГруппадоговоровЮристСсылка=Параметры.спрГруппадоговоровЮристСсылка;
					  
				  КонецЕсли;	  
				  
				   
				 
	   
	видимФСП=Новый Структура;
	
	видимФСП.Вставить("Период", ТекущаяДата());
	видимФСП.Вставить("Сотрудник", ПараметрыСеанса.Пользователь);
	
	УстановитьПараметрыФункциональныхОпцийФормы(видимФСП);

	 
	 
	 
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаСоздать(Команда)
	// Вставить содержимое обработчика.
	  	         парамСтруктура=Новый Структура;
				  
				  парамСтруктура.Вставить("тДолжник", ФИОДолжника);
				  
				  парамСтруктура.Вставить("тКрДоговор", КрДоговор);
				  
				  
				  парамСтруктура.Вставить("тЦедент", Цедент);
				  
				  парамСтруктура.Вставить("тНомерДоговораЦессии", НомерДоговораЦессии);
				  
				  парамСтруктура.Вставить("тДатаЦессии", ДатаЦессии);
				  
				  парамСтруктура.Вставить("тВидПродукта",ВидПродукта);
				  
				  парамСтруктура.Вставить("тСуммаЗадолженностиПереданная", СуммаЗадолженностиПереданная);
				  
				  парамСтруктура.Вставить("тОтветственныйСотрудник", ОтветственныйСотрудник);

		
	   ОткрытьФорму("Справочник.СписокДелКредитногоДоговора.Форма.ФормаЭлемента",парамСтруктура,ЭтаФорма);

	

	
	
КонецПроцедуры


&НаСервере
Функция СтадияСудебноеПроизводство()

	Возврат Перечисления.СтадияДела.СудебноеПроизводство;
	

КонецФункции // ()


&НаСервере
Функция СтадияИсполнительноеПроизводство()

	Возврат Перечисления.СтадияДела.ИсполнительноеПроизводство;
	

КонецФункции // ()




&НаКлиенте
Процедура Производство(Команда)
	
	  ФункцииДляОтчетов.СписокДелКредитногоДоговораУстановитьДатаПоследнегоПлатежа();
	  
	  Сообщить("Ок");
	
	//// Вставить содержимое обработчика.
	//
	//   //ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки; 
	//   
	//   
	//   судебноеПроизводство=СтадияСудебноеПроизводство();
	//   
	//   ТекСтрока = Элементы.Список.ТекущаяСтрока;
	//   
	//   ДанныеСтр = Элементы.Список.ДанныеСтроки(ТекСтрока);
	//   
	//   
	//   Если Не ДанныеСтр.ПометкаУдаления Тогда
	//	   
	//	    Если ДанныеСтр.СтадияДела=судебноеПроизводство  Тогда
	//			
	//			  парамСтруктура=Новый Структура;
	//			  парамСтруктура.Вставить("тДоговор", ДанныеСтр.КредитныйДоговор);
	//			  
	//			  парамСтруктура.Вставить("НомерДела", ДанныеСтр.НомерДела);
	//			  
	//			  
	//			  //
	//			  //парамСтруктура.Вставить("тЦедент", ДанныеСтр.Банк);
	//			  //
	//			  //парамСтруктура.Вставить("тНомерДоговораЦессии", Элемент.ТекущиеДанные.НомерДоговораЦессии);
	//			  //
	//			  //парамСтруктура.Вставить("тДатаЦессии", Элемент.ТекущиеДанные.ДатаЦессии);
	//			  //
	//			  //парамСтруктура.Вставить("тВидПродукта", Элемент.ТекущиеДанные.ВидПродукта);
	//			  //
	//			  //парамСтруктура.Вставить("тСуммаЗадолженностиПереданная", Элемент.ТекущиеДанные.СуммаЗадолженностиПереданная);
	//			  //
	//			  //парамСтруктура.Вставить("тОтветственныйСотрудник", Элемент.ТекущиеДанные.ОтветственныйСотрудник);
	//			  //
	//			  //
	//			  //
	//			  
	//			  // Элемент.ТекущиеДанные.КрДоговор
	//  
	//              ОткрытьФорму("Обработка.СудебнаяСтадия.Форма.Форма",парамСтруктура,ЭтаФорма);
	//  
	//  
	//			   //ОткрытьФорму("Справочник.СписокДелКредитногоДоговора.Форма.ФормаСписка",парамСтруктура,ЭтаФорма); 

	//			
	//			   //А=0;
	//			
	//			
	//		
	//		КонецЕсли;
	//	   
	//	   
	//	   
	//       
	//   КонецЕсли;	   
	//   
	//   
	   
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка=Ложь;
	
	    судебноеПроизводство=СтадияСудебноеПроизводство();
		исполнительноеПроизводство=СтадияИсполнительноеПроизводство();
	   
	   ТекСтрока = Элементы.Список.ТекущаяСтрока;
	   
	   ДанныеСтр = Элементы.Список.ДанныеСтроки(ТекСтрока);
	   
	   
	   Если Не ДанныеСтр.ПометкаУдаления Тогда
		   
		    Если ДанныеСтр.СтадияДела=судебноеПроизводство  Тогда
				
				  парамСтруктура=Новый Структура;
				  парамСтруктура.Вставить("тДоговор", ДанныеСтр.КредитныйДоговор);
				  
				  парамСтруктура.Вставить("НомерДела", ДанныеСтр.НомерДела);
				  
				  парамСтруктура.Вставить("ДатаДела", ДанныеСтр.ДатаДела);
				  
				  парамСтруктура.Вставить("ссылкаДела", ДанныеСтр.Ссылка);
				  
				  парамСтруктура.Вставить("номерСтрокиСпрГруппаДог", номерСтрокиСпрГруппаДог);
				  
				  парамСтруктура.Вставить("спрГруппадоговоровЮристСсылка", спрГруппадоговоровЮристСсылка);
				  
				  
				  
				  
				  //парамСтруктура.Вставить("тЦедент", ДанныеСтр.Банк);
				  
				  
				  парамСтруктура.Вставить("тНомерДоговораЦессии", Элемент.ТекущиеДанные.НомерЦессии);
				  
				  парамСтруктура.Вставить("тДатаЦессии", Элемент.ТекущиеДанные.ДатаЦессии);
				  
				  //
				  //парамСтруктура.Вставить("тВидПродукта", Элемент.ТекущиеДанные.ВидПродукта);
				  //
				  //парамСтруктура.Вставить("тСуммаЗадолженностиПереданная", Элемент.ТекущиеДанные.СуммаЗадолженностиПереданная);
				  //
				  //парамСтруктура.Вставить("тОтветственныйСотрудник", Элемент.ТекущиеДанные.ОтветственныйСотрудник);
				  //
				  //
				  //
				  
				  // Элемент.ТекущиеДанные.КрДоговор
	  
	              ОткрытьФорму("Обработка.СудебнаяСтадия.Форма.Форма",парамСтруктура,ЭтаФорма);
				  
				  
	  
				   //ОткрытьФорму("Справочник.СписокДелКредитногоДоговора.Форма.ФормаСписка",парамСтруктура,ЭтаФорма); 

				
				   //А=0;
				
				
			
			 КонецЕсли;
			   
			 Если ДанныеСтр.СтадияДела=исполнительноеПроизводство  Тогда
				 
				   парамСтруктура=Новый Структура;
				  парамСтруктура.Вставить("тДоговор", ДанныеСтр.КредитныйДоговор);
				  
				  парамСтруктура.Вставить("НомерДела", ДанныеСтр.НомерДела);
				  
				  парамСтруктура.Вставить("ДатаДела", ДанныеСтр.ДатаДела);
				  

				   ОткрытьФорму("Обработка.ИсполнительноеПроизводство.Форма.Форма",парамСтруктура,ЭтаФорма);
				 
				 
				 
				 
			 КонецЕсли; 
		   
			  
			  
		   
	       
	   КонецЕсли;
	
	
	
	
КонецПроцедуры

