
&НаСервере
Процедура ИсправитьПустыеНаСервере(реестр)
	
	         док=реестр.ПолучитьОбъект();
	              
			 
			 Для каждого стр  Из док.Должники  Цикл
				 
				  Если стр.Должник.Наименование="" Тогда
				  
				  	    стр.Должник= СсылкаДолжника(стр.Договор,док.Банк);
				  
				  КонецЕсли;
			 	
			 
			 КонецЦикла;

			 
			 док.Записать();
	
	
КонецПроцедуры


Функция СсылкаДолжника(дог, банк)

	         владелец=Неопределено;
	
	                  //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						// Данный фрагмент построен конструктором.
						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	Договоры.Владелец КАК Владелец
							|ИЗ
							|	Справочник.Договоры КАК Договоры
							|ГДЕ
							|	Договоры.Ссылка = &Ссылка
							|	И Договоры.Банк = &Банк";
						
						Запрос.УстановитьПараметр("Банк", банк);
						Запрос.УстановитьПараметр("Ссылка", дог);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							владелец=ВыборкаДетальныеЗаписи.Владелец;
							
						КонецЦикла;
						
						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

			Возврат владелец;			
						
						

КонецФункции // ()


		 
		 

&НаКлиенте
Процедура ИсправитьПустые(Команда)
	
	ИсправитьПустыеНаСервере(Объект.Реестр);
	
	Сообщить("Ок");
	
КонецПроцедуры

&НаСервере
Процедура ПодставитьДоговораНаСервере(реестр)
	   док=реестр.ПолучитьОбъект();
     
	   
	    Для каждого стр  Из док.Должники  Цикл
			
			      стр.Договор= НайтиДоговорПоДолж(стр.Должник);
			
				  
				  
				  
		 КонецЦикла;

			 
		 док.Записать();

	
КонецПроцедуры

&НаСервере
Функция НайтиДоговорПоДолж(долж)

	   ссылкаДоговор=Неопределено;
	   
				      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Договоры.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Договоры КАК Договоры
					|ГДЕ
					|	Договоры.Владелец = &Владелец";
				
				Запрос.УстановитьПараметр("Владелец", долж);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					ссылкаДоговор=ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат ссылкаДоговор;			
				

КонецФункции // ()



	 

&НаКлиенте
Процедура ПодставитьДоговора(Команда)
	  ПодставитьДоговораНаСервере(Объект.Реестр);
	  Сообщить("Ок");

КонецПроцедуры
