
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 
	    ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
 	

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ДвоичныеДанные, Расширение)
	
	 
	   ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Расширение);
	   ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
	 	    
	   ФайлЕксел.Прочитать(ФайлEXCELНаСервере,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	   УдалитьФайлы(ФайлEXCELНаСервере);

	   
	   
		
	   //ФайлЕксел.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();
	   
	    Для каждого стр Из ТаблицаЗначений Цикл

			ссылкаДолжник=НайтиДолжника(стр.НомерДоговора,стр.ФИОКлиента);

			об=ссылкаДолжник.ПолучитьОбъект();
			
     		об.НомерПаспорта=стр.НомерИСерияДокумента;
			об.ПаспортКемВыдан=стр.КемВыдан;
			об.НомерПаспорта=стр.НомерИСерияДокумента;
			об.ПаспортКогдаВыдан=СтроковыеФункцииКлиентСервер.СтрокаВДату(стр.ДатаВыдачи);
			об.Записать(); 
			
					
		КонецЦикла;	


	
	
КонецПроцедуры


&НаСервере
Функция НайтиДолжника(дог,должник)

	
	      ссылкаДолжник=Неопределено;
	       	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Должники.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Договоры КАК Договоры
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должники КАК Должники
					|		ПО Договоры.Владелец = Должники.Ссылка
					|ГДЕ
					|	Договоры.НомерДоговора = &НомерДоговора
					|	И Должники.Наименование = &Наименование";
				
				Запрос.УстановитьПараметр("Наименование", должник);
				Запрос.УстановитьПараметр("НомерДоговора", дог);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					ссылкаДолжник=ВыборкаДетальныеЗаписи.Ссылка;
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	   
	  Возврат ссылкаДолжник;
	

КонецФункции // ()


	
	

&НаКлиенте
Процедура Загрузить(Команда)
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);

	ЗагрузитьНаСервере(ДвоичныеДанные,Файл.Расширение);
	Сообщить("Ок");

КонецПроцедуры
