
&НаСервере
Процедура УдалитьДоговораНаСервере()
	
										
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	РеестрДолжники.Должник КАК Должник
						|ИЗ
						|	Документ.Реестр.Должники КАК РеестрДолжники
						|ГДЕ
						|	РеестрДолжники.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", Объект.Реестр);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
							
							Запрос = Новый Запрос;
							Запрос.Текст = 
								"ВЫБРАТЬ
								|	Договоры.Ссылка КАК Ссылка
								|ИЗ
								|	Справочник.Договоры КАК Договоры
								|ГДЕ
								|	Договоры.Владелец = &Владелец";
							
							Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								
								      УдалитьДоговор(ВыборкаДетальныеЗаписи.Ссылка);

								
								
								
							КонецЦикла;
							
						
												
												
												
					КонецЦикла;
					
					


	
КонецПроцедуры
				
				

&НаСервере
Процедура УдалитьДоговор(дог)
	
	  Если дог.ПолучитьОбъект()<>Неопределено Тогда
		  
		   
		      Если ЕстьВЭтомРеестре(дог)  Тогда
			  
			  	          догУдал = дог.ПолучитьОбъект();
				
				         догУдал.Удалить();

			  
			  КонецЕсли;
		    
		  
					  
	  	
	  
	  КонецЕсли;
	 
		 
	  
	

КонецПроцедуры


&НаСервере
Функция ЕстьВЭтомРеестре(дог)

	 естьДог=Ложь;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	РеестрДолжники.Договор КАК Договор
					|ИЗ
					|	Документ.Реестр.Должники КАК РеестрДолжники
					|ГДЕ
					|	РеестрДолжники.Ссылка = &Ссылка
					|	И РеестрДолжники.Договор.НомерДоговора = &НомерДоговора";
				
				Запрос.УстановитьПараметр("НомерДоговора", дог.НомерДоговора);
				Запрос.УстановитьПараметр("Ссылка", Объект.Реестр);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					естьДог=Истина;
					
					
				
				КонецЕсли;
				//
				//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
				//КонецЦикла;
				//
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	 Возврат естьДог;
	

КонецФункции // ()

  


			

&НаКлиенте
Процедура УдалитьДоговора(Команда)
	УдалитьДоговораНаСервере();
	Сообщить("Ок");
	
КонецПроцедуры
