
&НаСервере
Процедура ЗаписатьНаСервере()
	
	   об=СсылкаНаШаблон.ПолучитьОбъект();
	   
	   ДвоичныеДанные = об.ФайлШаблона.Получить();
	   
		
	   новыйЭлемент=Справочники.ШаблоныЮристы.СоздатьЭлемент();
	   новыйЭлемент.Наименование=НаименованиеШаблона;
	   новыйЭлемент.ФайлШаблона= Новый ХранилищеЗначения(ДвоичныеДанные);
	   
	   новыйЭлемент.ШаблонИстина=Ложь;
	   
	   новыйЭлемент.Записать();
	   
	
	   //ДвоичныеДанные = Хранилище.Получить();
	
	
	
	//адресВХранилище = ПоместитьВоВременноеХранилище(файлСтр.ДвоичныеДанные);

	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	
	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	   Исполнитель=Параметры.Исполнитель;
	   
	   имяшаблона=Параметры.НаименованиеШаблона+"_"+Строка(Параметры.Исполнитель)+"_"+Строка(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	   НаименованиеШаблона=имяшаблона;
	   СсылкаНаШаблон=Параметры.СсылкаШаблона;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ссылкаСпр", НаименованиеШаблона);
	
	ОповеститьОВыборе(СписокПараметров);

	
КонецПроцедуры
