
Процедура ОбработкаПроведения(Отказ, Режим)
	Перем Запрос, СписокДоговоров;
	Перем ПроцентыВознаграждения;
	
	Отказ = ДоступностьИзмененийПоДатеЗапрета(Дата);
	
	// Получить данные для расчета
	ПроцентыВознаграждения = Привязка.ПолучитьПроцентыВознаграждения(Банк, Дата);
	
	// Получим массив договоров
	СписокДоговоров = Должники.ВыгрузитьКолонку("Договор");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БалансДолжниковОстатки.ТекущийОсновнойДолгОстаток КАК ТекущийОсновнойДолг,
	|	БалансДолжниковОстатки.Договор,
	|	БалансДолжниковОстатки.Должник,
	|	БалансДолжниковОстатки.СуммаДолгаОстаток КАК СуммаДолга,
	|	БалансДолжниковОстатки.СуммаОстаток КАК Сумма,
	|	БалансДолжниковОстатки.ПросроченныйОсновнойДолгОстаток КАК ПросроченныйОсновнойДолг,
	|	БалансДолжниковОстатки.ТекущиеПроцентыОстаток КАК ТекущиеПроценты,
	|	БалансДолжниковОстатки.ПросроченныеПроцентыОстаток КАК ПросроченныеПроценты,
	|	БалансДолжниковОстатки.НеустойкаОстаток КАК Неустойка,
	|	БалансДолжниковОстатки.ГоспошлинаОстаток КАК Госпошлина,
	|	БалансДолжниковОстатки.ПрочееОстаток КАК Прочее
	|ИЗ
	|	РегистрНакопления.БалансДолжников.Остатки(&МоментВремени, Договор В (&СписокДоговоров)) КАК БалансДолжниковОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	
	РезультатЗапроса = Запрос.Выполнить();
	тзИтоги = РезультатЗапроса.Выгрузить();
	
	Для Каждого ТекСтрокаДолжники Из Должники Цикл
		// Найдём итог
		Итоги = тзИтоги.Найти(ТекСтрокаДолжники.Договор, "Договор");
		// регистр БалансДолжников Приход
		
		Если Итоги = Неопределено Тогда
		Иначе // сторнировать предыдущее 
			Движение = Движения.БалансДолжников.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Итоги);//sza171128-0950 Широков_Игорь
			Движение.Период 		= Дата;
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Сумма 			= Итоги;
			
			Сообщить("Должник уже был зарегистрирован: " + Строка(ТекСтрокаДолжники.Должник), СтатусСообщения.Внимание);
		КонецЕсли;		
		
		Движение = Движения.БалансДолжников.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаДолжники);//sza171128-0950 Широков_Игорь
		Движение.Период 		= Дата;
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Сумма 			= ТекСтрокаДолжники.ВсегоЗадолженность;
		
		// Записать новые значения в регистр
		// регистр ДанныеДоговоров 
		Движение = Движения.ДанныеДоговоров.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаДолжники);
		Движение.Период 					= Дата;
		Если ТекСтрокаДолжники.ДатаРасчетаЗадолженности = '00010101' Тогда
			Движение.ДатаРасчетаЗадолженности = Дата;
		Иначе	
			Движение.ДатаРасчетаЗадолженности = ТекСтрокаДолжники.ДатаРасчетаЗадолженности;
		КонецЕсли; 
		
		// регистр ДатыУчетаДоговоров
		Договор = ТекСтрокаДолжники.Договор;
		Движение = Движения.ДатыУчетаДоговоров.Добавить();
		Движение.Период 			= Дата;
		Движение.Договор 			= Договор;
		Движение.ДатаПередачи 		= ДатаПередачи;
		Движение.ДатаВозврата 		= ДатаВозврата;
		Движение.ДатаНачалаУчета 	= ДатаНачалаУчета;
		Движение.ДатаОкончанияУчета = ДатаОкончанияУчета;
		
		
		// регистр НачальныеДанныеДоговора 
		Движение = Движения.НачальныеДанныеДоговора.Добавить();
		Движение.Период 		= Дата;
		Движение.Договор 		= Договор;
		Движение.ДнейПросрочки 	= ТекСтрокаДолжники.ДнейПросрочки;
		Движение.ПроцентВознаграждения = Привязка.НайтиПроцентВознаграждения(ПроцентыВознаграждения, ТекСтрокаДолжники.ДнейПросрочки);
		Движение.СуммаЗадолженности	= ТекСтрокаДолжники.ВсегоЗадолженность;
		
		
		//Изменим статус договора на "Активный"
		Активный = Перечисления.СтатусыДоговоров.Активный;
		СтатусДоговора = Договор.Статус;
		
		Если СтатусДоговора <> Активный Тогда
			Попытка
				Об = Договор.ПолучитьОбъект();
				Об.Статус = Активный;
				Об.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
				
		
		
		
		
		
		
	КонецЦикла;
	
	//Павлов А.О.
	//Все предархивные договора сделаем активными
	Активный = Перечисления.СтатусыДоговоров.Активный;
	//СотрПредархив 	= Справочники.Сотрудники.НайтиПоНаименованию("Предархив");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Договоры.Ссылка
	|ИЗ
	|	Документ.Реестр.Должники КАК РеестрДолжники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО РеестрДолжники.Должник = Договоры.Владелец
	|ГДЕ
	|	Договоры.Статус = &Статус";
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДоговоров.Предархив);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.Статус = Активный;
		Об.Записать();
	КонецЦикла;
	//Павлов А.О.
	
	
	
	
	
	
	
КонецПроцедуры





