
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокПолейВыбора = Элементы.Поле.СписокВыбора;
	
	ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокумента.вх");
	
	ФормаДокументаВх = ПолучитьФорму("Справочник.ДокументВходящий.Форма.ФормаЭлемента",,, Новый УникальныйИдентификатор);
	
	//ПолучитьФорму("Справочник.ДокументВходящий.Форма.ФормаЭлемента");
	Для Каждого Элемент Из ФормаДокументаВх.Элементы Цикл
		Попытка
			Если Элемент.Видимость = Ложь Тогда
				СписокПолейВыбора.Добавить(Элемент.Имя, Элемент.Заголовок);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ЗаполнитьНазванияДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазванияДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НазванияДокументов.НазваниеДокумента КАК НазваниеДокумента
	               |ИЗ
	               |	Справочник.НазванияДокументов КАК НазванияДокументов
	               |ГДЕ
	               |	1 = 1
	               |	И НазванияДокументов.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("ТипДокумента", Перечисления.ТипДокумента.вх);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокНазванийДокументов = Элементы.НазваниеДокумента.СписокВыбора;
	СписокНазванийДокументов.Очистить();
	Пока Выборка.Следующий() Цикл
		СписокНазванийДокументов.Добавить(Выборка.НазваниеДокумента);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПриИзменении(Элемент)
	
	ЗначениеВыбора = Элемент.ТекстРедактирования;
	Объект.ИмяПоля = ЗначениеВыбора;
	
КонецПроцедуры
