
&НаСервере
Процедура УдалитьНаСервере()
	
	
	   
	         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СостояниеДелБанкДолжник.ДатаЗапроса КАК ДатаЗапроса,
				|	СостояниеДелБанкДолжник.НомерСудебногоДела КАК НомерСудебногоДела,
				|	СостояниеДелБанкДолжник.Ссылка КАК Ссылка,
				|	СостояниеДелБанкДолжник.Договор КАК Договор
				|ИЗ
				|	Справочник.СостояниеДелБанкДолжник КАК СостояниеДелБанкДолжник";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				
				 УдалитьЗадвой(ВыборкаДетальныеЗаписи.НомерСудебногоДела, ВыборкаДетальныеЗаписи.Договор);
				   
				
				
				
				
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	
КонецПроцедуры


&НаСервере
Процедура УдалитьЗадвой(номерДела, договор)

	
	        ссылкаСправочник=Неопределено;
	
	      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	СостояниеДелБанкДолжник.Ссылка КАК Ссылка,
				|	СостояниеДелБанкДолжник.НомерСудебногоДела КАК НомерСудебногоДела,
				|	СостояниеДелБанкДолжник.ДатаЗапроса КАК ДатаЗапроса
				|ИЗ
				|	Справочник.СостояниеДелБанкДолжник КАК СостояниеДелБанкДолжник
				|ГДЕ
				|	СостояниеДелБанкДолжник.НомерСудебногоДела = &НомерСудебногоДела
				|	И СостояниеДелБанкДолжник.Договор = &Договор
				|
				|УПОРЯДОЧИТЬ ПО
				|	ДатаЗапроса УБЫВ";
			
			Запрос.УстановитьПараметр("НомерСудебногоДела", номерДела);
			Запрос.УстановитьПараметр("Договор", договор);
			
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				ссылкаСправочник=ВыборкаДетальныеЗаписи.Ссылка;
				
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

			
		   Если ссылкаСправочник<>Неопределено Тогда
			   
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	СостояниеДелБанкДолжник.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.СостояниеДелБанкДолжник КАК СостояниеДелБанкДолжник
					|ГДЕ
					|	СостояниеДелБанкДолжник.НомерСудебногоДела = &НомерСудебногоДела
					|	И СостояниеДелБанкДолжник.Ссылка <> &Ссылка
					|	И СостояниеДелБанкДолжник.Договор = &Договор";
				
				Запрос.УстановитьПараметр("Договор", договор);
				Запрос.УстановитьПараметр("НомерСудебногоДела", номерДела);
				Запрос.УстановитьПараметр("Ссылка", ссылкаСправочник);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					
					 об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
					
			    	 об.Удалить();

					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


			    
				
		   	
		   
		   КонецЕсли;	
			
			
			
	
	

КонецПроцедуры

		
		
		

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере();
	Сообщить("Ок");
	
	
КонецПроцедуры
