
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	//Список.Параметры.УстановитьЗначениеПараметра("ДолжникПараметр",
	
	   Если Параметры.Свойство("ДолжникПараметр") Тогда
         //обработка параметра
		    Должник=Параметры.ДолжникПараметр;

      КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
	//Сообщить(Должник);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СудебныйСтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
		
	  РодительЮрСтатус=ПолучитьРеквизитВыбранногоЗначения(ВыбранноеЗначение);
	  
	  //ДатаСудСтатус
	  
	  //Если ПолучитьДатаСудСтатус(ВыбранноеЗначение) Тогда
	  //
	  //	     Элементы.ДатаСудСтатус.Видимость=Истина;
	  //   Иначе
	  //  	 Элементы.ДатаСудСтатус.Видимость=Ложь;
	  //  	 
	  //
	  //КонецЕсли;
	  //

	
  КонецПроцедуры
  
  &НаСервереБезКонтекста
Функция ПолучитьДатаСудСтатус(вбз)

	датаЕсть=Ложь;
	
	спр=Справочники.СудебныеСтатусы.НайтиПоНаименованию("Возбуждено ИП");
	
	Если вбз=спр Тогда
		
		  датаЕсть=Истина;
		
	
	КонецЕсли;
	
	Возврат  датаЕсть;

КонецФункции // ()


&НаСервереБезКонтекста
Функция ПолучитьРеквизитВыбранногоЗначения(ВыбранноеЗначение)
    Возврат ВыбранноеЗначение.Родитель;
   
КонецФункции

&НаСервере
Процедура ДобавитьНаСервере()
	// записать в  СтатаусДоговор
	 новаяЗапись=Справочники.ДоговорыСудебныеСтатусы.СоздатьЭлемент();
	 
	 новаяЗапись.Владелец=Должник;
	 новаяЗапись.Договор=Договор;
	 новаяЗапись.СудебныйСтатус=СудебныйСтатус;
	 новаяЗапись.Записать();
	 
	 
   	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ДобавитьНаСервере();
	
	
	ЭтаФорма.Закрыть();
КонецПроцедуры

