
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
	

	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВБазуНаСервере()
	
	   ФайлДанных = ИмяФайла;
		
	   ФайлЕксел.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();

	    Для каждого стр Из ТаблицаЗначений Цикл
		   
		   Если  стр.ФИО<>"" и стр._Договора<>""  Тогда
			
				 ЗаписатьВБазуПОЧТАШПИ(стр.ФИО,стр._Договора,стр._ШПИ);
			
			КонецЕсли;
  
	   
	   КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВБазуПОЧТАШПИ(долж,номерДог,стршпи)
  
	         должникСпр=Неопределено;
			 
			 ИмяПеречисления = Объект.НазначениеШПИ.Метаданные().Имя;
			 
			 КолекцияЗначенийПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления;
             ИндексЗначенияПеречисления=Перечисления[ИмяПеречисления].Индекс(Объект.НазначениеШПИ);
			 ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
			 
			
			 
			 
	               	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Должники.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Должники КАК Должники
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
					|		ПО Договоры.Владелец = Должники.Ссылка
					|ГДЕ
					|	Должники.Наименование = &Наименование
					|	И Договоры.НомерДоговора = &НомерДоговора";
				
				Запрос.УстановитьПараметр("Наименование", долж);
				Запрос.УстановитьПараметр("НомерДоговора", номерДог);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					должникСпр=ВыборкаДетальныеЗаписи.Ссылка;
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

				 Если должникСпр<>Неопределено Тогда

							Запрос = Новый Запрос;
							Запрос.Текст = 
								"ВЫБРАТЬ
								|	Почта_ШПИ.Ссылка КАК Ссылка
								|ИЗ
								|	Справочник.Почта_ШПИ КАК Почта_ШПИ
								|ГДЕ
								|	Почта_ШПИ.Владелец = &Владелец";
							
							Запрос.УстановитьПараметр("Владелец", должникСпр);
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							
							колСтр=ВыборкаДетальныеЗаписи.Количество();

							
							 Если колСтр=0 Тогда
								 спрЗапись=Справочники.Почта_ШПИ;
								 новыйПочтаСШП= спрЗапись.СоздатьЭлемент();
								 новыйПочтаСШП.Владелец=должникСпр;
								 
								 новыйПочтаСШП[ИмяЗначенияПеречисления]=стршпи;
								 
								 новыйПочтаСШП.Записать();
								 
								 
							 Иначе
								 
								   спрСсылка=Неопределено;
								 
									Запрос = Новый Запрос;
									Запрос.Текст = 
										"ВЫБРАТЬ
										|	Почта_ШПИ.Ссылка КАК Ссылка
										|ИЗ
										|	Справочник.Почта_ШПИ КАК Почта_ШПИ
										|ГДЕ
										|	Почта_ШПИ.Владелец = &Владелец";
									
									Запрос.УстановитьПараметр("Владелец", должникСпр);
									
									РезультатЗапроса = Запрос.Выполнить();
									
									ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
									
									Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
										
										спрСсылка=ВыборкаДетальныеЗаписи.Ссылка;
										
									КонецЦикла;
									
									
									 спрПоСсылка = спрСсылка.ПолучитьОбъект();
									 
									 спрПоСсылка[ИмяЗначенияПеречисления]=стршпи;

									 спрПоСсылка.Записать();
									
								 
								 
							 КонецЕсли;
											 
											 
											 
				 КонецЕсли;
				 
				 
				

КонецПроцедуры



&НаКлиенте
Процедура ЗагрузитьВБазу(Команда)
	ЗагрузитьВБазуНаСервере();
	Сообщить("Ок");
КонецПроцедуры
