///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	УстановитьКомпактныйРежимФормНаСервере(ПользовательИБ);
	
	// Найдём пользователя в справочнике Сотрудники
	Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ПользовательИБ.Имя, Истина);
	Если Сотрудник.Пустая() Тогда
		// Зарегистрировать
		Сотрудник = Справочники.Сотрудники.СоздатьЭлемент();
		Сотрудник.Наименование = ПользовательИБ.Имя;
		Сотрудник.Записать();
	КонецЕсли; 
	Пользователь = Сотрудник.Ссылка;
	
	ПараметрыСеанса.Пользователь = Пользователь;
	ПараметрыСеанса.Интерфейс = Строка(ПользовательИБ.ОсновнойИнтерфейс);
	ПараметрыСеанса.Администратор = ПользовательИБ.Роли.Содержит(Метаданные.Роли.Администратор);
	ПараметрыСеанса.Отдел = Привязка.ПолучитьОтделСотрудника(Пользователь, ТекущаяДата());
	ПараметрыСеанса.ВремяСеанса = 0;
	
	глДневнаяНорма = ОбщийМодульИнформация.ПолучитьДневнуюНорму(ТекущаяДата(), ПараметрыСеанса.Отдел);
	ПараметрыСеанса.глДневнаяНорма = глДневнаяНорма;
	
	
	 текРоль=ПользовательИБ.Роли; 
	
	 
	 
	 отделЮристы=Справочники.Отделы.НайтиПоНаименованию("Юристы",Истина);
	 
	 массивЮристы=Новый Массив;
	 
	 
	    			       	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	    			// Данный фрагмент построен конструктором.
	    			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	    			
	    			Запрос = Новый Запрос;
	    			Запрос.Текст = 
	    				"ВЫБРАТЬ
	    				|	СотрудникиОтделов.Сотрудник КАК Сотрудник,
	    				|	СотрудникиОтделов.Отдел КАК Отдел
	    				|ИЗ
	    				|	РегистрСведений.СотрудникиОтделов КАК СотрудникиОтделов
	    				|ГДЕ
	    				|	СотрудникиОтделов.Отдел = &Отдел";
	    			
	    			Запрос.УстановитьПараметр("Отдел", отделЮристы);
	    			
	    			РезультатЗапроса = Запрос.Выполнить();
	    			
	    			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	    			
	    			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    				// Вставить обработку выборки ВыборкаДетальныеЗаписи
						
						массивЮристы.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
						
	    			КонецЦикла;
	    			
	    			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	    			
					
	Индекс = массивЮристы.Найти(Пользователь);				
					
	  Если Индекс<>Неопределено   Тогда
	//Если Пользователь=Справочники.Сотрудники.НайтиПоНаименованию("Олег", Истина)    Тогда
		
		//НастройкаНачальнойСтраницы=Новый НастройкиНачальнойСтраницы;
		//
		//СоставФорм=НастройкаНачальнойСтраницы.ПолучитьСоставФорм();
		//
		//СоставФорм.ЛеваяКолонка.Очистить();
		//
		//СоставФорм.ПраваяКолонка.Очистить();
		//
		//СоставФорм.ЛеваяКолонка.Добавить("Обработка.ТестНачальнаяСтраница.Форма");
		//
		//НастройкаНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		//ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "",НастройкаНачальнойСтраницы);
		//
		
		
			           НастройкаНачальнойСтраницы=Новый НастройкиНачальнойСтраницы;
		
						СоставФорм=НастройкаНачальнойСтраницы.ПолучитьСоставФорм();
						
						СоставФорм.ЛеваяКолонка.Очистить();
						
						СоставФорм.ПраваяКолонка.Очистить();
						
						СоставФорм.ЛеваяКолонка.Добавить("Обработка.НачальнаяСтраницаЮристы.Форма");
						
						НастройкаНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
				        ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "",НастройкаНачальнойСтраницы);
						

		
		
	КонецЕсли;
	
	       массивЮристы=Новый Массив;
	    
	        отделЮристы=Справочники.Отделы.НайтиПоНаименованию("Юристы");
	
				    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	АдресацияЗадачПоОтделам.Сотрудник КАК Сотрудник
					|ИЗ
					|	РегистрСведений.АдресацияЗадачПоОтделам КАК АдресацияЗадачПоОтделам
					|ГДЕ
					|	АдресацияЗадачПоОтделам.Отдел = &Отдел";
				
				Запрос.УстановитьПараметр("Отдел", отделЮристы);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					 массивЮристы.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
		//		Если массивЮристы.Найти(Пользователь)<>Неопределено  Тогда
		//			
		//		      	НастройкаНачальнойСтраницы=Новый НастройкиНачальнойСтраницы;
		//
		//				СоставФорм=НастройкаНачальнойСтраницы.ПолучитьСоставФорм();
		//				
		//				СоставФорм.ЛеваяКолонка.Очистить();
		//				
		//				СоставФорм.ПраваяКолонка.Очистить();
		//				
		//				СоставФорм.ЛеваяКолонка.Добавить("Обработка.НачальнаяСтраницаЮристы.Форма");
		//				
		//				НастройкаНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		//		        ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "",НастройкаНачальнойСтраницы);
		//				
		//							
		//		
		//		КонецЕсли;
		//		
		//		
				
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

&НаСервере
Процедура УстановитьКомпактныйРежимФормНаСервере(лПользователь)
	РежимКомпактности = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
	
	Если Не лПользователь = Неопределено Тогда
		
		Настройка = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "",, лПользователь.Имя);
		
		Если Не ТипЗнч(Настройка) = Тип("НастройкиКлиентскогоПриложения") Тогда
			Настройка = Новый НастройкиКлиентскогоПриложения;
		КонецЕсли;
		
		Настройка.ВариантМасштабаФормКлиентскогоПриложения = РежимКомпактности;
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", Настройка,, лПользователь.Имя);
		
	КонецЕсли;
	
	   
	
КонецПроцедуры