

&НаКлиенте
Процедура Добавить(Команда)
	// Вставить содержимое обработчика.
	
	 ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеДляПоиска",ЭтотОбъект); 
		
	//ДанныеВыбора = Новый Структура("Договор, Должник");
	ОткрытьФорму("Справочник.Договоры.Форма.ФормаВыбораДогДолж",,ЭтаФорма,,,,ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляПоиска(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

			 Если РезультатЗакрытия= Неопределено Тогда
		         Возврат;
		
		     Иначе
				  
				 
				 Для каждого стр Из РезультатЗакрытия Цикл
				 
				 	    стрТабл=Объект.Договора.Добавить();
				        стрТабл.Договор=стр.Ссылка;
				    	стрТабл.Должник=стр.Владелец;

				 
				 КонецЦикла;
				 
				
				 
				 
				 
			 КонецЕсли;
	
	
КонецПроцедуры




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Объект.Автор=ПараметрыСеанса.Пользователь;
	
КонецПроцедуры


