
&НаКлиенте
Процедура БанкМногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
     СтандартнаяОбработка=Ложь;
	 ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораБанки",ЭтаФорма);

	 ОткрытьФорму("Справочник.Банки.Форма.ФормаВыбораМного",,ЭтаФорма,,,,ОповещениеОЗакрытии); 
	
	

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Банк", МногоБанков.ВыгрузитьЗначения());
	
	
	
	СписокПараметров.Вставить("НомерДоговораЦессии", НомерДоговораЦессии);
	
	СписокПараметров.Вставить("ДатаЦессииОт", НачалоДатаЦессии);
	
	СписокПараметров.Вставить("ДатаЦессииДо", ДатаЦессииКонец);
	
	СписокПараметров.Вставить("ФИОДолжника", ФИОДолжника);
	
	СписокПараметров.Вставить("ДоговораМ", МногоДоговоров);
	
	СписокПараметров.Вставить("НетИсполнителя", НетИсполнителя);
	
	СписокПараметров.Вставить("ШифрДокумента", ШифрДокумента);
	
	
	
	СписокПараметров.Вставить("ОтменаПоиска", СброситьФильтр);
	
	
	
	
	
	
	
	ОповеститьОВыборе(СписокПараметров);
	
КонецПроцедуры


&НаКлиенте
Процедура НайтиДанные(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	  Банк=Параметры.Банк;
	
	
КонецПроцедуры



&НаКлиенте
Процедура НомерДоговораЦессииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	
	ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбора",ЭтаФорма); 

	ОткрытьФорму("Справочник.ДоговорЦессии.Форма.ФормаВыбора",,ЭтаФорма,,,,ОповещениеОЗакрытии);
	
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура ДанныеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
		  Иначе
			  
			НомерДоговораЦессии=РезультатЗакрытия.НомерДоговора;			  
			  
			  
		 КонецЕсли;  
		  
	

КонецПроцедуры

&НаКлиенте
Процедура НомерКДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	         ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораКД",ЭтаФорма);
			 
			ОткрытьФорму("Справочник.Договоры.Форма.ФормаВыбораДогДолж",,ЭтаФорма,,,,ОповещениеОЗакрытии); 
	
	
КонецПроцедуры
		

&НаКлиенте
Процедура ДанныеВыбораКД(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
		  Иначе
			  
			  массивДоговора=РезультатЗакрытия;
			  
			 МногоДоговоров.ЗагрузитьЗначения(массивДоговора);
			 
			 строкаМногоДоговоров="";
			  Для каждого стр Из массивДоговора  Цикл
				  
				  строкаМногоДоговоров=строкаМногоДоговоров+стр.НомерДоговора+" ";
				  
			  	
			  
			  КонецЦикла;		

			  
			  НомерКД=строкаМногоДоговоров;
			  
						  
		 КонецЕсли;  
		  
	

КонецПроцедуры



&НаКлиенте
Процедура ДанныеВыбораБанки(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
		  Иначе
			  
			  массивБанк=РезультатЗакрытия.Банкимассив;
			  
			  МногоБанков.ЗагрузитьЗначения(массивБанк);
			  
			   строкаМногоБанков="";
			  Для каждого стр Из массивБанк  Цикл
				  
				  строкаМногоБанков=строкаМногоБанков+Строка(стр)+" ";
				  
			  	
			  
			  КонецЦикла;		
			   
			    БанкМного=строкаМногоБанков;
			  
			  
			  
		 КонецЕсли;  
		  
	

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоиск(Команда)
	
	СброситьФильтр=Истина;
	
	ЭтаФорма.Закрыть();
	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеВходящегоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	    ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеДляПоискаПоВходящим",ЭтотОбъект); 
		
		ОткрытьФорму("Обработка.НачальнаяСтраницаЮристы.Форма.ФормаНаименованиеВходящиеДокументы",,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
	
КонецПроцедуры


&НаКлиенте
Процедура ДанныеДляПоискаПоВходящим(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия= Неопределено Тогда
	     Возврат;
		
	
	Иначе
        
		  
		  НаименованиеВходящегоДокумента=РезультатЗакрытия.НаименованиеДокумента;
		  ШифрДокумента= РезультатЗакрытия.ШифрДокумента;
		  
		
	КонецЕсли; 	
	
КонецПроцедуры


		
		
		






