&НаСервере
Процедура ОбработатьФоновоеЗадание() Экспорт
	
	МенеджСВ = Новый МенеджерСистемыВзаимодействия;
	
	Обсуждение = МенеджСВ.СоздатьОбсуждение();
	
	Обсуждение.Заголовок = "Проведение платежей";
	
	Обсуждение.Участники.Добавить(МенеджСВ.ИдентификаторТекущегоПользователя());
	Обсуждение.Записать();
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Платежи.Номер КАК Номер,
		|	Платежи.Дата КАК Дата,
		|	Платежи.Комментарий КАК Комментарий,
		|	Платежи.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Платежи КАК Платежи
		|ГДЕ
		|	Платежи.ПометкаУдаления = &ПометкаУдаления
		|	И Платежи.Проведен = &Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	Запрос.УстановитьПараметр("Проведен", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	кол=ВыборкаДетальныеЗаписи.Количество();
	
	
	
	        Сообщ = МенеджСВ.СоздатьСообщение(Обсуждение.Идентификатор);
			 УстановитьПривилегированныйРежим(Истина);
			 Сообщ.Автор = МенеджСВ.ИдентификаторТекущегоПользователя();
			 Сообщ.Дата = ТекущаяДата(); 			 
			 
			 Сообщ.Текст = "Всего надо провесть  " + Строка(кол) + " платежей.";
			 
			 Попытка
			 
			 	Сообщ.Записать();
			 
			 Исключение
			 
			 КонецПопытки;
			 
    	      УстановитьПривилегированныйРежим(Ложь);

	 
	
	
	 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
			// подсчитать %  кол
		
		     Сообщ = МенеджСВ.СоздатьСообщение(Обсуждение.Идентификатор);
			 УстановитьПривилегированныйРежим(Истина);
			 Сообщ.Автор = МенеджСВ.ИдентификаторТекущегоПользователя();
			 Сообщ.Дата = ТекущаяДата(); 			 
			 
			 Сообщ.Текст = "Выполненяется проведение платежа № : " + Строка(ВыборкаДетальныеЗаписи.Номер);
			 
			 Попытка
			 
			 	Сообщ.Записать();
			 
			 Исключение
			 
			 КонецПопытки;
			 
    	      УстановитьПривилегированныйРежим(Ложь);

			 
			 Сообщ = МенеджСВ.СоздатьСообщение(Обсуждение.Идентификатор);
			 УстановитьПривилегированныйРежим(Истина);
			 Сообщ.Автор = МенеджСВ.ИдентификаторТекущегоПользователя();
			 Сообщ.Дата = ТекущаяДата();			 
		
		     ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
             ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		 
			 
			 
			 Сообщ.Текст = "Проведен платежа № : " + Строка(ВыборкаДетальныеЗаписи.Номер);
			 
			 Попытка
			 
			 	Сообщ.Записать();
			 
			 Исключение
			 
			 КонецПопытки;
			 
			 
			 УстановитьПривилегированныйРежим(Ложь);
			 
			 
			 
		     Сообщ = МенеджСВ.СоздатьСообщение(Обсуждение.Идентификатор);
			 УстановитьПривилегированныйРежим(Истина);
			 Сообщ.Автор = МенеджСВ.ИдентификаторТекущегоПользователя();
			 Сообщ.Дата = ТекущаяДата();			 
		  
			 кол=кол-1;
			 Сообщ.Текст = " Осталось провести -  " + Строка(кол)+" платежей";
			 
			 Попытка
			 
			 	Сообщ.Записать();
			 
			 Исключение
			 
			 КонецПопытки;
			 
			 
			 УстановитьПривилегированныйРежим(Ложь);
				

		 
		 
		
	КонецЦикла;

	         Сообщ = МенеджСВ.СоздатьСообщение(Обсуждение.Идентификатор);
			 УстановитьПривилегированныйРежим(Истина);
			 Сообщ.Автор = МенеджСВ.ИдентификаторТекущегоПользователя();
			 Сообщ.Дата = ТекущаяДата();			 
			 
			 Сообщ.Текст = "Проведены все платежи  ";
			 
			 Попытка
			 
			 	Сообщ.Записать();
			 
			 Исключение
			 
			 КонецПопытки;
			 
    	      УстановитьПривилегированныйРежим(Ложь);

	
	
	
		
	
	
	
КонецПроцедуры