

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
       ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
 	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтатусыНаСервере()
	
	 ФайлДанных = ИмяФайла;
		
	   ФайлЕксел.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();
	   
	    Для каждого стр Из ТаблицаЗначений Цикл
		   
			
			 Если  стр.НомерКредитногоДоговора<>"" и стр.ЮрСтатус<>""  Тогда
			 	 
				 ЗаписатьЮрСтатусПоДоговору(стр.НомерКредитногоДоговора,стр.ЮрСтатус,стр.ФИО); 
				 //Сообщить(стр.ВидКредита+"-"+стр.НомерДоговора);
				 //ЗаписатьТипКредитаДляДоговора(стр.НомерДоговора,стр.ВидКредита);
			
			КонецЕсли;
	   
	   КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЮрСтатусПоДоговору(дог,юрстатус,фиодол)
	
	 // найду дог 
	 
	                    догСсылка=Неопределено;
						должСсылка=Неопределено;
						//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						// Данный фрагмент построен конструктором.
						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	Договоры.Ссылка КАК Ссылка,
							|	Договоры.Владелец КАК Владелец
							|ИЗ
							|	Справочник.Договоры КАК Договоры
							|ГДЕ
							|	Договоры.НомерДоговора = &НомерДоговора
							|	И Договоры.Владелец.Наименование = &Наименование";
						
						Запрос.УстановитьПараметр("Наименование", фиодол);
						Запрос.УстановитьПараметр("НомерДоговора", дог);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							догСсылка=ВыборкаДетальныеЗаписи.Ссылка;
							должСсылка=ВыборкаДетальныеЗаписи.Владелец;
						КонецЦикла;
						
						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

						
						Если догСсылка<>Неопределено Тогда
							
							спрСудСтатус=Справочники.СудебныеСтатусы.НайтиПоНаименованию(юрстатус,Истина);
							
							Если спрСудСтатус<>Справочники.СудебныеСтатусы.ПустаяСсылка() Тогда
								
								// записать в ДоговорыСудебныеСтатусы
								новыйЭлементДогСудСт=Справочники.ДоговорыСудебныеСтатусы.СоздатьЭлемент();
								
								новыйЭлементДогСудСт.Владелец=должСсылка;
								новыйЭлементДогСудСт.Договор=догСсылка;
								новыйЭлементДогСудСт.СудебныйСтатус=спрСудСтатус;
								новыйЭлементДогСудСт.ДатаСудСтатус=ТекущаяДата();
								новыйЭлементДогСудСт.Записать();
								
								
																
							Иначе	
								Сообщить("Нет такого судебного статуса -"+юрстатус);
								
							
							КонецЕсли;
							
							
							
						
						КонецЕсли;

						
					
					
					
	
	

КонецПроцедуры

   

&НаКлиенте
Процедура ЗагрузитьСтатусы(Команда)
	ЗагрузитьСтатусыНаСервере();
	Сообщить("Ок");
КонецПроцедуры
