
Процедура ПриЗаписи(Отказ)
	
	
			//БП_Делопроизводство=БизнесПроцессы.БизнесПроцесс_Делопроизводство.СоздатьБизнесПроцесс();
			//БП_Делопроизводство.Дата=ТекущаяДата();
			//БП_Делопроизводство.Автор=Ссылка.Сотрудник;
			//БП_Делопроизводство.Делопроизводство=Ссылка;
			//БП_Делопроизводство.Наименование="БП_Отдел_"+Ссылка.ОтделРабота+"_Вид документа-"+Ссылка.ВидДокумента+"_Номер дела-"+Ссылка.НомерДела;
			//БП_Делопроизводство.ДатаЗавершения=ТекущаяДата()+60*60*24*7;
			//БП_Делопроизводство.Должник=Ссылка.Владелец;
			//БП_Делопроизводство.ОтделРабота=Ссылка.ОтделРабота;
			//БП_Делопроизводство.Записать();
			//БП_Делопроизводство.Старт();
			//
			//
			////Создать напоминание для отдела
			//СоздатьНапоминаниеДляОтдела(Ссылка.ОтделРабота);
			// 
	
	
КонецПроцедуры


&НаСервере
Процедура СоздатьНапоминаниеДляОтдела(судСтадия)

			   
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	АдресацияЗадачПоОтделам.Сотрудник КАК Сотрудник
				|ИЗ
				|	РегистрСведений.АдресацияЗадачПоОтделам КАК АдресацияЗадачПоОтделам
				|ГДЕ
				|	АдресацияЗадачПоОтделам.Отдел = &Отдел";
			
			Запрос.УстановитьПараметр("Отдел", судСтадия);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				
				
				 наименованиеСотр=СтрЗаменить(ВыборкаДетальныеЗаписи.Сотрудник.Наименование,"_"," "); 
				
				 спрПользователь=Справочники.Пользователи.НайтиПоНаименованию(наименованиеСотр);
						
								
											
				
				
				
				
				 СрокНапоминания = НачалоДня(ТекущаяДата());
				 НапоминаниеТекст = "Выполнить задание ";
				 ПараметрыНапоминания    = Новый Структура;   
				 ПараметрыНапоминания.Вставить("Пользователь",спрПользователь);
				ПараметрыНапоминания.Вставить("ВремяСобытия"    , ТекущаяДата());
				ПараметрыНапоминания.Вставить("Источник"        , Ссылка);
				ПараметрыНапоминания.Вставить("Описание"        , НапоминаниеТекст);
				ПараметрыНапоминания.Вставить("СрокНапоминания", СрокНапоминания);
				ПараметрыНапоминания.Вставить("СпособУстановкиВремениНапоминания", Перечисления.СпособыУстановкиВремениНапоминания.Периодически);
				НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания);
				
				
				
				
				
			КонецЦикла;
			
КонецПроцедуры



