
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	// Вставить содержимое обработчика.
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		 ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
		
		//// Получение двоичные данные файла
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
		//// Передача двоичных данные на сервер
		ПрикрепитьФайлСервер(ДвоичныеДанные);
		
		
	Иначе
		Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
		Предупреждение(НСтр(Текст));
	КонецЕсли;
	
	
	
	Сообщить("1111");
КонецПроцедуры


&НаСервере
Процедура ПрикрепитьФайлСервер(ДвоичныеДанные) // Обработчик на сервере записи файла в ИБ 
	
	
	// Трансформируем объект формы в справочник-объект
	ОбъектТекущий = РеквизитФормыВЗначение("Объект");   	
	// Присваиваем новое значение реквизиту "Данные"
	ОбъектТекущий.ФайлШаблона = Новый ХранилищеЗначения(ДвоичныеДанные); 	
	
	ОбъектТекущий.Наименование=Объект.Наименование;
	// Сохраняем изменения
	ОбъектТекущий.Записать(); 
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	  Если НЕ ЭтаФорма.Параметры.Ключ.Пустая() Тогда
	  
	    Элементы.ВыбратьФайл.Видимость=Истина;	
	  
	  КонецЕсли;
	
	
КонецПроцедуры



