
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПривязкаДоговор
	Движения.ПривязкаДоговор.Записывать = Истина;
	Для Каждого ТекСтрокаДоговора Из Договора Цикл
		Движение = Движения.ПривязкаДоговор.Добавить();
		Движение.Период = Дата;
		Движение.Договор = ТекСтрокаДоговора.Договор;
		Движение.Сотрудник = Сотрудник;
		Движение.СотрМенеджер = СотрМенеджер;
		Движение.ДатаПодгрузки = ТекСтрокаДоговора.ДатаПодгрузки;
		
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
