Процедура ОбработкаПроведения(Отказ, Режим)
	Отказ = ДоступностьИзмененийПоДатеЗапрета(Дата);
	
	ПустойСотрудник = Справочники.Сотрудники.ПустаяСсылка();
	Архив = Константы.Архив.Получить();
	Для Каждого ТекСтрокаДолжники Из Должники Цикл
		// регистр ПривязкаСотрудник 
		Движение = Движения.ПривязкаСотрудник.Добавить();
		Движение.Период 	= Дата;
		Движение.Должник 	= ТекСтрокаДолжники.Должник;
		Движение.Сотрудник 	= ПустойСотрудник;
		Движение.Менеджер 	= ПустойСотрудник;
		
		// регистр ПривязкаОтдел 
		Движение = Движения.ПривязкаОтдел.Добавить();
		Движение.Период 		= Дата;
		Движение.Должник 		= ТекСтрокаДолжники.Должник;
		Движение.Отдел 			= Архив;
		Движение.СвободныйПул 	= Ложь;
		
		// регистр ПривязкаОтветственный 
		Движение = Движения.ПривязкаОтветственный.Добавить();
		Движение.Период 		= Дата;
		Движение.Должник 		= ТекСтрокаДолжники.Должник;
		Движение.Ответственный 	= ПустойСотрудник;
	КонецЦикла;
		
	// Регистрация количества передач
	// Передал
	Движение = Движения.Передачи.Добавить();
	Движение.Период 		= Дата;
	Движение.Сотрудник 		= Автор;
	Движение.Передал 		= Должники.Количество();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Должники.Свернуть("Должник", "");
КонецПроцедуры

