
Процедура ОбработкаПроведения(Отказ, Режим)
	Перем Запрос;
	Перем КорДок;
	Отказ = ДоступностьИзмененийПоДатеЗапрета(Дата);
	// Получить данные для расчета
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачальныеДанныеДоговораСрезПоследних.ПроцентВознаграждения,
	|	ПлатежиДолжники.НомерСтроки
	|ИЗ
	|	Документ.Платежи.Должники КАК ПлатежиДолжники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачальныеДанныеДоговора.СрезПоследних КАК НачальныеДанныеДоговораСрезПоследних
	|		ПО ПлатежиДолжники.Договор = НачальныеДанныеДоговораСрезПоследних.Договор
	|ГДЕ
	|	ПлатежиДолжники.Ссылка = &ТекущийДокумент";
	
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка); 
	
	тзПроцентыВознаграждения = Запрос.Выполнить().Выгрузить();
	
	
	
	Для Каждого ТекСтрокаДолжники Из Должники Цикл
		Если ТекСтрокаДолжники.ДатаПлатежа = '00010101' Тогда
			ДатаПлатежа	= Дата;
		Иначе
			ДатаПлатежа	= ТекСтрокаДолжники.ДатаПлатежа;
		КонецЕсли; 
		Ответственный 	= Привязка.ПолучитьОтветственного(ТекСтрокаДолжники.Должник, НачалоДня(ДатаПлатежа));
		Сотрудник 		= Привязка.ПолучитьСотрудникаАктивного(ТекСтрокаДолжники.Должник, НачалоДня(ДатаПлатежа));
			
		НайденнаяСтрока = тзПроцентыВознаграждения.Найти(ТекСтрокаДолжники.НомерСтроки, "НомерСтроки");
		Если НайденнаяСтрока = Неопределено Тогда
		    Сообщить("Процент вознаграждения = 0. Реестром не загружены данные по договору: " + Строка(ТекСтрокаДолжники.Договор), СтатусСообщения.Внимание);
			ПроцентВознаграждения = 0;
		Иначе
		    ПроцентВознаграждения = НайденнаяСтрока.ПроцентВознаграждения;
		КонецЕсли;
		
	    
         

		
		// регистр Платежи 
		Движение = Движения.Платежи.Добавить();
		Движение.Период 				= ДатаПлатежа;
		Движение.Ответственный 			= Сотрудник;
		Движение.Должник 				= ТекСтрокаДолжники.Должник;
		Движение.Договор 				= ТекСтрокаДолжники.Договор;
		Движение.Сумма 					= -ТекСтрокаДолжники.Сумма;
		Движение.Количество				= 1;
		Движение.Вознаграждение 		= ТекСтрокаДолжники.Сумма * ?(ПроцентВознаграждения = Null,0,ПроцентВознаграждения) / 100;
		Движение.ПроцентВознаграждения 	= ПроцентВознаграждения;  
		Движение.Сотрудник 				= Сотрудник;
		// +Крылов 2011.03.05
		Движение.Реестр 				= ПолучитьРеестрДолжника(ДатаПлатежа,ТекСтрокаДолжники.Должник,ТекСтрокаДолжники.Договор);

		
				
		// регистр Платежи 
		Движение = Движения.Платежи.Добавить();
		Движение.Период 				= ДатаПлатежа;
		Движение.Ответственный 			= ТекСтрокаДолжники.НовСотрудник;
		Движение.Должник 				= ТекСтрокаДолжники.Должник;
		Движение.Договор 				= ТекСтрокаДолжники.Договор;
		Движение.Сумма 					= ТекСтрокаДолжники.Сумма;
		Движение.Количество				= 1;
		Движение.Вознаграждение 		= ТекСтрокаДолжники.Сумма * ?(ПроцентВознаграждения = Null,0,ПроцентВознаграждения) / 100;
		Движение.ПроцентВознаграждения 	= ПроцентВознаграждения;  
		Движение.Сотрудник 				= ТекСтрокаДолжники.НовСотрудник;
		// +Крылов 2011.03.05
		Движение.Реестр 				= ПолучитьРеестрДолжника(ДатаПлатежа,ТекСтрокаДолжники.Должник,ТекСтрокаДолжники.Договор);

	

	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРеестрДолжника(ДатаПлатежа,Должник,Договор)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПлатежа",ДатаПлатежа);
	Запрос.УстановитьПараметр("Должник",Должник);
	Запрос.УстановитьПараметр("Договор",Договор);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеестрДолжники.Ссылка
	|ИЗ
	|	Документ.Реестр.Должники КАК РеестрДолжники
	|ГДЕ
	|	РеестрДолжники.Должник = &Должник
	|	И РеестрДолжники.Ссылка.Дата <= &ДатаПлатежа
	|	И РеестрДолжники.Договор = &Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеестрДолжники.Ссылка.Дата УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.Реестр.ПустаяСсылка();
	
КонецФункции



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	//Если Должники.Количество() = 0 Тогда 
	//	Комментарий = Формат(Дата, "ДФ=dd.MM.yyyy");
	//ИначеЕсли Должники.Количество() = 1 Тогда
	//	Комментарий = Формат(Должники[0].ДатаПлатежа, "ДФ=dd.MM.yyyy");
	//Иначе	
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("Должники", Должники);
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	Должники.ДатаПлатежа КАК Мин,
	//	|	Должники.ДатаПлатежа КАК Макс
	//	|ПОМЕСТИТЬ ВТ_Должники
	//	|ИЗ
	//	|	&Должники КАК Должники
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	МИНИМУМ(ВТ_Должники.Мин) КАК Мин,
	//	|	МАКСИМУМ(ВТ_Должники.Макс) КАК Макс
	//	|ИЗ
	//	|	ВТ_Должники КАК ВТ_Должники";
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Если Выборка.Следующий() Тогда
	//		Комментарий = Формат(Выборка.Мин, "ДФ=dd.MM.yyyy") + " - " + Формат(Выборка.Макс, "ДФ=dd.MM.yyyy");
	//	КонецЕсли;
	//КонецЕсли;	
	
КонецПроцедуры
// -Крылов 2011.03.05

