
&НаКлиенте
Процедура Старт(Команда)
	// Вставить содержимое обработчика.
	
	Поменять();
	
	Сообщить("Ок"); 
КонецПроцедуры



&НаСервере
Процедура Поменять()

	//Ямало-Ненецкий   89
	
	 //НомОбъект = НоменклатураСсылка.ПолучитьОбъект();
	 //НомОбъект.Состав.Цена = Цена;
	 //НомОбъект.Записать(); 
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Регионы.Ссылка КАК Ссылка,
		|	Регионы.Наименование КАК Наименование,
		|	Регионы.КодРегионаФССП КАК КодРегионаФССП
		|ИЗ
		|	Справочник.Регионы КАК Регионы
		|ГДЕ
		|	Регионы.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование","%Ямало-Ненецкий%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		   НомОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		   НомОбъект.КодРегионаФССП="89"; 
		   НомОбъект.СинонимФСПП="Ямало-Ненецкий";
		   
		   НомОбъект.Записать();
		   
		   
		   
		
	КонецЦикла;
	
	

	 
	 
	 

КонецПроцедуры
