
&НаСервере
Процедура ЗаполнитьОчередьНаСервере()
	Объект.ПорядокПогашенияЗадолженности.Очистить();
	
	Для Каждого Реквизит из Метаданные.Документы.Реестр.ТабличныеЧасти.Должники.Реквизиты Цикл 
		Если Реквизит.Тип.СодержитТип(Тип("Число")) Тогда
			ТекСтрока = Объект.ПорядокПогашенияЗадолженности.Добавить();
			ТекСтрока.Задолженность = Реквизит.Имя; 
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОчередностьПогашенияДолга(Команда)
	ЗаполнитьОчередьНаСервере();
КонецПроцедуры
