
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	   ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));

	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВБазуНаСервере()
	// Вставить содержимое обработчика.
	
	   ФайлДанных = ИмяФайла;
		
	   ФайлЕксел.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();
	   
	    Для каждого стр Из ТаблицаЗначений Цикл
		   
			// ВидКредита    НомерДоговора
			 Если  стр.ВидКредита<>"" и стр.НомерДоговора<>""  Тогда
			 	 
				 //Сообщить(стр.ВидКредита+"-"+стр.НомерДоговора);
				 ЗаписатьТипКредитаДляДоговора(стр.НомерДоговора,стр.ВидКредита);
			
			КонецЕсли;
	   
	   КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьТипКредитаДляДоговора(дог,типкр)

	
	   спрТипыКредитов=Неопределено;
	   
	   спрТипыКредитов=Справочники.ТипыКредитов.НайтиПоНаименованию(типкр,Истина);
	   
	   Если  спрТипыКредитов =Справочники.ТипыКредитов.ПустаяСсылка() Тогда
		   
		     спрТипыКредитов=Справочники.ТипыКредитов.СоздатьЭлемент();
			 
			 спрТипыКредитов.Наименование=типкр;
			 
			 спрТипыКредитов.Записать();
			 
	   
	   КонецЕсли;

	   // найду договор по номеру
	   
	                    догСсылка=Неопределено; 
	                	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						// Данный фрагмент построен конструктором.
						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	Договоры.Ссылка КАК Ссылка
							|ИЗ
							|	Справочник.Договоры КАК Договоры
							|ГДЕ
							|	Договоры.НомерДоговора = &НомерДоговора";
						
						Запрос.УстановитьПараметр("НомерДоговора", дог);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							догСсылка=ВыборкаДетальныеЗаписи.Ссылка;
							
						КонецЦикла;
						
						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

						
						Если догСсылка<>Неопределено Тогда
							
							догОб=догСсылка.ПолучитьОбъект();
							
							догОб.ТипКредита=спрТипыКредитов;
							
							догОб.Записать();
							
						
						КонецЕсли;
						
						
	   
	   

 КонецПроцедуры
 
 
   



&НаКлиенте
Процедура ЗаписатьВБазу(Команда)
	ЗаписатьВБазуНаСервере();
	Сообщить("Ок");
	
КонецПроцедуры
