
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресатСуд=Истина;
		
	
	массНомерЦессии=Параметры.НомерЦессии;
	
	массНазваниеДокументов=Параметры.НазваниеДокумента;
	
	
	инд=0;
	СП = Новый СписокЗначений();
	Для каждого стр Из массНомерЦессии Цикл
		
		     СП.Добавить(стр);
	    
	    
		 Элементы.ДоговорЦессии.СписокВыбора.Вставить(инд,стр);
		 инд=инд+1;
	
   КонецЦикла;
   
     
   
   
	инд=0;
	Для каждого стр Из массНазваниеДокументов Цикл
	
     Элементы.НазваниеДокумента.СписокВыбора.Вставить(инд,стр);
     инд=инд+1;
	
   КонецЦикла;
 
    Если Параметры.ФильтрУстановлен Тогда
		
		найдЭл=Элементы.ДоговорЦессии.СписокВыбора.НайтиПоЗначению(Параметры.ДоговорЦессииФильтр);
		инд= Элементы.ДоговорЦессии.СписокВыбора.Индекс(найдЭл);
		ДоговорЦессии = Элементы.ДоговорЦессии.СписокВыбора[инд].Значение;
		
		
		найдЭл=Элементы.НазваниеДокумента.СписокВыбора.НайтиПоЗначению(Параметры.НазваниеДокументаФильтр);
		инд= Элементы.НазваниеДокумента.СписокВыбора.Индекс(найдЭл);
        НазваниеДокумента= Элементы.НазваниеДокумента.СписокВыбора[инд].Значение;
		
		УстановитьВидимостьЕслиФильтр(Параметры.НазваниеДокументаФильтр);

	       	
		ПечататьКопияДоговораЦессии=Параметры.ПечататьКопияДоговораЦессии;
		
		ПечататьСвидетельстваОРегистрацииЮрЛица=Параметры.ПечататьСвидетельстваОРегистрацииЮрЛица;
		   
		ПечатьВыпискаИзРеестра=Параметры.ПечатьВыпискаИзРеестра;
		ПечатьДоверенностьПредставителя=Параметры.ПечатьДоверенностьПредставителя;
		
		ПечатьДосьеКлиента=Параметры.ПечатьДосьеКлиента ;
		
		ПечатьКопииУчредительныхДокументовКомпании=Параметры.ПечатьКопииУчредительныхДокументовКомпании;
		ПечатьКопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав=Параметры.ПечатьКопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав;
		ПечатьКопияРеестраУступаемыхПрав=Параметры.ПечатьКопияРеестраУступаемыхПрав;
		
		ПечатьКопияУведомленияОбУступкеПраваТребования=Параметры.ПечатьКопияУведомленияОбУступкеПраваТребования;
		
		ПечатьНаименование=Параметры.ПечатьНаименование;
		
		
		
		
		
		
		
		
		//   ПечатьНаименование=Истина;

		//
		
		
		
		
	
	Иначе
	
		   ПечататьКопияДоговораЦессии=Истина;
		   ПечататьСвидетельстваОРегистрацииЮрЛица=Истина;
		   ПечатьВыпискаИзРеестра=Истина;
		   ПечатьДоверенностьПредставителя=Истина;
		   ПечатьДосьеКлиента=Истина;
		   ПечатьКопииУчредительныхДокументовКомпании=Истина;
		   ПечатьКопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав=Истина;
		   ПечатьКопияРеестраУступаемыхПрав=Ложь;
		   ПечатьКопияУведомленияОбУступкеПраваТребования=Истина;
		   ПечатьНаименование=Истина;

		
	
	КонецЕсли;
	
   //Заявления о праве преемственности
	//Заявление о выдаче судебного приказа
	
	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьЕслиФильтр(стр)

	   
	Если стр="Заявления о праве преемственности" Тогда
		
		      Элементы.ГруппаКопияДоговораЦессии.Видимость=Истина;
		      КопияДоговораЦессии="Договор Цессии";
			  Элементы.КопияДоговораЦессии.Ширина=25;
			  
			  Элементы.ГруппаКопияРеестраУступаемыхПрав.Видимость=Истина;
			  КопияРеестраУступаемыхПрав="Реестр Уступаемых Прав";
			  
			  Элементы.ГруппаСвидетельстваОРегистрацииЮрЛица.Видимость=Истина;
			  КопияСвидетельстваОРегистрацииЮрЛица="Свидетельство О Регистрации ЮрЛица";
			  
              Элементы.ГруппаКопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав.Видимость=Истина;
			  КопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав="Платежное Поручение Подтверждающее Оплату По Договору Уступки Прав";
			  
			  Элементы.ГруппаДоверенностьПредставителя.Видимость=Истина;
			  КопияДоверенностьПредставителя="Доверенность Представителя";
			  
			  Элементы.ГруппаДосьеКлиента.Видимость=Ложь;
			  Элементы.ГруппаУчредительныхДокументовКомпании.Видимость=Ложь;
			  
			  Элементы.ГруппаКопияУведомленияОбУступкеПраваТребования.Видимость=Ложь;
			  Элементы.ГруппаВыпискаИзРеестра.Видимость=Ложь;
			  
			  
	
   КонецЕсли;
   
   
   
   Если стр="Заявление о выдаче судебного приказа" Тогда
	   
	   
              Элементы.ГруппаДосьеКлиента.Видимость=Истина;
			  КопияДосьеКлиента="Досье Клиента";
			  
			  Элементы.ГруппаКопияДоговораЦессии.Видимость=Истина;
		      КопияДоговораЦессии="Договор Цессии";
			  Элементы.КопияДоговораЦессии.Ширина=25;

			  Элементы.ГруппаКопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав.Видимость=Истина;
			  КопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав="Платежное Поручение Подтверждающее Оплату По Договору Уступки Прав";
			 
			  
			  
			  Элементы.ГруппаСвидетельстваОРегистрацииЮрЛица.Видимость=Ложь;
			   
			  Элементы.ГруппаУчредительныхДокументовКомпании.Видимость=Истина;
			  КопииУчредительныхДокументовКомпании="Учредительные Документы Компании";
			  
			  Элементы.ГруппаКопияУведомленияОбУступкеПраваТребования.Видимость=Истина;
			  КопияУведомленияОбУступкеПраваТребования="Уведомление Об Уступке Права Требования";
			  
			  Элементы.ГруппаКопияРеестраУступаемыхПрав.Видимость=Истина;
			  КопияРеестраУступаемыхПрав="Реестр Уступаемых Прав";

			  
			  
			   Элементы.ГруппаВыпискаИзРеестра.Видимость=Ложь;

	КонецЕсли;
	

КонецПроцедуры







&НаКлиенте
Процедура НазваниеДокументаПриИзменении(Элемент)
	
	индЗаявленияОПравеПреемственности=Найти(Элемент.ВыделенныйТекст,"Заявление о процессуальном правопреемстве");   
	
	
	Если индЗаявленияОПравеПреемственности<>0 Тогда
		
		      Элементы.ГруппаКопияДоговораЦессии.Видимость=Истина;
		      КопияДоговораЦессии="Договор Цессии";
			  Элементы.КопияДоговораЦессии.Ширина=25;
			  
			  Элементы.ГруппаКопияРеестраУступаемыхПрав.Видимость=Истина;
			  КопияРеестраУступаемыхПрав="Реестр Уступаемых Прав";
			  
			  Элементы.ГруппаСвидетельстваОРегистрацииЮрЛица.Видимость=Истина;
			  КопияСвидетельстваОРегистрацииЮрЛица="Свидетельство О Регистрации ЮрЛица";
			  
              Элементы.ГруппаКопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав.Видимость=Истина;
			  КопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав="Платежное Поручение Подтверждающее Оплату По Договору Уступки Прав";
			  
			  Элементы.ГруппаДоверенностьПредставителя.Видимость=Истина;
			  КопияДоверенностьПредставителя="Доверенность Представителя";
			  
			  Элементы.ГруппаДосьеКлиента.Видимость=Ложь;
			  Элементы.ГруппаУчредительныхДокументовКомпании.Видимость=Ложь;
			  
			  Элементы.ГруппаКопияУведомленияОбУступкеПраваТребования.Видимость=Ложь;
			  Элементы.ГруппаВыпискаИзРеестра.Видимость=Ложь;
			  
			  
	
   КонецЕсли;
   
   
   
   Если Элемент.ВыделенныйТекст="Заявление о выдаче судебного приказа" Тогда
	   
	   
              Элементы.ГруппаДосьеКлиента.Видимость=Истина;
			  КопияДосьеКлиента="Досье Клиента";
			  
			  Элементы.ГруппаКопияДоговораЦессии.Видимость=Истина;
		      КопияДоговораЦессии="Договор Цессии";
			  Элементы.КопияДоговораЦессии.Ширина=25;

			  Элементы.ГруппаКопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав.Видимость=Истина;
			  КопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав="Платежное Поручение Подтверждающее Оплату По Договору Уступки Прав";
			 
			  
			  
			  Элементы.ГруппаСвидетельстваОРегистрацииЮрЛица.Видимость=Ложь;
			   
			  Элементы.ГруппаУчредительныхДокументовКомпании.Видимость=Истина;
			  КопииУчредительныхДокументовКомпании="Учредительные Документы Компании";
			  
			  Элементы.ГруппаКопияУведомленияОбУступкеПраваТребования.Видимость=Истина;
			  КопияУведомленияОбУступкеПраваТребования="Уведомление Об Уступке Права Требования";
			  
			  Элементы.ГруппаКопияРеестраУступаемыхПрав.Видимость=Истина;
			  КопияРеестраУступаемыхПрав="Реестр Уступаемых Прав";

			  
			  
			   Элементы.ГруппаВыпискаИзРеестра.Видимость=Ложь;

			  //Элементы.ГруппаВыпискаИзРеестра.Видимость=Истина;
			  //КопияВыпискаИзРеестра="Выписка Из Реестра";
	   
			 	
   КонецЕсли;

   
   
		  
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если  ДоговорЦессии<>"" и НазваниеДокумента<>""  Тогда
	
		 ФильтрУстановлен=Истина;

	
	КонецЕсли;	
		
	ЭтаФорма.Закрыть();

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
	
	СписокПараметров = Новый Структура;
	
	СписокПараметров.Вставить("ДоговорЦессии", ДоговорЦессии);
	СписокПараметров.Вставить("НазваниеДокумента", НазваниеДокумента);
	СписокПараметров.Вставить("ПечататьКопияДоговораЦессии", ПечататьКопияДоговораЦессии);
	СписокПараметров.Вставить("ПечатьКопияРеестраУступаемыхПрав", ПечатьКопияРеестраУступаемыхПрав);
	СписокПараметров.Вставить("ПечататьСвидетельстваОРегистрацииЮрЛица", ПечататьСвидетельстваОРегистрацииЮрЛица);
	СписокПараметров.Вставить("ПечатьКопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав", ПечатьКопияПлатежногоПорученияПодтверждающееОплатуПоДоговоруУступкиПрав);
	СписокПараметров.Вставить("ПечатьДоверенностьПредставителя", ПечатьДоверенностьПредставителя);
	СписокПараметров.Вставить("ПечатьДосьеКлиента", ПечатьДосьеКлиента);
	СписокПараметров.Вставить("ПечатьКопииУчредительныхДокументовКомпании", ПечатьКопииУчредительныхДокументовКомпании);
	
	СписокПараметров.Вставить("ФильтрПечатьУстановлен", ФильтрУстановлен);
	
	
	СписокПараметров.Вставить("ПечатьКопияУведомленияОбУступкеПраваТребования", ПечатьКопияУведомленияОбУступкеПраваТребования);
	СписокПараметров.Вставить("ПечатьВыпискаИзРеестра",ПечатьВыпискаИзРеестра);
	
	СписокПараметров.Вставить("ПечатьНаименование",ПечатьНаименование);
	
	СписокПараметров.Вставить("АдресатСуд",АдресатСуд);
	СписокПараметров.Вставить("АдресатДолжник",АдресатДолжник);
	СписокПараметров.Вставить("АдресатБанк",АдресатБанк);
	
	
	
	ОповеститьОВыборе(СписокПараметров);

	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресатДолжникПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	АдресатБанк=Ложь;
	АдресатСуд=Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресатБанкПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	  АдресатСуд=Ложь;
	  АдресатДолжник=Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресатСудПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	 
	 Если АдресатСуд=Истина Тогда
	 
	 	  АдресатДолжник=Ложь;
	      АдресатБанк=Ложь;

	 
	 КонецЕсли;
	
КонецПроцедуры
