
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДатаСоздания) = Ложь Тогда
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) = Ложь Тогда
		Объект.Исполнитель = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НазваниеДокумента) Тогда
		НазваниеДокумента = Объект.НазваниеДокумента;
	Иначе
		НазваниеДокумента = Объект.Ссылка.Метаданные().Синоним;
	КонецЕсли;
	
	Объект.Наименование = СтрШаблон("%1 от %2", НазваниеДокумента, Формат(Объект.ДатаСоздания, "ДЛФ=D"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтотОбъект.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ДатаСоздания) = Ложь Тогда
		ТекущийОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Исполнитель) = Ложь Тогда
		ТекущийОбъект.Исполнитель = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.НазваниеДокумента) Тогда
		НазваниеДокумента = ТекущийОбъект.НазваниеДокумента;
	Иначе
		НазваниеДокумента = Объект.Ссылка.Метаданные().Синоним;
	КонецЕсли;
	
	ТекущийОбъект.Наименование = СтрШаблон("%1 от %2", НазваниеДокумента, Формат(ТекущийОбъект.ДатаСоздания, "ДЛФ=D"));
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОповещениеВыбораНазвания = Новый ОписаниеОповещения("ПослеВыбораНаименования", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораНазванияДокумента",,ЭтотОбъект,,,, ОповещениеВыбораНазвания, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНаименования(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) И ТипЗнч(Результат) = Тип("Структура") Тогда
		НазваниеДокумента = "";
		Если Результат.Свойство("НаименованиеДокумента", НазваниеДокумента) Тогда
			Объект.НазваниеДокумента = НазваниеДокумента;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры