

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	  
	  
	  ЭлементСписка = Элементы.Список.ТекущаяСтрока;
	  
	  СписокПараметров= ВернутьСтруктуру(ЭлементСписка);
	  СписокПараметров.Вставить("ссылкаСправочник",ЭлементСписка);
	  
	  	 
	  ОповеститьОВыборе(СписокПараметров);
	
	
КонецПроцедуры


&НаСервере
Функция ВернутьСтруктуру(ссылкаспр)

	 данныеСтруктура=Новый Структура; 
	
	 Об=ссылкаспр.ПолучитьОбъект();
	 данныеСтруктура.Вставить("НазваниеОСП",Об.НазваниеОСП);
	 данныеСтруктура.Вставить("АдресОСП",Об.АдресОСП);
	 
	 
	 
	 Возврат данныеСтруктура;

КонецФункции // ()
