Процедура КарточкаДолжника(ТабДок, Должник, Очищать = 1) Экспорт
	Перем ДатаАктуальности;
	
	ДатаАктуальности = ТекущаяДата();
	
	Макет = ЭтотОбъект.ПолучитьМакет("КарточкаДолжника");
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ТекущийОсновнойДолг) КАК ТекущийОсновнойДолг,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ВсегоЗадолженность) КАК ВсегоЗадолженность,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ПросроченныеПроценты) КАК ПросроченныеПроценты,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг) КАК ПросроченныйОсновнойДолг,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.Неустойка) КАК Неустойка,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ДнейПросрочки) КАК ДнейПросрочки,
	               	|	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности КАК ДатаРасчетаЗадолженности,
	               	|	ДанныеДоговоровСрезПоследних.Договор.Ссылка КАК Договор,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.ТекущиеПроценты) КАК ТекущиеПроценты,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.Госпошлина) КАК Госпошлина,
	               	|	СУММА(ДанныеДоговоровСрезПоследних.Прочее) КАК Прочее
	               	|ИЗ
	               	|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&Момент, Договор.Владелец = &Должник) КАК ДанныеДоговоровСрезПоследних
	               	|
	               	|СГРУППИРОВАТЬ ПО
	               	|	ДанныеДоговоровСрезПоследних.Договор,
	               	|	ДанныеДоговоровСрезПоследних.ДатаРасчетаЗадолженности,
	               	|	ДанныеДоговоровСрезПоследних.Договор.Ссылка";
	
	Запрос.УстановитьПараметр("Момент",  ДатаАктуальности);
	Запрос.УстановитьПараметр("Должник", Должник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьТелефоны			= Макет.ПолучитьОбласть("Телефоны");
	ОбластьТелефон			= Макет.ПолучитьОбласть("Телефон");
	ОбластьАдреса			= Макет.ПолучитьОбласть("Адреса");
	ОбластьАдрес			= Макет.ПолучитьОбласть("Адрес");
	ОбластьДоговор			= Макет.ПолучитьОбласть("Договор");
	ОбластьКонтакты			= Макет.ПолучитьОбласть("Контакты");
	ОбластьКонтакт			= Макет.ПолучитьОбласть("Контакт");
	ОбластьДопДанные		= Макет.ПолучитьОбласть("ДопДанные"); 
	
	Если Очищать = 1 Тогда
		ТабДок.Очистить();
	КонецЕсли;
	
	ОбластьШапка.Параметры["ФИО"] = Должник.Наименование;
	
	ТабДок.Вывести(ОбластьШапка);
	
	МестоРаботы = "";
	ДополнительныеДанные = Справочники.ДополнительныеДанные.Выбрать(, Должник.Ссылка);
	Пока ДополнительныеДанные.Следующий() = 1 Цикл
		Если ДополнительныеДанные.Реквизит.Пустая() = 0 Тогда
			Если СокрЛП(ДополнительныеДанные.Реквизит.Наименование)  = "Место работы (наименование организации)" Тогда
				МестоРаботы = СокрЛП(ДополнительныеДанные.Наименование);
				Прервать;
			КонецЕсли
		КонецЕсли
	КонецЦикла;
	
	ОбластьДопДанные.Параметры["ГодРождения"] = Формат(Должник.ДатаРождения, "ДЛФ=ДД"); 
	ОбластьДопДанные.Параметры["ПаспортныеДанные"] = СокрЛП(Должник.НомерПаспорта);
	ОбластьДопДанные.Параметры["МестоРаботы"] = МестоРаботы;
	
	ТабДок.Вывести(ОбластьДопДанные);
	
	// Телефоны
	ТабДок.Вывести(ОбластьТелефоны);
	Телефоны = Справочники.Телефоны.Выбрать(, Должник.Ссылка);
	Пока Телефоны.Следующий() Цикл
		ОбластьТелефон.Параметры["НомерТелефона"] = Телефоны.Наименование;
		ТабДок.Вывести(ОбластьТелефон);
	КонецЦикла;  
	
	// Адреса
	ТабДок.Вывести(ОбластьАдреса);
	Адреса = Справочники.Адреса.Выбрать(, Должник.Ссылка);
	Пока Адреса.Следующий() Цикл
		ОбластьАдрес.Параметры["Адрес"] = Адреса.Наименование;
		ОбластьАдрес.Параметры["ТипАдреса"] = Адреса.Тип;
		ТабДок.Вывести(ОбластьАдрес);
	КонецЦикла;  
	
	// Договор
	Для каждого СтрокаДоговоры Из Результат Цикл
		ОбластьДоговор.Параметры.Заполнить(СтрокаДоговоры);
		ОбластьДоговор.Параметры["ДатаАктуальности"] 			= ДатаАктуальности;
		спрДоговор=СтрокаДоговоры.Договор.ПолучитьОбъект();
		ОбластьДоговор.Параметры["НомерДоговора"]= спрДоговор.НомерДоговора;
		ОбластьДоговор.Параметры["ДатаФинансирования"]= спрДоговор.ДатаФинансирования;
		ОбластьДоговор.Параметры["Банк"]= спрДоговор.Банк;
		
		  
		
		
		ТабДок.Вывести(ОбластьДоговор);
	КонецЦикла; 
	
	// Контакты
	Отбор = Новый Структура("Должник", Должник.Ссылка);
	
	ТабДок.Вывести(ОбластьКонтакты);
	Контакты = Документы.Контакт.Выбрать(,,Отбор);
	Пока Контакты.Следующий() Цикл
		ОбластьКонтакт.Параметры["ОписаниеКонтакта"] 	= Строка(Контакты.Дата) + ", " + Строка(Контакты.ТипКонтакта) + ", причина неплатежа: " + Строка(Контакты.ПричинаНеплатежа);
		ОбластьКонтакт.Параметры["Комментарий"] 		= Контакты.Комментарий;
		ТабДок.Вывести(ОбластьКонтакт);
	КонецЦикла;  
	
КонецПроцедуры
