
&НаКлиенте
Процедура ОтменаПроведения(Команда)
	// Вставить содержимое обработчика.
	
	   ОтменаПроведенияНаСервере();
	
	Сообщить("123");
	
КонецПроцедуры


&НаСервере
Процедура ОтменаПроведенияНаСервере()

	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Платежи.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Платежи КАК Платежи
		|
		|УПОРЯДОЧИТЬ ПО
		|	Платежи.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		 ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

         ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		   
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура Проведение(Команда)
	// Вставить содержимое обработчика.
	
	
	
	Если Взаимодействие=Истина  Тогда
	
		КомандаВыполнитьНажатиеНаСервере();

	
	Иначе
	
		ПроведениеНаСервере();
	
	КонецЕсли;

	  
	 
	 
	
	Сообщить("Все");
	
КонецПроцедуры


&НаСервере
Функция КомандаВыполнитьНажатиеНаСервере()
	
	
	 ФоновыеЗадания.Выполнить("ТестСообщения.ОбработатьФоновоеЗадание");	
	
	
КонецФункции



&НаСервере
Процедура ПроведениеНаСервере()

		
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Платежи.Номер КАК Номер,
		|	Платежи.Дата КАК Дата,
		|	Платежи.Комментарий КАК Комментарий,
		|	Платежи.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Платежи КАК Платежи
		|ГДЕ
		|	Платежи.ПометкаУдаления = &ПометкаУдаления
		|	И Платежи.Проведен = &Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	Запрос.УстановитьПараметр("Проведен", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		  ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

	     ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		 
		 
		 
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА



	//
	// ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

	//     ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	 

	
КонецПроцедуры



   