
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	//// Вставить содержимое обработчика.
	
      ПараметрыОтчета = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
      
      Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
    	     Если ТипЗнч(ПараметрОтчета) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ПараметрОтчета.Параметр = Новый ПараметрКомпоновкиДанных("АдресПараметр") Тогда
    			 
    		 Если ПараметрОтчета.Значение = Ложь Тогда	 
    		  	 
    			 Для Каждого ЭлКолонки Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл

                                       Если ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("Адрес")  Тогда

                                                      ЭлКолонки.Использование = Ложь;

    								  КонецЕсли;
    								  
    								   Если ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("ТипРег")  Тогда

                                                      ЭлКолонки.Использование = Ложь;

    								  КонецЕсли;
    								  
    											  
    											  

    			  КонецЦикла;
    			  
    		  Иначе
    			  Для Каждого ЭлКолонки Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл

                                       Если ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("Адрес")  Тогда

                                                      ЭлКолонки.Использование = Истина;

    								  КонецЕсли;
    								  
    								    Если ЭлКолонки.Поле = Новый ПолеКомпоновкиДанных("ТипРег")  Тогда

                                                      ЭлКолонки.Использование = Истина;

    								  КонецЕсли;

    								  
    											  
    											  

    			  КонецЦикла;

    							   
    		КонецЕсли;
  
    			  
    			 
    	     КонецЕсли;
    	  
      КонецЦикла;
	  
	
		
КонецПроцедуры
