
&НаКлиенте
Процедура Старт(Команда)
	// Вставить содержимое обработчика.
	
	
	  ЗаполнитьКодФССПВДолжник();
	
	Сообщить("Ок");
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьКодФССПВДолжник()

	
	   СтрАдрес="";
	   
	   СпрТипРег=Справочники.ТипыАдресов.НайтиПоНаименованию("Регистрации"); 
	   
	   
	   
	   

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должники.Ссылка КАК Ссылка,
		|	Адреса.Адрес КАК Адрес,
		|   Адреса.Тип Как Тип
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должники КАК Должники
		|		ПО Адреса.Владелец = Должники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыАдресов КАК ТипыАдресов
		|		ПО Адреса.Тип = ТипыАдресов.Ссылка
		|ГДЕ
		|	Адреса.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип", СпрТипРег);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		 СтрАдрес=ВыборкаДетальныеЗаписи.Адрес;
		 
			  // Найду код  в Коды ФССП
			  
			          СтрКодФССП="";
							
						Запрос2 = Новый Запрос;
						Запрос2.Текст = 
							"ВЫБРАТЬ
							|	КодыРегионовФССП.КодРегионаФССП КАК КодРегионаФССП,
							|	КодыРегионовФССП.Синоним КАК Синоним,
							|	КодыРегионовФССП.Наименование КАК Наименование
							|ИЗ
							|	Справочник.КодыРегионовФССП КАК КодыРегионовФССП";
						
						РезультатЗапроса2 = Запрос2.Выполнить();
						
						Выборка = РезультатЗапроса2.Выбрать();
						
						Пока Выборка.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							СтрКодФССП=Выборка.Синоним;
							
							индексстр=Найти(ВРег(СтрАдрес), ВРег(СтрКодФССП));
							
							 Если индексстр<>0 Тогда
								 
								 
								 
								 ЗаписьСправочинка = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
								 ЗаписьСправочинка.КодРегионаФССП=Выборка.КодРегионаФССП;
								 ЗаписьСправочинка.Записать();
								 
								 								 
							 
							 КонецЕсли;  
							
							
						КонецЦикла;
	
	
		   
		 
		 
		 
		
	КонецЦикла;
	
	

	

		Сообщить(СтрАдрес);

	
	

КонецПроцедуры
