Перем датаТемп;

Процедура ПриВыполнении(Отказ)
	// Вставить содержимое обработчика.
	
	Сотрудник=ПараметрыСеанса.Пользователь;
	
	//  проверить заполнена ли контрольная дата
	
	 Если НЕ ЗначениеЗаполнено(Ссылка.КонтрольнаяДата) Тогда
          Отказ = Истина;
		  
		  Сообщить("Запишите изменения....");	 
     КонецЕсли;

	
	 Если КонтрольнаяДата= '00010101' Тогда
		 
		 
	 	  Отказ=Истина;
		  
	      Сообщить("Заполните контрольную дату....");	 
		  
	 Иначе	  
		   
		  датаТемп=Ссылка.КонтрольнаяДата;
		 
		  БПОбъект=Ссылка.БизнесПроцесс.ПолучитьОбъект();
          БПОбъект.ДатаЗавершения=датаТемп;
		  БПОбъект.Записать();
		  
		 
		 
	 КонецЕсли;
	 
	 
	
	 
КонецПроцедуры





Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	 Сотрудник=ПараметрыСеанса.Пользователь;
	 
		 
	 
КонецПроцедуры





