
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	  Если Параметры.Свойство("ДолжникПараметр") Тогда
         //обработка параметра
		    Должник=Параметры.ДолжникПараметр;

      КонецЕсли;

	     поручСтр=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("Поручитель 1");
		 поручДатаРождСтр=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("Поручитель/дата рождения");
		 
		 должМестоРождСтр=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("Место рождения");
		 
		 
		 
	   массивСтр=Новый Массив;
	   массивСтр.Добавить(поручСтр);
	   массивСтр.Добавить(поручДатаРождСтр);
	   массивСтр.Добавить(должМестоРождСтр);
	   
	   
	   
	   
		 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДополнительныеДанные.Наименование КАК Наименование,
				|	ДополнительныеДанные.Реквизит КАК Реквизит
				|ИЗ
				|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
				|ГДЕ
				|	ДополнительныеДанные.Владелец = &Владелец
				|	И ДополнительныеДанные.Реквизит В(&Реквизит)";
			
			Запрос.УстановитьПараметр("Владелец", Должник);
			Запрос.УстановитьПараметр("Реквизит", массивСтр);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				Если Выборка.Реквизит=поручСтр Тогда
					    ФиоПоручитель=Выборка.Наименование;
				
				КонецЕсли;
				
				Если Выборка.Реквизит=поручДатаРождСтр Тогда
					    ДатаРожденияПоручитель=Выборка.Наименование;
				
				КонецЕсли;
				
				
				Если Выборка.Реквизит=должМестоРождСтр Тогда
					    ДолжникМестоРождения=Выборка.Наименование;
				
				КонецЕсли;
				

				
				
				
			КонецЦикла;
			
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	  
	  
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры



